
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	РезультатОперации = ИнтеграцияЕГАИСКлиент.СформироватьЗапросОрганизаций(ИнтеграцияЕГАИСКлиентСервер.ПараметрыЗапросаКлассификатора());
	
	Если НЕ РезультатОперации.Результат Тогда
		Возврат;
	Иначе
		Предупреждение(НСтр("ru = 'Запрос на загрузку классификатора сформирован.'"), 10);
	КонецЕсли;
	
КонецПроцедуры