Функция ПолучитьХост()
	//Возврат "crpt.tabak.spb.local";
	//Возврат "10.101.0.254";
	Возврат "mx.tbkon.ru";
КонецФункции

Функция ПолучитьПорт()
	Возврат 5475;
КонецФункции


Функция ПолучитьСведенияМарок(массивМарок) ЭКСПОРТ	
	возврат ТБК_WS_Клиент.POST( ПолучитьХост(), ПолучитьПорт(),"/api/IsmpCrpt/Info",массивМарок); 
КонецФункции

//результат соответсвие марка-(сруктура(инн, статус)
Функция ПолучитьВладельцаМарок(массивМарок)ЭКСПОРТ
	рез = новый Соответствие;
	
	сведенияМарок = ПолучитьСведенияМарок(массивМарок);
	
	Если ТипЗнч(сведенияМарок) = Тип("Структура") тогда
		Если сведенияМарок.Свойство("error_message") тогда 
			возврат рез;
		КонецЕсли;
	КонецЕсли;

	Для Каждого сведения из сведенияМарок Цикл
		cisInfo = новый Структура("ownerInn,status"); 
		ЗаполнитьЗначенияСвойств(cisInfo,сведения.cisInfo);
		//рез.Вставить(сведения.cisInfo.requestedCis, Новый Структура("ИНН,Статус",cisInfo.ownerInn, cisInfo.status));
		рез.Вставить(сведения.cisInfo.cis, Новый Структура("ИНН,Статус",cisInfo.ownerInn, cisInfo.status));
	КонецЦикла;
	
	возврат рез;
КонецФункции