
&НаСервере
&Вместо("ЗаполнитьСНО")
Процедура ТБКЗаполнитьСНО()
	Если ЗначениеЗаполнено(Запись.СистемаНалогообложения) Тогда
		Если Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
			СистемаНалогообложенияСтрока 	= "УСН";
			УСНОбъектНалогообложения 		= "Доход";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			СистемаНалогообложенияСтрока	= "УСН";
			УСНОбъектНалогообложения 		= Нстр("ru='Доход минус расход'");
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			СистемаНалогообложенияСтрока 	= "Общая";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			СистемаНалогообложенияСтрока 	= "ЕНВД";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			СистемаНалогообложенияСтрока 	= "Патент";	
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			СистемаНалогообложенияСтрока 	= "ЕСН";
			//Марк 2025-02-13
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход5 Тогда
			СистемаНалогообложенияСтрока 	= "УСНДоходРасход5";
		ИначеЕсли Запись.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход7 Тогда
			СистемаНалогообложенияСтрока 	= "УСНДоходРасход7";	
			//КонецМарк	
		КонецЕсли;
	КонецЕсли;
	
	Элементы.УСНОбъектНалогообложения.Видимость = СистемаНалогообложенияСтрока = "УСН";

КонецПроцедуры

&НаКлиенте
&Вместо("УстановитьСНОВЗаписи")
Процедура ТБКУстановитьСНОВЗаписи() 
	
	Если СистемаНалогообложенияСтрока = "УСН" И УСНОбъектНалогообложения = "Доход" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоход");
	ИначеЕсли СистемаНалогообложенияСтрока = "УСН" И УСНОбъектНалогообложения = Нстр("ru='Доход минус расход'") Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "Общая" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "ЕНВД" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕНВД"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "Патент" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.Патент"); 
	ИначеЕсли СистемаНалогообложенияСтрока = "ЕСН"Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕСН");
		//Марк 2025-02-13
	ИначеЕсли СистемаНалогообложенияСтрока = "УСНДоходРасход5" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход5");
		ИначеЕсли СистемаНалогообложенияСтрока = "УСНДоходРасход7" Тогда
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход7");
		//КонецМарк
	Иначе
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&Вместо("СистемаНалогообложенияПриИзменении")
Процедура ТБКСистемаНалогообложенияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	ПроверитьПереходСЕНВД();
	
	УстановитьСНОВЗаписи();
	
	Если СистемаНалогообложенияСтрока <> "Общая" И СистемаНалогообложенияСтрока <> "ЕСН" Тогда
		Запись.ОсвобожденОтНДС = Истина;
	КонецЕсли; 
	
	//Марк 2025-02-21
	Если СистемаНалогообложенияСтрока = "УСНДоходРасход5" или СистемаНалогообложенияСтрока = "УСНДоходРасход7" Тогда
		Запись.ОсвобожденОтНДС = Ложь;	
	КонецЕсли;
	//КонецМарк
	
	УстановитьДоступностьЭлементов();

	
КонецПроцедуры
