
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Магазин = ОбщегоНазначения.ПолучитьМагазин();
	Склад = Справочники.Склады.ПустаяСсылка();
	Если НЕ Магазин.Пустая() Тогда
		
		Склад = Магазин.СкладПродажи;		
	
	КонецЕсли;
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Склад"));
	Параметр.Использование = Истина;        
	Параметр.Значение = Склад;
	
	Если НЕ Номенклатура.Пустая() Тогда
	
		Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Номенклатура"));
		Параметр.Использование = Истина;        
		Параметр.Значение = Номенклатура;	
	иначе
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос, "И ТоварыНаСкладахОстатки.Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");
	КонецЕсли;
	
КонецПроцедуры
