
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокЗапросовЕГАИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбработатьОтветы(Команда)
	
	Результат = ИнтеграцияЕГАИСКлиент.ОбработатьОтветыИзЕГАИС();
	
	Если Результат.Результат Тогда
		Предупреждение(НСтр("ru = 'Обработка ответов из ЕГАИС завершена.'"), 10);
	КонецЕсли;
	
КонецПроцедуры

