&НаКлиенте
Процедура ВызватьОплатитьКартой()Экспорт
	ТБК_ВозвратТоваровОтПокупателяКартой = Истина; // Андрей
	ОплатитьКартой(Неопределено)
КонецПроцедуры

// Толстоухов 23.12.2025 ROZ-8 ++
// При осуществлении возврата не заполнять двенадцать нулей
// и нажимать "Ок"
&НаКлиенте
&Вместо("ОплатитьКартой")
Процедура ТБКОплатитьКартой(Команда)
	
	Перем ПараметрыКассыККМ, ПараметрыЭТ;
	
	
	Если ТБК_ВозвратТоваровОтПокупателяКартой = Истина Тогда
		
		Если НЕ ПроверкаВозможностиРаботыСКартой(ПараметрыКассыККМ, ПараметрыЭТ) Тогда
			Возврат;
		КонецЕсли;
		
		//// &ЗамерПроизводительности
		//ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		//Истина, "Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ.Открытие");
		//
		//
		//// Предварительно авторизуем операцию.
		//ПараметрыФормы = Новый Структура("Сумма, ПределСуммы", Объект.СуммаДокумента, Объект.СуммаДокумента);
		//ПараметрыФормы.Вставить("ЗапретРедактированияСуммы", Истина);
		//Если ПараметрыЭТ.ИспользоватьБезПодключенияОборудования Тогда
		//	ПараметрыФормы.Вставить("ПоказыватьНомерКарты", Истина);
		//КонецЕсли;
		
		ПараметрДействия = Новый Структура;
		ПараметрДействия.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ПараметрДействия.Вставить("ПараметрыЭТ", ПараметрыЭТ);
		ПараметрДействия.Вставить("СуммаОперации", 0);
		ПараметрДействия.Вставить("НомерКарты", "");
		ПараметрДействия.Вставить("НомерСсылкиОперации", "");
		ПараметрДействия.Вставить("НомерЧекаЭТ", 0);
		ПараметрДействия.Вставить("НомерЧекаККМ", Объект.Номер);
		ПараметрДействия.Вставить("СтрокаСлипЧека", "");
		
		Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента") Тогда
			ПараметрДействия.Вставить("ТипТранзакции", "AuthorizeSales");
		Иначе
			ПараметрДействия.Вставить("ТипТранзакции", "AuthorizeRefund");
			//ПараметрыФормы.Вставить("УказатьДополнительныеДанные", Истина);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрДействия", ПараметрДействия);
		
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("Сумма"         , Объект.СуммаДокумента);
		СтруктураВозврата.Вставить("ДанныеКарты"   , "");
		СтруктураВозврата.Вставить("СсылочныйНомер", "000000000000");
		СтруктураВозврата.Вставить("ТипКарты"      , 0);
		СтруктураВозврата.Вставить("НомерКарты"    , "");
		СтруктураВозврата.Вставить("НомерЧека"     , "");
		СтруктураВозврата.Вставить("НомерЧекаЭТ"   , "");
		
		
		ОповещениеОткрытьФормуАвторизацииЭТ(СтруктураВозврата, ДополнительныеПараметры);
		
	Иначе
		
		ПродолжитьВызов(Команда);
		
	КонецЕсли;	
	
КонецПроцедуры

