//Марк 2024-10-10
&НаКлиенте
Процедура ТБКПроверкаСтрокВДокументахПосле(Команда)
	МассивВыделенныхСтрок = Элементы.список.ВыделенныеСтроки;
	ТБКПроверкаСтрокВДокументахПослеНаСервере(МассивВыделенныхСтрок);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТБКПроверкаСтрокВДокументахПослеНаСервере(МассивВыделенныхСтрок)
	ФлВсеХорошо = Истина;	
	Для каждого СтрокаСписка Из МассивВыделенныхСтрок Цикл
		
		ДокументСсылка = СтрокаСписка.Ссылка;
		СтрокаОбъектНеНайден = "<Объект не найден>";
		
		Для каждого СтрокаТовары Из ДокументСсылка.Товары Цикл
			Если СтрНайти(СтрокаТовары.Номенклатура, СтрокаОбъектНеНайден) или СтрокаТовары.Номенклатура.Пустая() 
				ИЛИ  СтрНайти(СтрокаТовары.Характеристика, СтрокаОбъектНеНайден) Тогда
				Сообщить("" + ДокументСсылка + " Номер строки " + СтрокаТовары.НомерСтроки + " не заполнена полностью строка");
				ФлВсеХорошо = Ложь;	
			КонецЕсли;                                                                           
		КонецЦикла; 
		
	КонецЦикла; 
	
	Если ФлВсеХорошо Тогда
	
		Сообщить("Со строками в документах все в порядке");	
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
	Элементы.ФормаПроверкаСтрокВДокументах.Видимость = ВидимостьФормаПроверкаСтрокВДокументах();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВидимостьФормаПроверкаСтрокВДокументах()
	
	ГруппаДоступаАдмин = Справочники.ГруппыДоступа.Администраторы;
	Если ГруппаДоступаАдмин.Пользователи.Найти(Пользователи.ТекущийПользователь(), "Пользователь") <> Неопределено Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//КонецМарк
