
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//проставляем значения

	Период				=	НачалоМесяца(ТекущаяДата());
	ПериодСписок		=	Формат(ТекущаяДата(), "ДФ=MMMM");
	
	//Если Не ЗначениеЗаполнено(Продавец) тогда
	//	Продавец	=	Пользователи.ТекущийПользователь().ФизическоеЛицо;
	//КонецЕсли;
	
	КоличествоСмен						=	ПолучитьКоличествоСмен(Продавец, Период);
	Элементы.КолСменСтрока.Заголовок	=	"Смены:" + Строка(КоличествоСмен);
	
	
	ПроставитьСписокПродавцов(Период);	
	//

	ВариантМотивации	=	ОбщегоНазначения.ПолучитьЗначениеТБККонстанты("ВариантМотивации");
	
	Если ВариантМотивации = 1 тогда
		ЗаполнитьВариантПлановойМотивации();
		
	ИначеЕсли ВариантМотивации = 2 тогда
		Элементы.Переключатель.Видимость	= Ложь;
		//ЗаполнитьВариантПроцентнойМотивации();
		ЗаполнитьВариантПроцентнойМотивации_Личный();
		
	ИначеЕсли ВариантМотивации = 3 тогда
		ЗаполнитьВариантПроцентнойМотивации();//он такой же в общем варианте, отличается только в личном
		
	ИначеЕсли ВариантМотивации = 4 тогда
		ЗаполнитьВариантОбщейМотивации();
		
	ИначеЕсли ВариантМотивации = 5 тогда
		ЗаполнитьВариантНовойМотивации();

		
	ИначеЕсли ВариантМотивации = 6 тогда
		ЗаполнитьВариантНовойМотивации_2();

	КонецЕсли;
	
	Переключатель	=	0;
	
	Если Параметры.Свойство("Развернуть") тогда
		флразвернуть	=	Истина;
	КонецЕсли;
КонецПроцедуры

#Область ПлановаяМотивация
&НаСервере
Процедура ЗаполнитьВариантПлановойМотивации()
	Элементы.Группа3.Видимость	= Ложь;
	Элементы.Группа4.Видимость	= Ложь;
	Элементы.Основная.Видимость	= Истина;
	Элементы.Группа2.Видимость	= Истина; 
	
	Если флПостроенаПлановаяОбщая тогда Возврат КонецЕсли;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	рез = запрос.Выполнить().Выбрать();
	
	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Пока рез.Следующий() цикл	
		СуммаФакт	=	ПолучитьСуммуФактПоТипуПлана(Рез.ТипПлана);
				
		НазваниеДиаграммы	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(Рез.ТипПлана));
		
		НДиаг         	= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);

		НДиаг.Заголовок	=	Строка(Рез.ТипПлана);
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НДиаг);  	
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

		Если Найти(НРег(Строка(Рез.ТипПлана)),"личный") или Найти(НРег(Строка(Рез.ТипПлана)),"план то") тогда
			Диаг 				= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа2);	
		иначе
			Диаг 				= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Основная);	
		КонецЕсли;
		
		
		Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
		Диаг.ПутьКДанным			= НазваниеДиаграммы;
		Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

		НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
		НДиаг.Серии.Добавить("План");

		ТочкаПоПлану = НДиаг.УстановитьТочку("План");
		
		Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
			Если Рез.ТипПлана <> "План личный" тогда 
				ТочкаПоПлану_Сегодня 				= НДиаг.УстановитьТочку("План_НаСегодня");		
				ТочкаПоПлану_Сегодня.текст			=	"План на сегодня";
				ТочкаПоПлану_Сегодня.ПриоритетЦвета	=	Истина;  
			КонецЕсли;
		КонецЕсли;

		ТочкаПоФакту = НДиаг.УстановитьТочку("Факт");
		
		ТочкаПоФакту.ПриоритетЦвета	=Истина;   		
		ТочкаПоПлану.ПриоритетЦвета	=Истина;	
		ТочкаПоПлану.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
		
		НужСумма	=	рез.Сумма;
		
		//пришлось умножать на кол. смен
		Если Рез.ТипПлана = "План личный" тогда
			Запрос			=	Новый Запрос("ВЫБРАТЬ
			      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
			      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
			      			 	             |ПОМЕСТИТЬ ПродавцыСмены
			      			 	             |ИЗ
			      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
			      			 	             |ГДЕ
			      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
			      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
			      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
			      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
			      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец = &Продавец
			      			 	             |
			      			 	             |СГРУППИРОВАТЬ ПО
			      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
			      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
			      			 	             |;
			      			 	             |
			      			 	             |////////////////////////////////////////////////////////////////////////////////
			      			 	             |ВЫБРАТЬ
			      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
			      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
			      			 	             |ИЗ
			      			 	             |	ПродавцыСмены КАК ПродавцыСмены
			      			 	             |
			      			 	             |СГРУППИРОВАТЬ ПО
			      			 	             |	ПродавцыСмены.Продавец");
			Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
			Запрос.УстановитьПараметр("Продавец",Продавец);
			Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);

			ТЗПродавцыСмены	=	Запрос.Выполнить().Выгрузить();
			НужСтрока	=	ТЗПродавцыСмены.Найти(Продавец) ;
			Если НужСтрока <> Неопределено тогда 
				
				Если НачалоМесяца(Период) = НачалоМесяца(ТекущаяДата()) тогда
					КолСмен	=	НужСтрока.КолСмен + 1;
				иначе
					КолСмен	=	НужСтрока.КолСмен;
				КонецЕсли;

			иначе
				КолСмен	=	1;	
			КонецЕсли;       
		
			НужСумма = НужСумма * КолСмен;
		КонецЕсли; 			
       	//
		
		Если СуммаФакт >  НужСумма тогда	
			ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
		иначе
			ТочкаПоФакту.Цвет	=	WebЦвета.Бирюзовый;
		КонецЕсли;
		
		ПроцентВыполнения	=	Окр((СуммаФакт / НужСумма) * 100,2);
		
		НДиаг.УстановитьЗначение(ТочкаПоПлану
				, НДиаг.Серии[0]
				, НужСумма
				, Неопределено
				, Рез.ТипПлана + " "+НужСумма);
				
		Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
			Если Рез.ТипПлана <> "План личный" тогда 
				КолДней			=	День(Период);
				КолДнейВМесяце	=	День(КонецМесяца(Период));
				
				СуммаПланНаСегодня	=	Окр(НужСумма / КолДнейВМесяце,2);
				СуммаПланНаСегодня	=	СуммаПланНаСегодня *  КолДней;
				
				НДиаг.УстановитьЗначение(ТочкаПоПлану_Сегодня
					, НДиаг.Серии[0]
					, СуммаПланНаСегодня
					, Неопределено
					, Рез.ТипПлана + "(на сег.день) "+ СуммаПланНаСегодня);
					
				Если СуммаФакт >  СуммаПланНаСегодня тогда	
					ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
				иначе
					ТочкаПоФакту.Цвет	=	WebЦвета.Бирюзовый;
				КонецЕсли;     
			КонецЕсли;    
		КонецЕсли;
		

		НДиаг.УстановитьЗначение(ТочкаПоФакту
			, НДиаг.Серии[0]
			, СуммаФакт
			, Неопределено
			, "Факт. продажи" + " " + СуммаФакт + "; Процент выполнения:"+ПроцентВыполнения+"%");  		
			
			
		НДиаг.ОтображатьЛегенду	= Ложь;	 		
		НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
		НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
		НДиаг.АвтоМинимальноеЗначение	=	Ложь;
		НДиаг.МаксимальноеЗначение		=	Макс(НужСумма, СуммаФакт) + НужСумма/10;
		НДиаг.МинимальноеЗначение		=	-0.01; 

	КонецЦикла; 
	
	флПостроенаПлановаяОбщая = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантПлановойМотивации_Личный()

	Элементы.Основная.Видимость	= Ложь;
	Элементы.Группа2.Видимость	= Ложь;
	Элементы.Группа3.Видимость	= Истина;
	Элементы.Группа4.Видимость	= Истина; 
	
	Если флПостроенаПлановаяЛичная тогда Возврат КонецЕсли;

		
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана <> ""План личный""
	      	 	             |			И ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана <> ""План ТО""
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	рез = запрос.Выполнить().Выбрать(); 
	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Пока рез.Следующий() цикл	
		СуммаПлан		=	Рез.Сумма; 		
 		КоличествоДней 	=	Сред(КонецМесяца(Период), 1, 2);
		СуммаПлан_Смена	=	Окр(СуммаПлан / КоличествоДней,0);
		
		Запрос			=	Новый Запрос("ВЫБРАТЬ
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
		      			 	             |ПОМЕСТИТЬ ПродавцыСмены
		      			 	             |ИЗ
		      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		      			 	             |ГДЕ
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
		      			 	             |;
		      			 	             |
		      			 	             |////////////////////////////////////////////////////////////////////////////////
		      			 	             |ВЫБРАТЬ
		      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
		      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
		      			 	             |ИЗ
		      			 	             |	ПродавцыСмены КАК ПродавцыСмены
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	ПродавцыСмены.Продавец");
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);

		ТЗПродавцыСмены	=	Запрос.Выполнить().Выгрузить();
		НужСтрока	=	ТЗПродавцыСмены.Найти(Продавец) ;
		Если НужСтрока= Неопределено тогда 
			НовСтр	=	ТЗПродавцыСмены.Добавить();
			НовСтр.Продавец	=	Продавец;
			НовСтр.КолСмен	=	1;
		иначе
			Если НачалоМесяца(Период) = НачалоМесяца(ТекущаяДата()) тогда
				НужСтрока.КолСмен	=	НужСтрока.КолСмен + 1;	
			КонецЕсли;
		КонецЕсли;         	
		
		ТЗ_СуммаФактПоГруппамПоПродавцам	=	ПолучитьСуммуФактПоГруппамПоПродавцам_ПлановаяМотивация(Рез.ТипПлана); 	
		
		Ном = 0;
		Для каждого ПродавцыСмены из  ТЗПродавцыСмены цикл
			//СуммаФакт		=	ПолучитьСуммуФактПоТипуПлана_Личный(Рез.ТипПлана, ПродавцыСмены.Продавец);
			//СуммаФактДень	=	ПолучитьСуммуФактПоТипуПлана_Личный(Рез.ТипПлана, ПродавцыСмены.Продавец, НачалоДня(Период));
			
			НужСтрока		=	ТЗ_СуммаФактПоГруппамПоПродавцам.найти(ПродавцыСмены.Продавец);
			Если НужСтрока = Неопределено тогда
				СуммаФакт		=	0;
				СуммаФактДень	=	0;
			иначе
				СуммаФакт		=	НужСтрока.СуммаЧеки;
				СуммаФактДень	=	НужСтрока.СуммаЧекиСегодня;
			КонецЕсли;

			
			
			
			КолСмен			=	ПродавцыСмены.КолСмен;
			
			НазваниеДиаграммы	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(ПродавцыСмены.Продавец) + Строка(Рез.ТипПлана));
			
			НДиаг         	= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);

			НДиаг.Заголовок	=	Строка(Рез.ТипПлана);
			
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(НДиаг);  	
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

			Если Ном = 1 тогда
				Элементы.Группа4.Заголовок				=	Строка(ПродавцыСмены.Продавец) + "; Кол. смен: " + КолСмен;
				Элементы.Группа4.ОтображатьЗаголовок	=	Истина; 				
				Диаг 									=   ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа4);  	
			иначе
				Элементы.Группа3.Заголовок				=	Строка(ПродавцыСмены.Продавец) + "; Кол. смен: " + КолСмен;
				Элементы.Группа3.ОтображатьЗаголовок	=	Истина;   
				Диаг 									=   ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа3);
			КонецЕсли; 
			
			Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
			Диаг.ПутьКДанным			= НазваниеДиаграммы; 
			Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

			НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
			НДиаг.Серии.Добавить("План");

			ТочкаПоПлану = НДиаг.УстановитьТочку("План");
			ТочкаПоФакту = НДиаг.УстановитьТочку("Факт");
			
			ТочкаПоПлану_День = НДиаг.УстановитьТочку("План день");
			ТочкаПоФакту_День = НДиаг.УстановитьТочку("Факт сегодня");
			
			ТочкаПоФакту.ПриоритетЦвета	=Истина;   		
			ТочкаПоПлану.ПриоритетЦвета	=Истина;	
			
			ТочкаПоПлану_День.ПриоритетЦвета	=Истина;   		
			ТочкаПоФакту_День.ПриоритетЦвета	=Истина;
			
			ТочкаПоПлану.Цвет		=	WebЦвета.БледноКрасноФиолетовый;	
			ТочкаПоПлану_День.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
			
			СуммаПлан	=	СуммаПлан_Смена * КолСмен;
			
			Если СуммаФакт >  СуммаПлан тогда	
				ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
			иначе
				ТочкаПоФакту.Цвет	=	WebЦвета.Бирюзовый;
			КонецЕсли;  
			
			Если СуммаФактДень >  СуммаПлан_Смена тогда	
				ТочкаПоФакту_День.Цвет	=	WebЦвета.ЗеленаяЛужайка;
			иначе
				ТочкаПоФакту_День.Цвет	=	WebЦвета.Бирюзовый;
			КонецЕсли;  
			
			ПроцентВыполнения		=	Окр((СуммаФакт / СуммаПлан) * 100,2);
			ПроцентВыполнения_День	=	Окр((СуммаФактДень / СуммаПлан_Смена) * 100,2);

			НДиаг.УстановитьЗначение(ТочкаПоПлану
					, НДиаг.Серии[0]
					, СуммаПлан
					, Неопределено
					, Рез.ТипПлана + " "+СуммаПлан);
			

			НДиаг.УстановитьЗначение(ТочкаПоФакту
				, НДиаг.Серии[0]
				, СуммаФакт
				, Неопределено
				, "Факт. продажи" + " " + СуммаФакт + "; Процент выполнения:"+ПроцентВыполнения+"%");
				
				
				
			НДиаг.УстановитьЗначение(ТочкаПоПлану_День
					, НДиаг.Серии[0]
					, СуммаПлан_Смена
					, Неопределено
					, Рез.ТипПлана + " "+СуммаПлан_Смена);
			

			НДиаг.УстановитьЗначение(ТочкаПоФакту_День
				, НДиаг.Серии[0]
				, СуммаФактДень
				, Неопределено
				, "Факт. продажи" + " " + СуммаФактДень + "; Процент выполнения:"+ПроцентВыполнения_День+"%");  
				
				
			НДиаг.ОтображатьЛегенду			=   Ложь;	 		
			НДиаг.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
			НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
			НДиаг.АвтоМинимальноеЗначение	=	Ложь;
			НДиаг.МаксимальноеЗначение		=	Макс(СуммаПлан, СуммаФакт) + СуммаПлан/10;
			НДиаг.МинимальноеЗначение		=	-0.01; 

			Ном	=	Ном+1;
		КонецЦикла;
	КонецЦикла;   	  

	флПостроенаПлановаяЛичная	=	Истина;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуФактПоТипуПлана(ТипПлана, ЗаДень = Ложь, ЗаСегодня = Ложь)     	
	//Личный
	Если ТипПлана = "План личный" тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка КАК Ссылка
		      	 	             |ПОМЕСТИТЬ Доки
		      	 	             |ИЗ
		      	 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		      	 	             |ГДЕ
		      	 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		      	 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец = &Продавец
		      	 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		      	 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
		      	 	             |;
		      	 	             |
		      	 	             |////////////////////////////////////////////////////////////////////////////////
		      	 	             |ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ТБК_ВедомостьОПродажахЗаДень.ВыручкаЗаСменуПоКассе - ТБК_ВедомостьОПродажахЗаДень.ВозвратОтПокупателяНал - ТБК_ВедомостьОПродажахЗаДень.ВозвратОтПокупателяБезНал), 0) КАК СуммаВедомости
		      	 	             |ИЗ
		      	 	             |	Доки КАК Доки
		      	 	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТБК_ВедомостьОПродажахЗаДень КАК ТБК_ВедомостьОПродажахЗаДень
		      	 	             |		ПО Доки.Ссылка = ТБК_ВедомостьОПродажахЗаДень.Ссылка
		      	 	             |;
		      	 	             |
		      	 	             |////////////////////////////////////////////////////////////////////////////////
		      	 	             |ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
		      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		      	 	             |ГДЕ
		      	 	             |	ЧекККМТовары.Ссылка.Проведен
		      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
		      	 	             |	И ЧекККМТовары.Продавец = &Продавец");
		
		Если не ЗаДень тогда
			Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		иначе
			Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период)); 			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
		Запрос.УстановитьПараметр("Продавец",Продавец);
		Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
		Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
		
		Рез = Запрос.ВыполнитьПакет();
		
		СуммаФАкт	=	Рез[1].Выгрузить()[0].СуммаВедомости + Рез[2].Выгрузить()[0].СуммаЧеки;
				
		//Запрос			=	Новый Запрос("ВЫБРАТЬ
		//	      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
		//	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
		//	      			 	             |ПОМЕСТИТЬ ПродавцыСмены
		//	      			 	             |ИЗ
		//	      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		//	      			 	             |ГДЕ
		//	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		//	      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		//	      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		//	      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
		//	      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец = &Продавец
		//	      			 	             |
		//	      			 	             |СГРУППИРОВАТЬ ПО
		//	      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
		//	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
		//	      			 	             |;
		//	      			 	             |
		//	      			 	             |////////////////////////////////////////////////////////////////////////////////
		//	      			 	             |ВЫБРАТЬ
		//	      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
		//	      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
		//	      			 	             |ИЗ
		//	      			 	             |	ПродавцыСмены КАК ПродавцыСмены
		//	      			 	             |
		//	      			 	             |СГРУППИРОВАТЬ ПО
		//	      			 	             |	ПродавцыСмены.Продавец");
		//Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		//Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		//Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
		//Запрос.УстановитьПараметр("Продавец",Продавец);

		//ТЗПродавцыСмены	=	Запрос.Выполнить().Выгрузить();
		//Если ТЗПродавцыСмены.Количество() = 0 тогда 
		//	КолСмен	=	1;	
		//иначе
		//	Если НачалоМесяца(Период) = НачалоМесяца(ТекущаяДата()) тогда
		//		КолСмен	=	ТЗПродавцыСмены[0].КолСмен +1;	
		//	иначе
		//		КолСмен	=	ТЗПродавцыСмены[0].КолСмен;	
		//	КонецЕсли;
		//КонецЕсли;
		
		//СуммаФАкт	=	СуммаЗаДень * КоличествоСмен;
			
		Возврат СуммаФАкт;
	КонецЕсли;
	
	//Общий
	Если ТипПлана = "План ТО" тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ПродажиОбороты.СтоимостьОборот), 0) КАК Сумма
		      	 	             |ИЗ
		      	 	             |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, , ) КАК ПродажиОбороты
		      	 	             |ГДЕ
		      	 	             |	ТИПЗНАЧЕНИЯ(ПродажиОбороты.ДокументПродажи) <> ТИП(Документ.РеализацияТоваров)");
		Если не ЗаДень тогда
			Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		иначе
			Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период)); 			
		КонецЕсли;
		
		Если ЗаСегодня тогда
			Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ТекущаяДата())); 	
		КонецЕсли;
		
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() тогда
			Возврат Рез.сумма;
		иначе
			Возврат 0;
		КонецЕсли;

	КонецЕсли;

	//По группам товаров. Не используется 
	//Запрос	=	Новый Запрос("ВЫБРАТЬ
	//      	 	             |	ТБКГруппыНоменклатурыДляПланов.Номенклатура КАК Номенклатура
	//      	 	             |ИЗ
	//      	 	             |	Справочник.ТБКГруппыНоменклатурыДляПланов КАК ТБКГруппыНоменклатурыДляПланов
	//      	 	             |ГДЕ
	//      	 	             |	ТБКГруппыНоменклатурыДляПланов.ТипПлана = &ТипПлана");
	//Запрос.УстановитьПараметр("ТипПлана",ТипПлана);
	//Рез = Запрос.Выполнить().Выгрузить();

	//
	//Запрос	=	Новый Запрос("ВЫБРАТЬ
	//      	 	             |	ЕСТЬNULL(СУММА(ПродажиОбороты.СтоимостьОборот), 0) КАК Сумма
	//      	 	             |ИЗ
	//      	 	             |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, , Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ПродажиОбороты
	//      	 	             |ГДЕ
	//      	 	             |	ТИПЗНАЧЕНИЯ(ПродажиОбороты.ДокументПродажи) <> ТИП(Документ.РеализацияТоваров)");
	//
	//Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	//Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	//Запрос.УстановитьПараметр("Номенклатура",Рез.ВыгрузитьКолонку("Номенклатура"));
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//Если рез.Следующий() тогда
	//	Возврат Рез.Сумма;
	//иначе
	//	Возврат 0;
	//КонецЕсли;

	
КонецФункции

Функция ПолучитьСуммуФактПоТипуПлана_Личный(ТипПлана, Продавец_, НачалоПериода = Неопределено, ВариантМотивации = 1)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.Номенклатура КАК Номенклатура
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКГруппыНоменклатурыДляПланов КАК ТБКГруппыНоменклатурыДляПланов
	      	 	             |ГДЕ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.ТипПлана = &ТипПлана");
	Запрос.УстановитьПараметр("ТипПлана",ТипПлана);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И ЧекККМТовары.Продавец = &Продавец
	      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)");
		
		
		Если НачалоПериода = Неопределено тогда
			Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
			Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		иначе //строим за текущий день
			Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("ДатаКон",КонецДня(ТекущаяДата()));
		КонецЕсли;
		

		Запрос.УстановитьПараметр("Номенклатура",Рез.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("Продавец",Продавец_);
		Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
		Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
		Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
		
		Если ТипПлана = "План ТО" тогда
			Запрос.Текст	=	СтрЗаменить(Запрос.Текст, "И ЧекККМТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");			
		КонецЕсли;
		
		Рез = Запрос.Выполнить().Выбрать();
		Если рез.Следующий() тогда
			Возврат рез.СуммаЧеки;
		иначе
			Возврат 0;
		КонецЕсли;
	
	
КонецФункции


Функция ПолучитьСуммуФактПоГруппамПоПродавцам_ПлановаяМотивация(ТипПлана)  
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.Номенклатура КАК Номенклатура
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКГруппыНоменклатурыДляПланов КАК ТБКГруппыНоменклатурыДляПланов
	      	 	             |ГДЕ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.ТипПлана = &ТипПлана");
	Запрос.УстановитьПараметр("ТипПлана",ТипПлана);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	СУММА(ЕСТЬNULL(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ, 0)) КАК СуммаЧеки,
	      	 	             |	ЧекККМТовары.Продавец КАК Продавец,
	      	 	             |	СУММА(ЕСТЬNULL(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.Дата >= &ТекДень
	      	 	             |					ТОГДА ВЫБОР
	      	 	             |							КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |								ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |							ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |						КОНЕЦ
	      	 	             |				ИНАЧЕ 0
	      	 	             |			КОНЕЦ, 0)) КАК СуммаЧекиСегодня
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ЧекККМТовары.Продавец");
		
		
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ТекДень",НачалоДня(ТекущаяДата())); 
	
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("Номенклатура",Рез.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции


#КонецОбласти 

#Область ПроцентнаяМотивация
&НаСервере
Процедура ЗаполнитьВариантПроцентнойМотивации()
	Элементы.Группа3.Видимость	= Ложь;
	Элементы.Группа4.Видимость	= Ложь;
	Элементы.Фокусная.Видимость	= Ложь;
	Элементы.Группа7.Видимость	= Ложь;
	Элементы.Основная.Видимость	= Истина;
	Элементы.Группа2.Видимость	= Истина; 
	
	Если флПостроенаПлановаяОбщая тогда Возврат КонецЕсли;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана = &ТипПлана
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	Запрос.УстановитьПараметр("ТипПлана","План ТО");
	рез = запрос.Выполнить().Выбрать(); 	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Если рез.Следующий() тогда	
		СуммаФакт	=	ПолучитьСуммуФактПоТипуПлана(Рез.ТипПлана); 		
		
		НазваниеДиаграммы	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(Рез.ТипПлана));
		
		НДиаг         	= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);

		НДиаг.Заголовок	=	Строка(Рез.ТипПлана);
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НДиаг);  	
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
		Диаг 				= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Основная);	
		
		Диаг.Вид			= ВидПоляФормы.ПолеДиаграммы; 
		Диаг.ПутьКДанным	= НазваниеДиаграммы;

		НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
		НДиаг.Серии.Добавить("План");

		ТочкаПоПлану = НДиаг.УстановитьТочку("План");
		
		Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
			ТочкаПоПлану_Сегодня 				= НДиаг.УстановитьТочку("План_НаСегодня");		
			ТочкаПоПлану_Сегодня.текст			=	"План на сегодня";
			ТочкаПоПлану_Сегодня.ПриоритетЦвета	=	Истина; 
		КонецЕсли;

		ТочкаПоФакту = НДиаг.УстановитьТочку("Факт");
		
		ТочкаПоФакту.ПриоритетЦвета	=Истина;   		
		ТочкаПоПлану.ПриоритетЦвета	=Истина;	
		ТочкаПоПлану.Цвет	=	WebЦвета.БледноКрасноФиолетовый;		
		
		
		НДиаг.УстановитьЗначение(ТочкаПоПлану
				, НДиаг.Серии[0]
				, рез.Сумма
				, Неопределено
				, Рез.ТипПлана + " "+рез.Сумма);
				
		КолДней			=	День(Период);
		КолДнейВМесяце	=	День(КонецМесяца(Период));
		
		Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
			СуммаПланНаСегодня	=	Окр(рез.Сумма / КолДнейВМесяце,2);
			СуммаПланНаСегодня	=	СуммаПланНаСегодня *  КолДней;
			
			НДиаг.УстановитьЗначение(ТочкаПоПлану_Сегодня
				, НДиаг.Серии[0]
				, СуммаПланНаСегодня
				, Неопределено
				, Рез.ТипПлана + "(на сег.день) "+ СуммаПланНаСегодня);
				
			Если СуммаФакт >  СуммаПланНаСегодня тогда	
				ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
			иначе
				ТочкаПоФакту.Цвет	=	WebЦвета.Бирюзовый;
			КонецЕсли;  
		КонецЕсли;
		

		НДиаг.УстановитьЗначение(ТочкаПоФакту
			, НДиаг.Серии[0]
			, СуммаФакт
			, Неопределено
			, "Факт. продажи" + " " + СуммаФакт);  		
			
			
		НДиаг.ОтображатьЛегенду	= Ложь;	 		
		НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
		НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
		НДиаг.АвтоМинимальноеЗначение	=	Ложь;
		НДиаг.МаксимальноеЗначение		=	Макс(рез.Сумма, СуммаФакт) + рез.Сумма/10;
		НДиаг.МинимальноеЗначение		=	-0.01; 
		Диаг.Ширина						=	100;
		Диаг.Высота						=	20;
	КонецЕсли; 
	
	флПостроенаПлановаяОбщая = Истина;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВариантПроцентнойМотивации_Личный()

	Элементы.Основная.Видимость	= Ложь;
	Элементы.Группа2.Видимость	= Ложь;
	Элементы.Группа3.Видимость	= Истина;
	Элементы.Группа4.Видимость	= Истина; 
	
	Если флПостроенаПлановаяЛичная тогда Возврат КонецЕсли;

		
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Процент КАК Процент
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана = ""План ТО""
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	рез = запрос.Выполнить().Выбрать(); 
	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Если  рез.Следующий() тогда	
		СуммаПлан		=	Рез.Сумма; 		
 		КоличествоДней 	=	Сред(КонецМесяца(Период), 1, 2);
		СуммаПлан_Смена	=	Окр(СуммаПлан / КоличествоДней,0);
		
		Запрос			=	Новый Запрос("ВЫБРАТЬ
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
		      			 	             |ПОМЕСТИТЬ ПродавцыСмены
		      			 	             |ИЗ
		      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		      			 	             |ГДЕ
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
		      			 	             |;
		      			 	             |
		      			 	             |////////////////////////////////////////////////////////////////////////////////
		      			 	             |ВЫБРАТЬ
		      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
		      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
		      			 	             |ИЗ
		      			 	             |	ПродавцыСмены КАК ПродавцыСмены
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	ПродавцыСмены.Продавец");
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
		Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);

		ТЗПродавцыСмены	=	Запрос.Выполнить().Выгрузить();
		НужСтрока	=	ТЗПродавцыСмены.Найти(Продавец) ;
		Если НужСтрока= Неопределено тогда 
			НовСтр	=	ТЗПродавцыСмены.Добавить();
			НовСтр.Продавец	=	Продавец;
			НовСтр.КолСмен	=	1;
		иначе 			
			Если НачалоМесяца(Период) = НачалоМесяца(ТекущаяДата()) тогда
				НужСтрока.КолСмен	=	НужСтрока.КолСмен + 1;	
			КонецЕсли;

		КонецЕсли;
		
		ТЗ_СуммаФактПоВсемГруппамПоПродавцам 			=   ПолучитьСуммуФактПоВсемГруппамПоПродавцам(); 
	
		
		Ном = 0;
		Для каждого ПродавцыСмены из  ТЗПродавцыСмены цикл
			СуммаФакт		=	ПолучитьСуммуФактПоТипуПлана_Личный(Рез.ТипПлана, ПродавцыСмены.Продавец,,ВариантМотивации);
			СуммаФактДень	=	ПолучитьСуммуФактПоТипуПлана_Личный(Рез.ТипПлана, ПродавцыСмены.Продавец, НачалоДня(Период), ВариантМотивации);
			КолСмен			=	ПродавцыСмены.КолСмен;
			
			//Считаем по процентам
			НужПроцент = Рез.Процент;
			//СуммаФактПоВсемГруппам 			=   ПолучитьСуммуФактПоВсемГруппам(ПродавцыСмены.Продавец);		
			//СуммаФактПоВсемГруппам_День 	=   ПолучитьСуммуФактПоВсемГруппам(ПродавцыСмены.Продавец, НачалоДня(Период));
			
			НужСтрока					=	ТЗ_СуммаФактПоВсемГруппамПоПродавцам.найти(ПродавцыСмены.Продавец);
			Если НужСтрока = Неопределено тогда
				СуммаФактПоВсемГруппам		=	0;
				СуммаФактПоВсемГруппам_День	=	0;
			иначе
				СуммаФактПоВсемГруппам		=	НужСтрока.СуммаЧеки;
				СуммаФактПоВсемГруппам_День	=	НужСтрока.СуммаЧекиСегодня;
			КонецЕсли;
			

			СуммаБонуса				=	Окр((СуммаФактПоВсемГруппам / 100) * НужПроцент,0);	
			СуммаБонуса_День		=	Окр((СуммаФактПоВсемГруппам_День / 100) * НужПроцент,0);
			//
			
			НазваниеДиаграммы	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(ПродавцыСмены.Продавец) + Строка(Рез.ТипПлана));
			
			НДиаг         	= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);

			НДиаг.Заголовок	=	Строка(Рез.ТипПлана);
			
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(НДиаг);  	
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

			Если Ном = 1 тогда
				Элементы.Группа4.Заголовок				=	Строка(ПродавцыСмены.Продавец) + "; Кол. смен: " + КолСмен + 
															"; Всего продаж без стиков и сигарет: " + СуммаФактПоВсемГруппам + "р.; Сумма премии: "+СуммаБонуса + "р.";
				
				Элементы.Группа4.ОтображатьЗаголовок	=	Истина; 				                                                                              
				Диаг 									=   ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа4);  	
			иначе
				Элементы.Группа3.Заголовок				=	Строка(ПродавцыСмены.Продавец) + "; Кол. смен: " + КолСмен + 
															"; Всего продаж без стиков и сигарет: " + СуммаФактПоВсемГруппам + "р.; Сумма премии: "+СуммаБонуса + "р.";
				
				Элементы.Группа3.ОтображатьЗаголовок	=	Истина;   
				Диаг 									=   ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа3);
			КонецЕсли; 
			
			Диаг.Вид			= ВидПоляФормы.ПолеДиаграммы; 
			Диаг.ПутьКДанным	= НазваниеДиаграммы;  

			НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
			НДиаг.Серии.Добавить("План");

			//ТочкаПоПлану 					= НДиаг.УстановитьТочку("План");
			ТочкаПоФакту 					= НДиаг.УстановитьТочку("Факт");
			ТочкаПоФактуБезСтиковиСигарет 	= НДиаг.УстановитьТочку("Факт без стиков и сиг-т");  
			ТочкаСуммаБонуса			 	= НДиаг.УстановитьТочку("Сумма премии");

			
			//ТочкаПоПлану_День 					= НДиаг.УстановитьТочку("План день");
			Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
				ТочкаПоФакту_День 					= НДиаг.УстановитьТочку("Факт сегодня");
				ТочкаПоФактуБезСтиковиСигарет_День 	= НДиаг.УстановитьТочку("Факт без стиков и сиг-т сегодня");  
				ТочкаСуммаБонуса_День			 	= НДиаг.УстановитьТочку("Сумма премии сегодня");
				
				ТочкаПоФакту_День.ПриоритетЦвета					=Истина;   
				ТочкаСуммаБонуса_День.ПриоритетЦвета				=Истина;
				ТочкаПоФактуБезСтиковиСигарет_День.Цвет	=	WebЦвета.Золотой;			
				ТочкаПоФактуБезСтиковиСигарет_День.ПриоритетЦвета	=Истина;   		
				ТочкаСуммаБонуса_День.Цвет				=	WebЦвета.Пурпурный; 			

			КонецЕсли;
			
			ТочкаПоФакту.ПриоритетЦвета							=Истина;   		
			//ТочкаПоПлану.ПриоритетЦвета							=Истина;			
			//ТочкаПоПлану_День.ПриоритетЦвета					=Истина;   		
			ТочкаПоФактуБезСтиковиСигарет.ПриоритетЦвета		=Истина;   		
			ТочкаСуммаБонуса.ПриоритетЦвета						=Истина;

			
			ТочкаПоФактуБезСтиковиСигарет.Цвет		=	WebЦвета.Золотой;	
			ТочкаСуммаБонуса.Цвет					=	WebЦвета.Пурпурный;	
			//ТочкаПоПлану.Цвет						=	WebЦвета.БледноКрасноФиолетовый;	
			//ТочкаПоПлану_День.Цвет					=	WebЦвета.БледноКрасноФиолетовый;
			
			//СуммаПлан	=	СуммаПлан_Смена * КолСмен;
			
			Если СуммаФакт >  СуммаПлан тогда	
				ТочкаПоФакту.Цвет	=	WebЦвета.ЛимонноЗеленый;
			иначе
				ТочкаПоФакту.Цвет	=	WebЦвета.Бирюзовый;
			КонецЕсли;  
			
			Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
				Если СуммаФактДень >  СуммаПлан_Смена тогда	
					ТочкаПоФакту_День.Цвет	=	WebЦвета.ЛимонноЗеленый;
				иначе
					ТочкаПоФакту_День.Цвет	=	WebЦвета.Бирюзовый;
				КонецЕсли;  
			КонецЕсли;
			
			//НДиаг.УстановитьЗначение(ТочкаПоПлану
			//		, НДиаг.Серии[0]
			//		, СуммаПлан
			//		, Неопределено
			//		, Рез.ТипПлана + " "+СуммаПлан);
			

			НДиаг.УстановитьЗначение(ТочкаПоФакту
				, НДиаг.Серии[0]
				, СуммаФакт
				, Неопределено
				, "Факт. продажи" + " " + СуммаФакт); 
				
				
			НДиаг.УстановитьЗначение(ТочкаПоФактуБезСтиковиСигарет
				, НДиаг.Серии[0]
				, СуммаФактПоВсемГруппам
				, Неопределено
				, "Факт. продажи без стиков и сиг-т" + " " + СуммаФактПоВсемГруппам);  

			НДиаг.УстановитьЗначение(ТочкаСуммаБонуса
				, НДиаг.Серии[0]
				, СуммаБонуса
				, Неопределено
				, "Сумма премии" + " " + СуммаБонуса); 			
				
				
			//НДиаг.УстановитьЗначение(ТочкаПоПлану_День
			//		, НДиаг.Серии[0]
			//		, СуммаПлан_Смена
			//		, Неопределено
			//		, Рез.ТипПлана + " "+СуммаПлан_Смена);
			

			Если НачалоМесяца(ТекущаяДата()) = НачалоМесяца(Период) тогда
				НДиаг.УстановитьЗначение(ТочкаПоФакту_День
					, НДиаг.Серии[0]
					, СуммаФактДень
					, Неопределено
					, "Факт. продажи" + " " + СуммаФактДень);
					
				НДиаг.УстановитьЗначение(ТочкаПоФактуБезСтиковиСигарет_День
					, НДиаг.Серии[0]
					, СуммаФактПоВсемГруппам_День
					, Неопределено
					, "Факт. продажи без стиков и сиг-т сегодня" + " " + СуммаФактПоВсемГруппам_День);  

				НДиаг.УстановитьЗначение(ТочкаСуммаБонуса_День
					, НДиаг.Серии[0]
					, СуммаБонуса_День
					, Неопределено
					, "Сумма премии" + " " + СуммаБонуса_День);
			КонецЕсли;
				
				
				
			НДиаг.ОтображатьЛегенду			=   Ложь;	 		
			НДиаг.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
			НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
			НДиаг.АвтоМинимальноеЗначение	=	Ложь;
			НДиаг.МаксимальноеЗначение		=	СуммаФакт + СуммаФакт/10;
			НДиаг.МинимальноеЗначение		=	-0.01; 

			Ном	=	Ном+1;
		КонецЦикла;
	КонецЕсли;;   	  
	
	флПостроенаПлановаяЛичная	=	Истина;	
КонецПроцедуры

//не исп
Функция ПолучитьСуммуФактПоВсемГруппам(Продавец_, НачалоПериода = Неопределено)  
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.Номенклатура КАК Номенклатура
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКГруппыНоменклатурыДляПланов КАК ТБКГруппыНоменклатурыДляПланов");
	Рез = Запрос.Выполнить().Выгрузить();  	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И ЧекККМТовары.Продавец = &Продавец
	      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)");
		
		
	Если НачалоПериода = Неопределено тогда
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоПериода);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("Номенклатура",Рез.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
		
	Рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() тогда
		Возврат рез.СуммаЧеки;
	иначе
		Возврат 0;
	КонецЕсли; 	
	
КонецФункции   
//

Функция ПолучитьСуммуФактПоВсемГруппамПоПродавцам()  
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКГруппыНоменклатурыДляПланов.Номенклатура КАК Номенклатура
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКГруппыНоменклатурыДляПланов КАК ТБКГруппыНоменклатурыДляПланов");
	Рез = Запрос.Выполнить().Выгрузить();  
	
		
	Если ВариантМотивации = 2 тогда
		НовСтр	=	Рез.Добавить();
		НовСтр.Номенклатура	=	Справочники.Номенклатура.НайтиПоКоду("00048205244");// сопутствующие товары
	КонецЕсли;

	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	СУММА(ЕСТЬNULL(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ, 0)) КАК СуммаЧеки,
	      	 	             |	ЧекККМТовары.Продавец КАК Продавец,
	      	 	             |	СУММА(ЕСТЬNULL(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.Дата >= &ТекДень
	      	 	             |					ТОГДА ВЫБОР
	      	 	             |							КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |								ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |							ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |						КОНЕЦ
	      	 	             |				ИНАЧЕ 0
	      	 	             |			КОНЕЦ, 0)) КАК СуммаЧекиСегодня
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ЧекККМТовары.Продавец");
		
		
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ТекДень",НачалоДня(ТекущаяДата())); 
	
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("Номенклатура",Рез.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	//Рез = Запрос.Выполнить().Выбрать();
	//Если рез.Следующий() тогда
	//	Возврат рез.СуммаЧеки;
	//иначе
	//	Возврат 0;
	//КонецЕсли; 	
	
КонецФункции

#КонецОбласти

#Область ФокуснаяМотивация

Процедура ЗаполнитьВариантФокуснойМотивации()
	Элементы.Фокусная.Видимость	=Истина;
	Элементы.Группа7.Видимость	=Истина;
	Элементы.Основная.Видимость	= Ложь;
	Элементы.Группа2.Видимость	= Ложь;
	Элементы.Группа3.Видимость	= Ложь;
	Элементы.Группа4.Видимость	= Ложь; 
	
	Если флПостроенаПлановаяЛичная тогда Возврат КонецЕсли;	
	
	Запрос			=	Новый Запрос("ВЫБРАТЬ
	      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
	      			 	             |ПОМЕСТИТЬ ПродавцыСмены
	      			 	             |ИЗ
	      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
	      			 	             |ГДЕ
	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
	      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
	      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
	      			 	             |
	      			 	             |СГРУППИРОВАТЬ ПО
	      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
	      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
	      			 	             |;
	      			 	             |
	      			 	             |////////////////////////////////////////////////////////////////////////////////
	      			 	             |ВЫБРАТЬ
	      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
	      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
	      			 	             |ИЗ
	      			 	             |	ПродавцыСмены КАК ПродавцыСмены
	      			 	             |
	      			 	             |СГРУППИРОВАТЬ ПО
	      			 	             |	ПродавцыСмены.Продавец");
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);

	ТЗПродавцыСмены	=	Запрос.Выполнить().Выгрузить();
	НужСтрока	=	ТЗПродавцыСмены.Найти(Продавец) ;
	Если НужСтрока= Неопределено тогда 
		НовСтр	=	ТЗПродавцыСмены.Добавить();
		НовСтр.Продавец	=	Продавец;
		НовСтр.КолСмен	=	1;
	иначе
		Если НачалоМесяца(Период) = НачалоМесяца(ТекущаяДата()) тогда
			НужСтрока.КолСмен	=	НужСтрока.КолСмен + 1;	
		КонецЕсли;
	КонецЕсли;

	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Номенклатура КАК Номенклатура
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКФокуснаяМотивация.СрезПоследних(, ) КАК ТБКФокуснаяМотивацияСрезПоследних
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Номенклатура");
	ГруппыНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	
	Сч=0;
	Для каждого СтрокаПродавец из  ТЗПродавцыСмены цикл
		ИтогоБонус	=	0;
		
		ТаблицаРасшифровка = Новый ТаблицаЗначений;
		ТаблицаРасшифровка.Колонки.Добавить("ФокусГруппа");
		ТаблицаРасшифровка.Колонки.Добавить("ПланПродаж");
		ТаблицаРасшифровка.Колонки.Добавить("ФактПродаж");
		ТаблицаРасшифровка.Колонки.Добавить("КоличествоСверх");
		ТаблицаРасшифровка.Колонки.Добавить("СуммаФакт");
		ТаблицаРасшифровка.Колонки.Добавить("СуммаСверх");
		ТаблицаРасшифровка.Колонки.Добавить("СуммаПремии");

		
		Для каждого СтрокаГруппа из ГруппыНоменклатуры цикл
			БонусЗаГруппу			=	0;
			СуммаПродажСверхПлана	=	0;
			ТЗКолПродано	=	ПолучитьКоличествоПродажПоГруппе(СтрокаПродавец.Продавец, СтрокаГруппа.Номенклатура);			
			
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.ПланКоличество КАК ПланКоличество,
			      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Процент КАК Процент
			      	 	             |ИЗ
			      	 	             |	РегистрСведений.ТБКФокуснаяМотивация.СрезПоследних(, Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТБКФокуснаяМотивацияСрезПоследних
			      	 	             |
			      	 	             |УПОРЯДОЧИТЬ ПО
			      	 	             |	ПланКоличество");
			Запрос.УстановитьПараметр("Номенклатура",СтрокаГруппа.Номенклатура);
			резПроценты	=	Запрос.Выполнить().Выбрать();
			резПроценты.Следующий();    
			
			ПланКоличество	=  резПроценты.ПланКоличество ;   
			Процент			=  резПроценты.Процент ;

			Пояснение	=	"Продажи по плану: " + ПланКоличество + " шт. Процент от продаж сверх плана: " + Процент+"%";
			
			
			ИтогоПродано 		= 0;
			ИтогоПроданоСумма	=	0;
			Для каждого Строка из ТЗКолПродано цикл
				ИтогоПродано		=	ИтогоПродано + Строка.Количество; 
				ИтогоПроданоСумма	=	ИтогоПроданоСумма + Строка.Сумма;
				
				Если ИтогоПродано > ПланКоличество тогда
					Разница				= ИтогоПродано - ПланКоличество;
					КНачислению			= Мин(Разница, Строка.Количество); 
					КНачислениюСумма	= (Строка.Сумма /Строка.Количество)*КНачислению ;			
					
					ИтогоБонус				=	ИтогоБонус + КНачислениюСумма/100 * Процент;
					БонусЗаГруппу			=	БонусЗаГруппу + КНачислениюСумма/100 * Процент;
					СуммаПродажСверхПлана	=	СуммаПродажСверхПлана + КНачислениюСумма;
				КонецЕсли; 				
			КонецЦикла; 
			
			НовСтр	=	ТаблицаРасшифровка.Добавить();
			НовСтр.ФокусГруппа					=	СтрокаГруппа.Номенклатура;
			НовСтр.ПланПродаж					=	ПланКоличество;
			НовСтр.ФактПродаж					=	ИтогоПродано;
			НовСтр.КоличествоСверх				=	Макс(НовСтр.ФактПродаж - ПланКоличество,0);
			НовСтр.СуммаФакт					=	ИтогоПроданоСумма;
			НовСтр.СуммаСверх					=	СуммаПродажСверхПлана;
			НовСтр.СуммаПремии					=	БонусЗаГруппу;
			
		КонецЦикла;
		
		Если Сч	=	0 тогда
			ВывестиТаблицу(Элементы.Фокусная, ТаблицаРасшифровка,ИтогоБонус,СтрокаПродавец, сч);			
		иначе
			ВывестиТаблицу(Элементы.Группа7, ТаблицаРасшифровка,ИтогоБонус,СтрокаПродавец, сч);
		КонецЕсли;	
		
		Сч = Сч+1;
	КонецЦикла;
	
	флПостроенаПлановаяЛичная = Истина;
		
КонецПроцедуры

Функция ПолучитьКоличествоПродажПоГруппе(Продавец_, Номенклатура, НеГруппироватьПоДате = Ложь, ТаблицаБК = Неопределено) 
	
	Если НеГруппироватьПоДате тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Количество, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Количество, 0)
		      	 	             |			КОНЕЦ), 0) КАК Количество,
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
		      	 	             |			КОНЕЦ), 0) КАК Сумма
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		      	 	             |ГДЕ
		      	 	             |	ЧекККМТовары.Ссылка.Проведен
		      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
		      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
		      	 	             |	И ЧекККМТовары.Продавец = &Продавец
		      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&Номенклатура)");
		
		Если ТаблицаБК <> Неопределено тогда
			ТаблицаБК.Свернуть("Номенклатура","Количество,Сумма");
		КонецЕсли;
		
	иначе
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Количество, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Количество, 0)
		      	 	             |			КОНЕЦ), 0) КАК Количество,
		      	 	             |	ЧекККМТовары.Ссылка.Дата КАК Дата,
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
		      	 	             |			КОНЕЦ), 0) КАК Сумма
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		      	 	             |ГДЕ
		      	 	             |	ЧекККМТовары.Ссылка.Проведен
		      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
		      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
		      	 	             |	И ЧекККМТовары.Продавец = &Продавец
		      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&Номенклатура)
		      	 	             |
		      	 	             |СГРУППИРОВАТЬ ПО
		      	 	             |	ЧекККМТовары.Ссылка.Дата
		      	 	             |
		      	 	             |УПОРЯДОЧИТЬ ПО
		      	 	             |	Дата");
	КонецЕсли;
		
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;

	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
		
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаБК <> Неопределено тогда
		Если ТаблицаБК.Количество()>0 тогда
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ТаблицаБК.Количество КАК Количество,
			      	 	             |	ТаблицаБК.Сумма КАК Сумма
			      	 	             |ПОМЕСТИТЬ Итог
			      	 	             |ИЗ
			      	 	             |	&ТаблицаБК КАК ТаблицаБК
			      	 	             |ГДЕ
			      	 	             |	ТаблицаБК.Номенклатура В ИЕРАРХИИ(&Номенклатура)
			      	 	             |;
			      	 	             |
			      	 	             |////////////////////////////////////////////////////////////////////////////////
			      	 	             |ВЫБРАТЬ
			      	 	             |	Итог.Количество КАК Количество,
			      	 	             |	Итог.Сумма КАК Сумма
			      	 	             |ИЗ
			      	 	             |	Итог КАК Итог");
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);    
			Запрос.УстановитьПараметр("ТаблицаБК",ТаблицаБК);

			РезБК	=	запрос.Выполнить().Выгрузить();
			Для каждого Строка из РезБК цикл
				НоваяСтрока	=	Рез.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				Рез.Свернуть("","Количество,Сумма");
			КонецЦикла;
			
			Если не НеГруппироватьПоДате тогда
				Рез.Свернуть("","Количество,Сумма,Дата");
				Рез.Сортировать("Дата");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат рез;
	
КонецФункции


#КонецОбласти

#Область ОбщаяМотивация
&НаСервере
Процедура ЗаполнитьВариантОбщейМотивации()
	Элементы.Переключатель.Видимость	= Ложь;	
	Элементы.Группа3.Видимость			= Ложь;
	Элементы.Группа4.Видимость			= Ложь;
	Элементы.Основная.Видимость			= Истина;
	Элементы.Группа2.Видимость			= Истина; 
	Элементы.Новая_2.Видимость			= Ложь; 
	Элементы.Новая.Видимость			= Ложь; 
	//1 ЗАПОЛНЯЕМ ПЛАНЫ. Общий, личный, на сегодня. + Общие премии
	ЗаполнитьПланыИОсновныеПремииОбщаяМотивация();
	
	//Заполняем премии. Это проценты о группам товаров
	ЗаполнитьФокусныеПремииОбщаяМотивация();
КонецПроцедуры

Процедура ЗаполнитьПланыИОсновныеПремииОбщаяМотивация()
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период МЕЖДУ &ПериодН И &ПериодК
	      	 	             |	И ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана = ""План ТО""
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодК", КонецМесяца(Период));
	Рез = запрос.Выполнить().Выбрать(); 	
	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Если рез.Следующий() тогда	
		Если ПереключательМесяцДень = 0 тогда// строим за МЕСЯЦ		
			
			Для Сч = 1 по 2 цикл // 1- общий план, 2 - личный план
				

				Если Сч =1 тогда
					НужЗаголовок		= "Общие показатели магазина";
					НазваниеДиаграммы	= "ПланТО";   
				иначе
					НужЗаголовок		= "Личные показатели";
					НазваниеДиаграммы	= "ПланЛичный"; 
				КонецЕсли;
				
				НДиаг         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
				НДиаг.Заголовок		= НужЗаголовок;
				
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(НДиаг);  	
				ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

				Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа6);		
				Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
				Диаг.ПутьКДанным			= НазваниеДиаграммы;
				Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;
				//Диаг.Ширина					= 15;
				Диаг.Высота					= 17;
				НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
				НДиаг.Серии.Добавить("План");

				//определяем точки
				ТочкаПоПлану = НДиаг.УстановитьТочку("План");
				
				Если ПереключательМесяцДень = 0 и  Сч = 1 тогда 
					ТочкаПоПлану_Сегодня 				= НДиаг.УстановитьТочку("План_НаСегодня");		
					ТочкаПоПлану_Сегодня.текст			=	"План на сегодня";
					ТочкаПоПлану_Сегодня.ПриоритетЦвета	=	Истина;  
				КонецЕсли; 
				
				ТочкаПоФакту = НДиаг.УстановитьТочку("Факт");
				
				ТочкаПоФакту.ПриоритетЦвета	= Истина;   		
				ТочкаПоПлану.ПриоритетЦвета	= Истина;	
				ТочкаПоПлану.Цвет			= WebЦвета.КоролевскиГолубой;					
				
				
				//Заполняем точки значениями
				КолДнейВМесяце	=	День(КонецМесяца(Период));

				Если Месяц(ТекущаяДата()) = Месяц(Период) и Год(ТекущаяДата()) = Год(Период) тогда
					КолДней	=	День(ТекущаяДата());
				иначе
					КолДней	=	КолДнейВМесяце;
				КонецЕсли;
				
				Если Сч=1 тогда
					СуммаФакт			=	ПолучитьСуммуФактПоТипуПлана("План ТО");
					
					Если Месяц(ТекущаяДата()) = Месяц(Период) и Год(ТекущаяДата()) = Год(Период) тогда   
						СуммаФактСегодня	=	ПолучитьСуммуФактПоТипуПлана("План ТО", ,Истина);
					иначе
						СуммаФактСегодня	=	0;//изменения 2024-02-01		
					КонецЕсли;
					
					СуммаПлана			=	Рез.Сумма;         					
				иначе
					Если КоличествоСмен >0 тогда
						СуммаПлана	=	Окр((Рез.Сумма/КолДнейВМесяце) * КоличествоСмен,0);	
					иначе
						СуммаПлана	=	0;
					КонецЕсли;
					СуммаФакт		=	ПолучитьСуммуФактПоТипуПлана("План личный"); 
					СуммаОтставание	=	Макс(0, СуммаПлана - СуммаФакт); 					
				КонецЕсли;
				
				
				ТочкаОтставание	= 	НДиаг.УстановитьТочку("Отставание");					
				
				Если СуммаФакт >  СуммаПлана тогда	
					ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
				иначе
					ТочкаПоФакту.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
				КонецЕсли;
				
				Если СуммаПлана>0 тогда 
					ПроцентВыполнения	=	Окр((СуммаФакт / СуммаПлана) * 100,2);
				иначе
					ПроцентВыполнения	=	0;
				КонецЕсли;
				
				Если Сч=1 тогда
					НДиаг.УстановитьЗначение(ТочкаПоПлану
							, НДиаг.Серии[0]
							, СуммаПлана
							, Неопределено
							, Рез.ТипПлана + " "+СуммаПлана);
				Иначе
					НДиаг.УстановитьЗначение(ТочкаПоПлану
							, НДиаг.Серии[0]
							, СуммаПлана
							, Неопределено
							, "План дня * кол.смен "); 	
				КонецЕсли;
								
						
				Если ПереключательМесяцДень = 0 и  Сч = 1 тогда 
					СуммаПланНаСегодня	=	Окр(СуммаПлана / КолДнейВМесяце,2);
					СуммаПланНаСегодня	=	Окр(СуммаПланНаСегодня *  КолДней,0);
					СуммаОтставание		=	Макс(0, СуммаПланНаСегодня - СуммаФакт);					
					
					НДиаг.УстановитьЗначение(ТочкаПоПлану_Сегодня
						, НДиаг.Серии[0]
						, СуммаПланНаСегодня
						, Неопределено
						, Рез.ТипПлана + "(на сег.день) "+ СуммаПланНаСегодня);
						
					Если СуммаФакт >  СуммаПланНаСегодня тогда	
						ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
					иначе
						ТочкаПоФакту.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
					КонецЕсли;  
					
					
					//ВЫВОД ОТЛДЕЛЬНОЙ ДИАГРАММЫ ПО СРЕДНИМ ЗНАЧЕНИЯМ (личная просьба от админов)		
					НазваниеДиаграммы	= "ПланСреднее";
					НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
					НДиаг1.Заголовок		= "Средние показатели магазина";
					
					ДобавляемыеРеквизиты = Новый Массив;
					ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
					ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

					Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа6);		
					Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
					Диаг.ПутьКДанным			= НазваниеДиаграммы;
					Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;
					//Диаг.Ширина					= 15;

					НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
					НДиаг1.Серии.Добавить("ПланСреднее");

					
					ТочкаПланСреднее = НДиаг1.УстановитьТочку("План дня");				
					ТочкаФактСреднее = НДиаг1.УстановитьТочку("Факт среднего дня");
					ТочкаПрогноз 	 = НДиаг1.УстановитьТочку("Прогноз");
					ТочкаФактСегодня = НДиаг1.УстановитьТочку("Факт сегодня");
					
					СумамПланСреднее	=	Окр(СуммаПлана/КолДнейВМесяце,0);
					
					//Изменения от 2024-02-01
					//СумамФактСреднее	=	Окр((СуммаФакт - СуммаФактСегодня) / День(ТекущаяДата()),0);
					Если Месяц(ТекущаяДата()) = Месяц(Период) и Год(ТекущаяДата()) = Год(Период) тогда
						НовоеКоличествоДней	=	КолДней-1;
					иначе
						НовоеКоличествоДней	=	КолДнейВМесяце;
					КонецЕсли;
										
					Если  НовоеКоличествоДней > 0 тогда
						СумамФактСреднее	=	Окр((СуммаФакт - СуммаФактСегодня) / НовоеКоличествоДней ,0);
					иначе
						СумамФактСреднее	=	0;	
					КонецЕсли;

					
					//Изменения от 2024-02-01					
					Если КолДнейВМесяце - НовоеКоличествоДней > 0 тогда
						//СумамПрогноз		=	Макс( Окр((СуммаПлана - СуммаФакт - СуммаФактСегодня) / (КолДнейВМесяце - КолДней),0), СумамПланСреднее);
						СумамПрогноз	=	Макс( ((СумамПланСреднее * НовоеКоличествоДней) - (СумамФактСреднее*НовоеКоличествоДней)) / (КолДнейВМесяце - НовоеКоличествоДней) +  СумамПланСреднее, СумамПланСреднее);   
					иначе
						СумамПрогноз	=	0;
					КонецЕсли;
					//
					
					Если КолДнейВМесяце <> КолДней тогда  
						Если СумамПрогноз > СумамФактСреднее тогда
							Заголовок	=	"Добрый День! Нужно поднажать!";
						иначе
							Заголовок	=	"Добрый День! Вы отлично потрудились!";
						КонецЕсли;
					иначе
						Заголовок	=	"Добрый День!";
					КонецЕсли;
						
					
					ТочкаПланСреднее.ПриоритетЦвета	= Истина;   		
					ТочкаФактСреднее.ПриоритетЦвета	= Истина;	
					//ТочкаПрогноз.ПриоритетЦвета		= Истина;	

					ТочкаПланСреднее.Цвет = WebЦвета.КоролевскиГолубой; 
					Если СумамФактСреднее >  СумамПланСреднее тогда	
						ТочкаПланСреднее.Цвет	=	WebЦвета.ЗеленаяЛужайка;
					иначе
						ТочкаПоФакту.Цвет		=	WebЦвета.БледноКрасноФиолетовый;
					КонецЕсли; 
					
					
					
					НДиаг1.УстановитьЗначение(ТочкаПланСреднее
						, НДиаг1.Серии[0]
						, СумамПланСреднее
						, Неопределено
						, "План на день " + СумамПланСреднее);  
					
					
				  	НДиаг1.УстановитьЗначение(ТочкаФактСреднее
						, НДиаг1.Серии[0]
						, СумамФактСреднее
						, Неопределено
						, "Факт среднего дня " + СумамФактСреднее); 
						
					 НДиаг1.УстановитьЗначение(ТочкаПрогноз
						, НДиаг1.Серии[0]
						, СумамПрогноз
						, Неопределено
						, "Нужно делать в день: " + СумамПрогноз);
						
					НДиаг1.УстановитьЗначение(ТочкаФактСегодня
						, НДиаг1.Серии[0]
						, СуммаФактСегодня
						, Неопределено
						, "Факт сегодня: " + СуммаФактСегодня);

						
					НДиаг1.ОтображатьЛегенду	= Ложь;	 		
					НДиаг1.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
					НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
					НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
					НДиаг1.МинимальноеЗначение		=	0; 
				КонецЕсли;
				
				Если Сч=1 тогда
					НДиаг.УстановитьЗначение(ТочкаПоФакту
						, НДиаг.Серии[0]
						, СуммаФакт
						, Неопределено
						, "Сумма факт "+СуммаФакт);
				Иначе
					НДиаг.УстановитьЗначение(ТочкаПоФакту
						, НДиаг.Серии[0]
						, СуммаФакт
						, Неопределено
						, "Сумма факт за отработанные смены");
				КонецЕсли;
					
				Если ПереключательМесяцДень = 0 тогда
					НДиаг.УстановитьЗначение(ТочкаОтставание
						, НДиаг.Серии[0]
						, СуммаОтставание
						, Неопределено
						, "Отставание "+СуммаОтставание);
		
				КонецЕсли;
				
				НДиаг.ОтображатьЛегенду	= Ложь;	 		
				НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
				НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
				НДиаг.АвтоМинимальноеЗначение	=	Ложь;
				НДиаг.МаксимальноеЗначение		=	Макс(СуммаПлана, СуммаФакт) + СуммаПлана/10;
				НДиаг.МинимальноеЗначение		=	-0.01; 
			КонецЦикла;
			
			
		иначе //СТРОИМ ЗА ДЕНЬ
			НазваниеДиаграммы	=	"ПланТОДень";
			НДиаг         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
			НДиаг.Заголовок		= "Показатели за " + Формат(Период,"ДЛФ=DD");
			
			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(НДиаг);  	
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

			Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа6);		
			Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
			Диаг.ПутьКДанным			= НазваниеДиаграммы;
			Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;
			//Диаг.Ширина					= 15;
			Диаг.Высота						= 17;
			НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
			НДиаг.Серии.Добавить("План");

			//определяем точки
			ТочкаПоПлану 	= НДиаг.УстановитьТочку("План");			
			ТочкаПоФакту 	= НДиаг.УстановитьТочку("Факт");
			ТочкаОтставание = НДиаг.УстановитьТочку("Отставание");

			
			ТочкаПоФакту.ПриоритетЦвета	= Истина;   		
			ТочкаПоПлану.ПриоритетЦвета	= Истина;	
			ТочкаПоПлану.Цвет			= WebЦвета.КоролевскиГолубой; 
			
			ТочкаПоФактуЛичная = НДиаг.УстановитьТочку("Факт личный");
			ТочкаПоФактуЛичная.ПриоритетЦвета	= Истина;   		

			//Заполняем точки значениями
			КолДней			=	День(Период);
			КолДнейВМесяце	=	День(КонецМесяца(Период));
				
			СуммаПлана	=	Окр((Рез.Сумма/КолДнейВМесяце) ,0);	
			
			СуммаФактОбщий	=	ПолучитьСуммуФактПоТипуПлана("План ТО", Истина); 
			СуммаОтставание	=	Макс(СуммаПлана - СуммаФактОбщий, 0);
			СуммаФактЛичный	=	ПолучитьСуммуФактПоТипуПлана("План личный", Истина);
			
			
			
			Если СуммаФактОбщий >  СуммаПлана тогда	
				ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;
			иначе
				ТочкаПоФакту.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
			КонецЕсли;
			
			ПроцентВыполнения		=	Окр((СуммаФактОбщий / СуммаПлана) * 100,2);
			
			Если СуммаФактОбщий >0 тогда
				//ПроцентВыполненияЛичный	=	Окр((СуммаФактЛичный / СуммаФактОбщий) * 100,2);
				ПроцентВыполненияЛичный	=	Окр((СуммаФактЛичный / СуммаПлана) * 100,2);
			иначе
				ПроцентВыполненияЛичный	=	0;
			КонецЕсли;
			
			НДиаг.УстановитьЗначение(ТочкаПоПлану
					, НДиаг.Серии[0]
					, СуммаПлана
					, Неопределено
					, Рез.ТипПлана + " "+СуммаПлана);
									
									
			НДиаг.УстановитьЗначение(ТочкаПоФакту
				, НДиаг.Серии[0]
				, СуммаФактОбщий
				, Неопределено
				, "Факт общий" + " " + СуммаФактОбщий + "; Процент выполнения:"+ПроцентВыполнения+"%");  
			
			НДиаг.УстановитьЗначение(ТочкаОтставание
				, НДиаг.Серии[0]
				, СуммаОтставание
				, Неопределено
				, "Отставание: "+СуммаОтставание);
				
				
			НДиаг.УстановитьЗначение(ТочкаПоФактуЛичная
				, НДиаг.Серии[0]
				, СуммаФактЛичный
				, Неопределено
				, "Факт личный" + " " + СуммаФактЛичный + "; Процент выполнения:"+ПроцентВыполненияЛичный+"%");  

				
				
			НДиаг.ОтображатьЛегенду	= Ложь;	 		
			НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
			НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
			НДиаг.АвтоМинимальноеЗначение	=	Ложь;
			НДиаг.МаксимальноеЗначение		=	Макс(СуммаПлана, СуммаФактОбщий) + СуммаПлана/10;
			НДиаг.МинимальноеЗначение		=	-0.01; 
		КонецЕсли;
	КонецЕсли;
	
	//ОБЩИЕ ПРЕМИИ
	ТЗ_Премии	=	ПолучитьСуммуФактПоОсновнымГруппамПоПродавцу(Продавец, ПереключательМесяцДень, Период);	
	
	СтрокаПремииВейп		=	ТЗ_Премии.найти("Электронка");
	Если СтрокаПремииВейп <> Неопределено тогда
		СуммаПремииВейп	=	Окр(СтрокаПремииВейп.СуммаОборот,0);
	иначе
		СуммаПремииВейп	=	0; 
	КонецЕсли;
	
	СтрокаПремииТабак		=	ТЗ_Премии.найти("Табачная продукция");
	Если СтрокаПремииТабак <> Неопределено тогда
		СуммаПремииТабак	=	Окр(СтрокаПремииТабак.СуммаОборот,0);
	иначе
		СуммаПремииТабак	=	0; 
	КонецЕсли;

	
	СтрокаПремииСувениры		=	ТЗ_Премии.найти("Подарки и сувениры");
	Если СтрокаПремииСувениры <> Неопределено тогда
		СуммаПремииСувениры	=	Окр(СтрокаПремииСувениры.СуммаОборот,0);
	иначе
		СуммаПремииСувениры	=	0; 
	КонецЕсли;

	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	

	НазваниеДиаграммы	=	"ПланПремии";
	НДиаг         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг.Заголовок		= "Премии по основным группам: "+(СуммаПремииВейп+СуммаПремииТабак+СуммаПремииСувениры);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа6);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;
	//Диаг.Ширина					= 15;
	
	НДиаг				=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг.ТипДиаграммы	=	ТипДиаграммы.ГистограммаСНакоплениемОбъемная;

	НДиаг.Серии.Добавить("Вэйп");
	НДиаг.Серии.Добавить("Табак");
	НДиаг.Серии.Добавить("Сувениры");
	
	НДиаг.Серии[0].Цвет	=	WebЦвета.Красный;
	НДиаг.Серии[1].Цвет	=	WebЦвета.КоролевскиГолубой;
	НДиаг.Серии[2].Цвет	=	WebЦвета.Бежевый; 	  	
	
	ТочкаСуммаПремии 		= НДиаг.УстановитьТочку("Премии");

	НДиаг.УстановитьЗначение(ТочкаСуммаПремии
					, НДиаг.Серии[0]
					, СуммаПремииВейп
					, Неопределено
					, "Премия вэйп " + СуммаПремииВейп);
					
	НДиаг.УстановитьЗначение(ТочкаСуммаПремии
					, НДиаг.Серии[1]
					, СуммаПремииТабак
					, Неопределено
					, "Премия табак " + СуммаПремииТабак);
					
	НДиаг.УстановитьЗначение(ТочкаСуммаПремии
					, НДиаг.Серии[2]
					, СуммаПремииСувениры
					, Неопределено
					, "Премия сувениры " + СуммаПремииСувениры);

	ИтогоПремии = СуммаПремииВейп + СуммаПремииТабак + СуммаПремииСувениры;		
	
	Элементы.Итого.Заголовок	=	"Итого: "+ ИтогоПремии;
КонецПроцедуры

Процедура ЗаполнитьФокусныеПремииОбщаяМотивация()
	ИтогоПремииФокус = 0;
	ТаблицаРасшифровка	=		Обработки.РМКУправляемыйРежим.ПолучитьТаблицуПоФокуснойМотивации(ИтогоПремииФокус, Период, ПереключательМесяцДень, Продавец);

	
	
	Если ПереключательТаблицаДиаграмма = 0 тогда
		ВывестиТаблицу(Элементы.Группа9, ТаблицаРасшифровка, ИтогоПремииФокус, Продавец, 0);			
	иначе
		//ВЫВОД В ВИДЕ ДИАГРАММ. ФОКУСНАЯ МОТИВАЦИЯ
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Диаграмма"));
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	

		СЧ = 0;
		Для каждого СтрокаТЗ из ТаблицаРасшифровка цикл   
			НазваниеДиаграммы	=	"ПланФокусДиаграмма" + СЧ;
			НДиаг         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
			НДиаг.Заголовок		= Строка(СтрокаТЗ.ФокусГруппа) +Символы.ПС+ "Премия: " + СтрокаТЗ.СуммаПремии;

			ДобавляемыеРеквизиты = Новый Массив;
			ДобавляемыеРеквизиты.Добавить(НДиаг);  	
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

			Если СЧ<5 Тогда  // максимум 5 диаграмм в каждой группе
				НужГруппа	=	Элементы.ФокусДиаграммы1;
			ИначеЕсли СЧ<10 Тогда
				НужГруппа	=	Элементы.ФокусДиаграммы2;
			ИначеЕсли СЧ<15 Тогда
				НужГруппа	=	Элементы.ФокусДиаграммы3;
			ИначеЕсли СЧ<20 Тогда
				НужГруппа	=	Элементы.ФокусДиаграммы4; 
			КонецЕсли;
			
			Диаг 							= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), НужГруппа);		
			Диаг.Вид						= ВидПоляФормы.ПолеДиаграммы; 
			Диаг.ПутьКДанным				= НазваниеДиаграммы;
			Диаг.ЦветТекстаЗаголовка		= WebЦвета.Синий;
			//Диаг.Ширина						= 30;
			Диаг.РастягиватьПоГоризонтали	= Ложь;

			НДиаг				=	ЭтаФорма[НазваниеДиаграммы];
			//НДиаг.ТипДиаграммы	=	ТипДиаграммы.ГистограммаГоризонтальнаяОбъемная;
			НДиаг.Серии.Добавить("План");
			
			//определяем точки
			Если СтрокаТЗ.ПланПродаж >0 тогда
				ТочкаКолПлан = НДиаг.УстановитьТочку("План");	
				ТочкаКолПлан.ПриоритетЦвета	= Истина;   		
				ТочкаКолПлан.Цвет	=	WebЦвета.КоролевскиГолубой;  

				НДиаг.УстановитьЗначение(ТочкаКолПлан
					, НДиаг.Серии[0]
					, СтрокаТЗ.ПланПродаж
					, Неопределено
					, СтрокаТЗ.ПланПродаж);
					
					
			КонецЕсли;
				
			ТочкаКолФакт = НДиаг.УстановитьТочку("Продажи");						
			ТочкаКолФакт.ПриоритетЦвета	= Истина;   		
			ТочкаКолФакт.Цвет	=	WebЦвета.БледноКрасноФиолетовый;  

			Если Найти(СтрокаТЗ.Заголовок,"Процент премии") тогда // выводим Сумму
				ТочкаКолФакт.Текст			=	"Сумма продаж";

				НДиаг.УстановитьЗначение(ТочкаКолФакт
					, НДиаг.Серии[0]
					, СтрокаТЗ.СуммаФакт
					, Неопределено
					, Сред(СтрокаТЗ.Заголовок,Найти(СтрокаТЗ.Заголовок, Символы.ПС)+1));	
			иначе
				ТочкаКолФакт.Текст			=	"Продажи шт.";

				НДиаг.УстановитьЗначение(ТочкаКолФакт
					, НДиаг.Серии[0]
					, СтрокаТЗ.ФактПродаж
					, Неопределено
					, Сред(СтрокаТЗ.Заголовок,Найти(СтрокаТЗ.Заголовок, Символы.ПС)+1));
			КонецЕсли;
					

			Сч = Сч+1;
			
			НДиаг.ОтображатьЛегенду	= Ложь;	 		
			НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
			НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
			НДиаг.АвтоМинимальноеЗначение	=	Ложь;
			НДиаг.МинимальноеЗначение		=	0; 
			НДиаг.МаксимальноеЗначение		=	СтрокаТЗ.ФактПродаж +1; 

		КонецЦикла; 	
	КонецЕсли;	

	Элементы.ИтогоФокус.Заголовок	=	"Итого: "+ ИтогоПремииФокус;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСуммуФактПоОсновнымГруппамПоПродавцу(Продавец, ПереключательМесяцДень, Период)
	запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБКПремииПоЧекамОбороты.Продавец КАК Продавец,
	      	 	             |	СУММА(ТБКПремииПоЧекамОбороты.СуммаОборот) КАК СуммаОборот,
	      	 	             |	ТБКПремииПоЧекамОбороты.Группа КАК Группа
	      	 	             |ИЗ
	      	 	             |	РегистрНакопления.ТБКПремииПоЧекам.Обороты(&ДатаНач, &ДатаКон, , Продавец = &Продавец) КАК ТБКПремииПоЧекамОбороты
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ТБКПремииПоЧекамОбороты.Продавец,
	      	 	             |	ТБКПремииПоЧекамОбороты.Группа");
	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	Запрос.УстановитьПараметр("Продавец",		Продавец);	
	
	
	Возврат Запрос.Выполнить().Выгрузить();

	
	
	//ЗапросНоменклатура	=	Новый Запрос("ВЫБРАТЬ
	//      	 	             |	ВЫБОР
	//      	 	             |		КОГДА ТБКГруппыИПроцентыДляПремийОбщаяМотивацияСрезПоследних.ТипГруппы = &ТипГруппы
	//      	 	             |			ТОГДА ТБКГруппыИПроцентыДляПремийОбщаяМотивацияСрезПоследних.Номенклатура
	//      	 	             |	КОНЕЦ КАК Номенклатура,
	//      	 	             |	ТБКГруппыИПроцентыДляПремийОбщаяМотивацияСрезПоследних.Процент КАК Процент
	//      	 	             |ИЗ
	//      	 	             |	РегистрСведений.ТБКГруппыИПроцентыДляПремийОбщаяМотивация.СрезПоследних КАК ТБКГруппыИПроцентыДляПремийОбщаяМотивацияСрезПоследних");
	//
	//Запрос	=	Новый Запрос("ВЫБРАТЬ
	//      	 	             |	ВЫБОР
	//      	 	             |		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&НоменклатураВэйп)
	//      	 	             |			ТОГДА ПродажиОбороты.СтоимостьОборот
	//      	 	             |		ИНАЧЕ 0
	//      	 	             |	КОНЕЦ КАК СуммаВэйп,
	//      	 	             |	ВЫБОР
	//      	 	             |		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&НоменклатураТабак)
	//      	 	             |			ТОГДА ПродажиОбороты.СтоимостьОборот
	//      	 	             |		ИНАЧЕ 0
	//      	 	             |	КОНЕЦ КАК СуммаТабак,
	//      	 	             |	ВЫБОР
	//      	 	             |		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&НоменклатураСувениры)
	//      	 	             |			ТОГДА ПродажиОбороты.СтоимостьОборот
	//      	 	             |		ИНАЧЕ 0
	//      	 	             |	КОНЕЦ КАК СуммаСувениры
	//      	 	             |ПОМЕСТИТЬ итог
	//      	 	             |ИЗ
	//      	 	             |	РегистрНакопления.Продажи.Обороты(
	//      	 	             |			&ДатаНач,
	//      	 	             |			&ДатаКон,
	//      	 	             |			,
	//      	 	             |			Продавец = &Продавец
	//      	 	             |				И (Номенклатура В ИЕРАРХИИ (&НоменклатураВэйп)
	//      	 	             |					ИЛИ Номенклатура В ИЕРАРХИИ (&НоменклатураТабак)
	//      	 	             |					ИЛИ Номенклатура В ИЕРАРХИИ (&НоменклатураСувениры))) КАК ПродажиОбороты
	//      	 	             |;
	//      	 	             |
	//      	 	             |////////////////////////////////////////////////////////////////////////////////
	//      	 	             |ВЫБРАТЬ
	//      	 	             |	СУММА(итог.СуммаВэйп) КАК СуммаВэйп,
	//      	 	             |	СУММА(итог.СуммаТабак) КАК СуммаТабак,
	//      	 	             |	СУММА(итог.СуммаСувениры) КАК СуммаСувениры
	//      	 	             |ИЗ
	//      	 	             |	итог КАК итог");

			
	//Если ПереключательМесяцДень = 0 тогда	
	//	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	//	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	//иначе
	//	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
	//	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	//КонецЕсли;
	//
	//ЗапросНоменклатура.УстановитьПараметр("ТипГруппы", "Электронка");
	//Запрос.УстановитьПараметр("НоменклатураВэйп", 		ЗапросНоменклатура.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	//
	//ЗапросНоменклатура.УстановитьПараметр("ТипГруппы", "Табачная продукция");
	//Запрос.УстановитьПараметр("НоменклатураТабак", 		ЗапросНоменклатура.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	//
	//ЗапросНоменклатура.УстановитьПараметр("ТипГруппы", "Подарки и сувениры");
	//Запрос.УстановитьПараметр("НоменклатураСувениры", 		ЗапросНоменклатура.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	//

	//Запрос.УстановитьПараметр("СтатусЧекаККМ",	Перечисления.СтатусыЧековККМ.Пробитый);
	//Запрос.УстановитьПараметр("СтатусЧекаККМ1",	Перечисления.СтатусыЧековККМ.Архивный);
	//Запрос.УстановитьПараметр("ВидПродажа",		Перечисления.ВидыОперацийЧекККМ.Продажа);	
	//Запрос.УстановитьПараметр("Продавец",		Продавец);	
	//
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//Если рез.Следующий() тогда
	//	СтруктураВозврата	=	Новый Структура;
	//	СтруктураВозврата.Вставить("СуммаВэйп", 	рез.СуммаВэйп);
	//	СтруктураВозврата.Вставить("СуммаТабак", 	рез.СуммаТабак);
	//	СтруктураВозврата.Вставить("СуммаСувениры", рез.СуммаСувениры);

	//	Возврат СтруктураВозврата;
	//КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область НоваяМотивация

&НаСервере
Процедура ЗаполнитьВариантНовойМотивации()
	ЗаполнитьФокусныеПремииОбщаяМотивация(); //фокус остается старый

	
	Элементы.Переключатель.Видимость	= Ложь;	
	Элементы.Группа3.Видимость			= Ложь;
	Элементы.Группа4.Видимость			= Ложь;
	Элементы.Основная.Видимость			= Ложь;
	Элементы.Группа2.Видимость			= Ложь; 
	Элементы.Новая_2.Видимость			= Ложь; 
	
	Элементы.Новая.Видимость			= Истина; 
	Элементы.Фокусная.Видимость			= Истина;
	
	ЦветСиний	=	WebЦвета.КоролевскиГолубой;
	ЦветКрасный	=	WebЦвета.БледноКрасноФиолетовый;
	//Оклад
	СтруктураОкладВремя	=	ПолучитьДанныеПоОкладу(Продавец, ПереключательМесяцДень, Период);
	

	СтрокаЧасы	=	ПолучитьСклоненияСтрокиПоЧислу("", Строка(СтруктураОкладВремя.КоличествоЧасов),   "час", "ЧС=Количественное", "ПД=Винительный; ");
	СтрокаЧасы	=	СтрокаЧасы[0];
	СтрокаЧасы	=	Сред(СтрокаЧасы, СтрНайти(СтрокаЧасы, Строка(СтруктураОкладВремя.КоличествоЧасов))+ СтрДлина(Строка(СтруктураОкладВремя.КоличествоЧасов) )); 	

	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("За этот период вы отработали: ", 				, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураОкладВремя.КоличествоЧасов), 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(СтрокаЧасы + Символы.ПС+"Сумма оклада: ", 		, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(""+СтруктураОкладВремя.СуммаОклада+"р.", 		, ЦветКрасный));
	
    Элементы.ДекорацияНадписьОклад.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);
		
	СуммаОклада						=	СтруктураОкладВремя.СуммаОклада;
	
	//ОбщийПлан
	СтруктураОбщийПлан	=	ПолучитьДанныеПоОбщемуПлану(ПереключательМесяцДень, Период);
	
	Если СтруктураОбщийПлан.ПроцентВыполнения >100 тогда
		ПремияЗаОбщий	=	Окр(СтруктураОбщийПлан.ПремияЗаПлан * СтруктураОкладВремя.КоличествоЧасов,0);
	иначе
		ПремияЗаОбщий	=	0;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Продавец) тогда ПремияЗаОбщий=0 КонецЕсли;
	
	
	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("План магазина за выбранный месяц составляет: " + СтруктураОбщийПлан.СуммаПлана+"р." + Символы.ПС + 
													"Факт. продаж: " + СтруктураОбщийПлан.СуммаФакт + "р. Что составляет: ",, ЦветСиний));
													
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураОбщийПлан.ПроцентВыполнения), 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("% плана."+ Символы.ПС + "Сумма премии: ", 		, ЦветСиний));
	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(ПремияЗаОбщий)+ "р."+ Символы.ПС, 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("Сумма премии, если выполните план: ", 		, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("" + Окр(СтруктураОбщийПлан.ПремияЗаПлан * СтруктураОкладВремя.КоличествоЧасов,0) + "р.", 	, ЦветКрасный));
	
    Элементы.ДекорацияНадписьОбщийПлан.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);
	
	ВыводДиаграммыПоПланам(СтруктураОбщийПлан);
	
	//Премия за проценты. Разные для Основных и вторых продавцов
	флЭтоВторойПродавец	=	Ложь;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКСменыСотрудников.Продавец КАК Продавец,
	      	 	             |	ТБКСменыСотрудников.ТипПродавца КАК ТипПродавца
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца
	      	 	             |	И ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон");
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;   
	Запрос.УстановитьПараметр("Продавец", Продавец); 
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Если Запрос.Выполнить().Пустой() тогда
		флЭтоВторойПродавец = истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Продавец) тогда
		СтруктураПремииЗаПроцент	=	новый Структура;
		СтруктураПремииЗаПроцент.Вставить("СуммаПродаж",			0);
		СтруктураПремииЗаПроцент.Вставить("Процент",				0);
		СтруктураПремииЗаПроцент.Вставить("ПремиязаПроцент",		0);
	
	иначе
		Если флЭтоВторойПродавец тогда     
			СтруктураПремииЗаПроцент	=	ПолучитьДанныеПоПремиямЗаПроцент_ВторойПродавец(Продавец, ПереключательМесяцДень, Период);//единый процент на все продажи, без тележки на продавцов
		иначе
			СтруктураПремииЗаПроцент	=	ПолучитьДанныеПоПремиямЗаПроцент(Продавец, ПереключательМесяцДень, Период, СтруктураОбщийПлан.ПроцентВыполнения);	
		КонецЕсли;
	КонецЕсли;
	
	
	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("Процент премии за выполнение плана составляет: " 					,, ЦветСиний));	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураПремииЗаПроцент.Процент)+"%."+ Символы.ПС			,, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("Сумма ваших личных продаж: "										,, ЦветСиний));   	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(Окр(СтруктураПремииЗаПроцент.СуммаПродаж,0))+ "р."			,, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Символы.ПС + "Сумма премии: "										,, ЦветСиний));  	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(Окр(СтруктураПремииЗаПроцент.ПремиязаПроцент,0))+ "р."		,, ЦветКрасный));
	
    Элементы.ДекорацияНадписьПремияЗаПроцент.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);	
		
	ПремиязаПроцент						=	СтруктураПремииЗаПроцент.ПремиязаПроцент;	
	Если не флЭтоВторойПродавец тогда
		ВыводДиаграммыПоПроцентам(СтруктураПремииЗаПроцент);
	КонецЕсли;
	
	//Итоги
	Итог	=	СуммаОклада + ПремияЗаОбщий + ПремиязаПроцент;
	Всего	=	Итог + ИтогоПремииФокус; 
	Элементы.ДекорацияИтог.Заголовок	=	"Итого за основную часть: " + Итог  			+" рублей."+Символы.ПС+
											"Итого за фокус. группы: "  + ИтогоПремииФокус	+" рублей."+Символы.ПС+Символы.ПС+
											"Всего: "+ Всего + " рублей." ;
	
	
	
КонецПроцедуры

//Функции получения данных
&НаСервереБезКонтекста
Функция ПолучитьДанныеПоОкладу(Продавец_, ПереключательМесяцДень, Период)
	СуммаОклада	=	0;
	Запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Оклад КАК Оклад
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда	
		СуммаОклада = рез.Оклад;
	КонецЕсли;
	
	КоличествоЧасов	=	0;
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	МАКСИМУМ(ЕСТЬNULL(ТБКСменыСотрудников.ВремяСмены, 0)) КАК ВремяСмены,
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК Поле1
	      	 	             |ПОМЕСТИТЬ ПоДням
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |	И ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ПоДням.ВремяСмены), 0) КАК ВремяСмены
	      	 	             |ИЗ
	      	 	             |	ПоДням КАК ПоДням");
	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда	
		КоличествоЧасов = рез.ВремяСмены;
	КонецЕсли; 
	
	//ЧасыВсего
	ЧасыВсего	=	0;
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	МАКСИМУМ(ЕСТЬNULL(ТБКСменыСотрудников.ВремяСмены, 0)) КАК ВремяСмены,
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК Поле1,
	      	 	             |	ТБКСменыСотрудников.Продавец КАК Продавец
	      	 	             |ПОМЕСТИТЬ ПоДням
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата),
	      	 	             |	ТБКСменыСотрудников.Продавец
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ПоДням.ВремяСмены), 0) КАК ВремяСмены
	      	 	             |ИЗ
	      	 	             |	ПоДням КАК ПоДням");
	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда	
		ЧасыВсего = рез.ВремяСмены;
	КонецЕсли; 

	
	Струк	=	новый Структура;
	Струк.Вставить("СуммаОклада",СуммаОклада * КоличествоЧасов);
	Струк.Вставить("КоличествоЧасов",КоличествоЧасов);
	Струк.Вставить("ЧасыВсего",ЧасыВсего);

	Возврат Струк;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоОбщемуПлану(ПереключательМесяцДень, Период)
	СуммаПлана	=	0;
	ПремияЗаОбщий		=	0;

	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.СуммаПремии КАК СуммаПремии
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период МЕЖДУ &ПериодН И &ПериодК
	      	 	             |	И ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана = ""План ТО""
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодК", КонецМесяца(Период));
	Рез = запрос.Выполнить().Выбрать(); 
	Если Рез.Следующий()  Тогда
		СуммаПлана		=	Рез.Сумма;	
		ПремияЗаОбщий	=	Рез.СуммаПремии;
	КонецЕсли;
	
	
	СуммаФакт			=	ПолучитьСуммуФактПоТипуПлана("План ТО");
	ПроцентВыполнения	=	0;
	
	Если СуммаПлана>0 тогда
		ПроцентВыполнения	=	Окр((СуммаФакт/СуммаПлана)*100,2);		
	КонецЕсли;
	
		
	Струк	=	новый Структура;
	Струк.Вставить("СуммаПлана",		Окр(СуммаПлана,0));
	Струк.Вставить("ПроцентВыполнения",	Окр(ПроцентВыполнения,0));
	Струк.Вставить("ПремияЗаПлан",		Окр(ПремияЗаОбщий,0));
	Струк.Вставить("СуммаФакт",			Окр(СуммаФакт,0));
	
	Возврат Струк;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоПремиямЗаПроцент(Продавец_, ПереключательМесяцДень, Период, ПроцентВыполненияОбщегоПлана)
	НоменклатураИсключения	=	Новый СписокЗначений;
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.ГруппыИсключений Цикл
			НоменклатураИсключения.Добавить(Строка.Номенклатура);	
		КонецЦикла; 
	КонецЦикла;
	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК День,
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТБКСменыСотрудников.Продавец) КАК КоличествоПродавцовВЭтотДень
	      	 	             |ПОМЕСТИТЬ ТЗ
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И НЕ ТБКСменыСотрудников.ПродавецНаЗамену
	      	 	             |	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК День
	      	 	             |ПОМЕСТИТЬ ДниЭтогоПродавца
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ТЗ.День КАК День,
	      	 	             |	ТЗ.КоличествоПродавцовВЭтотДень КАК КоличествоПродавцовВЭтотДень
	      	 	             |ПОМЕСТИТЬ ИтогПоДням
	      	 	             |ИЗ
	      	 	             |	ТЗ КАК ТЗ
	      	 	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДниЭтогоПродавца КАК ДниЭтогоПродавца
	      	 	             |		ПО ТЗ.День = ДниЭтогоПродавца.День
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки,
	      	 	             |	ДЕНЬ(ЧекККМТовары.Ссылка.Дата) КАК День
	      	 	             |ПОМЕСТИТЬ ПродажиПоДням
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары,
	      	 	             |	ИтогПоДням КАК ИтогПоДням
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&НоменклатураИсключения)
	      	 	             |	И ДЕНЬ(ЧекККМТовары.Ссылка.Дата) В (ИтогПоДням.День)
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ЧекККМТовары.Ссылка.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ПродажиПоДням.День КАК День,
	      	 	             |	ЕСТЬNULL(ПродажиПоДням.СуммаЧеки / ИтогПоДням.КоличествоПродавцовВЭтотДень, 0) КАК СуммаПродажПродавца
	      	 	             |ПОМЕСТИТЬ ПолныйИтог
	      	 	             |ИЗ
	      	 	             |	ПродажиПоДням КАК ПродажиПоДням
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогПоДням КАК ИтогПоДням
	      	 	             |		ПО ПродажиПоДням.День = ИтогПоДням.День
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ПолныйИтог.СуммаПродажПродавца), 0) КАК СуммаПродажПродавца
	      	 	             |ИЗ
	      	 	             |	ПолныйИтог КАК ПолныйИтог");	
	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Продавец",Продавец_);  	
	Запрос.УстановитьПараметр("НоменклатураИсключения",НоменклатураИсключения.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);

	СуммаПродажПродавца	=	0;
	Итог	=	Запрос.Выполнить().Выбрать();
	Если Итог.Следующий()  Тогда
		СуммаПродажПродавца	=	Итог.СуммаПродажПродавца;	
	КонецЕсли; 
	
	//Процент премии
	ПроцентПремии 					=	0;
	
	ТЗ_ПремияМоглаБыть	=	Новый ТаблицаЗначений;
	ТЗ_ПремияМоглаБыть.Колонки.Добавить("Процент");
	ТЗ_ПремияМоглаБыть.Колонки.Добавить("СуммаПремии");
	ТЗ_ПремияМоглаБыть.Колонки.Добавить("НужноВыполнитьПланНа");

	
	
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.Проценты Цикл
			Если Строка.ПроцентС = 0 и 	Строка.ПроцентДо = 0 тогда
				ПроцентПремии	=	Строка.ПроцентПремии;
				
			иначеЕсли ПроцентВыполненияОбщегоПлана > Строка.ПроцентС тогда
				ПроцентПремии	=	Строка.ПроцентПремии;
				
			Иначе
				НовСтрока	=	ТЗ_ПремияМоглаБыть.Добавить();	
				НовСтрока.Процент				=	Строка.ПроцентПремии;
				НовСтрока.НужноВыполнитьПланНа	=	Строка.ПроцентС;
			КонецЕсли;	
			
			
		КонецЦикла; 
	КонецЦикла;
	
	ПремиязаПроцент				=	Окр((СуммаПродажПродавца/100)*ПроцентПремии,0);
	
	Для каждого Строка из ТЗ_ПремияМоглаБыть цикл
		Строка.СуммаПремии	=	Окр((СуммаПродажПродавца/100)*Строка.Процент,0);
	КонецЦикла;
	
	Струк	=	новый Структура;           	
	Струк.Вставить("СуммаПродаж",					СуммаПродажПродавца);
	Струк.Вставить("Процент",						ПроцентПремии);
	Струк.Вставить("ПремиязаПроцент",				ПремиязаПроцент);
	Струк.Вставить("ТЗ_ПремияМоглаБыть",			ТЗ_ПремияМоглаБыть);
	
	Возврат Струк;		
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьДанныеПоПремиямЗаПроцент_ВторойПродавец(Продавец_, ПереключательМесяцДень, Период)
	НоменклатураИсключения	=	Новый СписокЗначений;
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.ГруппыИсключений Цикл
			НоменклатураИсключения.Добавить(Строка.Номенклатура);	
		КонецЦикла; 
	КонецЦикла;
	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И (ЧекККМТовары.Продавец = &Продавец
	      	 	             |			ИЛИ ЧекККМТовары.Продавец1 = &Продавец
	      	 	             |			ИЛИ ЧекККМТовары.Продавец2 = &Продавец)
	      	 	             |	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&НоменклатураИсключения)");

	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Продавец",Продавец_);  	
	Запрос.УстановитьПараметр("НоменклатураИсключения",НоменклатураИсключения.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);

	СуммаПродажПродавца	=	0;
	Итог	=	Запрос.Выполнить().Выбрать();
	Если Итог.Следующий()  Тогда
		СуммаПродажПродавца	=	Итог.СуммаЧеки;	
	КонецЕсли; 
	
	//Процент премии
	ПроцентПремии = 0;
	
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.Проценты Цикл
			Если Строка.ПроцентС = 0 и 	Строка.ПроцентДо = 0 тогда
				ПроцентПремии	=	Строка.ПроцентПремии;
				Прервать;				
			КонецЕсли;		
		КонецЦикла; 
	КонецЦикла;
	
	ПремиязаПроцент	=	(СуммаПродажПродавца/100)*ПроцентПремии;
	
	Струк	=	новый Структура;
	Струк.Вставить("СуммаПродаж",			СуммаПродажПродавца);
	Струк.Вставить("Процент",				ПроцентПремии);
	Струк.Вставить("ПремиязаПроцент",		ПремиязаПроцент);
	
	Возврат Струк;		
КонецФункции

Процедура ВыводДиаграммыПоПроцентам(СтруктураПремииЗаПроцент);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	НазваниеДиаграммы	= "ПланПремииПоПроцентам";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "Премии по процентам";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ГруппаДиаграммаПремииЗаПроцент);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("ТекущийПроцент");

	
	ТочкаТекущаяПремия 	 	 = НДиаг1.УстановитьТочку("Текущая премия");
	
	МаксимальноеЗначение	=	СтруктураПремииЗаПроцент.ПремиязаПроцент;
	
	Для каждого Строка из СтруктураПремииЗаПроцент.ТЗ_ПремияМоглаБыть цикл
		ТочкаПремия_МоглаБыть 	 = НДиаг1.УстановитьТочку("Премия могла быть, при выполнении плана на " + Строка.НужноВыполнитьПланНа+"%");
		
		
		НДиаг1.УстановитьЗначение(ТочкаПремия_МоглаБыть
			, НДиаг1.Серии[0]
			, Строка.СуммаПремии
			, Неопределено
			, "Премия могла быть: " + Строка.СуммаПремии+" При выполнении плана на " + Строка.НужноВыполнитьПланНа+"%");
				
		ТочкаПремия_МоглаБыть.ПриоритетЦвета	 = Истина;   		
		ТочкаПремия_МоглаБыть.Цвет 				 = WebЦвета.БледноКрасноФиолетовый; 	
		
		МаксимальноеЗначение	=	 Строка.СуммаПремии;
	КонецЦикла;
	
		
	
	ТочкаТекущаяПремия.ПриоритетЦвета	= Истина;  	
	ТочкаТекущаяПремия.Цвет 			= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаТекущаяПремия
		, НДиаг1.Серии[0]
		, СтруктураПремииЗаПроцент.ПремиязаПроцент
		, Неопределено
		, "Текущая премия " + СтруктураПремииЗаПроцент.ПремиязаПроцент);   		
		
		
		
	НДиаг1.ОтображатьЛегенду		= Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	МаксимальноеЗначение*1.2; 	
	
	Диаг.Высота						=	9;
	Диаг.Ширина						= 	70;
КонецПроцедуры

Процедура ВыводДиаграммыПоПланам(СтруктураОбщийПлан);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	НазваниеДиаграммы	= "ПланДиаграмма";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "1 ";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа12);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("Факт");
	НДиаг1.ТипДиаграммы			=	ТипДиаграммы.Измерительная;
	//НДиаг1.ТипДиаграммы			=	ТипДиаграммы.КольцеваяОбъемная;


	// Создать четыре полосы.
	Полосы = НДиаг1.ПолосыИзмерительнойДиаграммы;
	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = 0;
	НоваяПолоса.Конец = (СтруктураОбщийПлан.СуммаПлана/100)*25;
	НоваяПолоса.ЦветФона = WebЦвета.Красный;

	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (СтруктураОбщийПлан.СуммаПлана/100)*25;
	НоваяПолоса.Конец = (СтруктураОбщийПлан.СуммаПлана/100)*50;
	НоваяПолоса.ЦветФона = WebЦвета.БледноКрасноФиолетовый;

	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (СтруктураОбщийПлан.СуммаПлана/100)*50;
	НоваяПолоса.Конец = (СтруктураОбщийПлан.СуммаПлана/100)*75;
	НоваяПолоса.ЦветФона = Новый Цвет(225, 221, 19);

	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (СтруктураОбщийПлан.СуммаПлана/100)*75;
	НоваяПолоса.Конец = СтруктураОбщийПлан.СуммаПлана;
	НоваяПолоса.ЦветФона = Новый Цвет(148, 225, 109);
	//

	ТочкаФакт 	 	 			= НДиаг1.УстановитьТочку("Факт");	
	ТочкаФакт.ПриоритетЦвета	= Истина;  	
	ТочкаФакт.Цвет 			= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаФакт
		, НДиаг1.Серии[0]
		, СтруктураОбщийПлан.СуммаФакт
		, Неопределено
		, "Факт: " + СтруктураОбщийПлан.СуммаФакт);   		
		
		
	НДиаг1.ОтображатьЛегенду		= Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	СтруктураОбщийПлан.СуммаПлана;
	НДиаг1.ОтображатьЗаголовок		=	Ложь;
	НДиаг1.ОтображениеЗначенияИзмерительнойДиаграммы	=	ОтображениеЗначенияИзмерительнойДиаграммы.Сектор;	
	НДиаг1.ОбластьЗаголовка.Расположение				=	РасположениеОбластиЗаголовкаДиаграммы.Нет;
	НДиаг1.Рамка										=	новый Рамка(ТипРамкиЭлементаУправления.БезРамки);



	Диаг.Высота						=	8;
	Диаг.Ширина						= 	30;
	Диаг.ВертикальноеПоложение		=	ВертикальноеПоложениеЭлемента.Верх;
	Диаг.АвтоМаксимальнаяВысота		=	Ложь;
	Диаг.ПоложениеЗаголовка			=	ПоложениеЗаголовкаЭлементаФормы.Нет;
	Диаг.ГоризонтальноеПоложение	=	ГоризонтальноеПоложениеЭлемента.Право;
КонецПроцедуры
//

#КонецОбласти


#Область НоваяМотивация_2

&НаСервере
Процедура ЗаполнитьВариантНовойМотивации_2()
	ЗаполнитьФокусныеПремииОбщаяМотивация(); //фокус остается старый

	
	Элементы.Переключатель.Видимость	= Ложь;	
	Элементы.Группа3.Видимость			= Ложь;
	Элементы.Группа4.Видимость			= Ложь;
	Элементы.Основная.Видимость			= Ложь;
	Элементы.Группа2.Видимость			= Ложь; 
	
	
	Элементы.Новая.Видимость			= Ложь; 
	Элементы.Фокусная.Видимость			= Истина;
	Элементы.Новая_2.Видимость			= Истина; 


	ЦветСиний	=	WebЦвета.КоролевскиГолубой;
	ЦветКрасный	=	WebЦвета.Малиновый;
	флЭтоВторойПродавец	=	Ложь;
	
	
	//для второго
	флЭтоВторойПродавец	= Ложь;
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКСменыСотрудников.Продавец КАК Продавец,
	      	 	             |	ТБКСменыСотрудников.ТипПродавца КАК ТипПродавца
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца
	      	 	             |	И ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон");
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;   
	Запрос.УстановитьПараметр("Продавец", Продавец); 
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Если Запрос.Выполнить().Пустой() тогда
		флЭтоВторойПродавец = истина;
	КонецЕсли;
	
	
	
	//Оклад
	СтруктураОкладВремя	=	ПолучитьДанныеПоОкладу(Продавец, ПереключательМесяцДень, Период);
	

	СтрокаЧасы	=	ПолучитьСклоненияСтрокиПоЧислу("", Строка(СтруктураОкладВремя.КоличествоЧасов),   "час", "ЧС=Количественное", "ПД=Винительный; ");
	СтрокаЧасы	=	СтрокаЧасы[0];
	СтрокаЧасы	=	Сред(СтрокаЧасы, СтрНайти(СтрокаЧасы, Строка(СтруктураОкладВремя.КоличествоЧасов))+ СтрДлина(Строка(СтруктураОкладВремя.КоличествоЧасов) )); 	

	СтрокаСмены	=	ПолучитьСклоненияСтрокиПоЧислу("", Строка(КоличествоСмен),   "смена", "ЧС=Количественное", "ПД=Винительный; ");
	СтрокаСмены	=	СтрокаСмены[0];
	СтрокаСмены	=	Сред(СтрокаСмены, СтрНайти(СтрокаСмены, Строка(КоличествоСмен))+ СтрДлина(Строка(КоличествоСмен) )); 	
	
	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("За этот период вы отработали: ", 				, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(КоличествоСмен), 						, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(" "+СтрокаСмены+", ", 							, ЦветСиний));	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураОкладВремя.КоличествоЧасов), 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(СтрокаЧасы +" Сумма оклада: ", 					, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(""+СтруктураОкладВремя.СуммаОклада+"р.", 		, ЦветКрасный));
	
    Элементы.ДекорацияНадписьОклад2.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);
		
	СуммаОклада						=	СтруктураОкладВремя.СуммаОклада;
	
	//ОбщийПлан
	СтруктураОбщийПлан	=	ПолучитьДанныеПоОбщемуПлану_2(Период);
	ЛичнаяПремияЗавыполнениеПлана	=	0;
	Если СтруктураОкладВремя.ЧасыВсего>0 тогда 
		ЛичнаяПремияЗавыполнениеПлана	=	Окр( (СтруктураОбщийПлан.СуммаПремияЗаОбщий / СтруктураОкладВремя.ЧасыВсего) * СтруктураОкладВремя.КоличествоЧасов, 0 );
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Продавец) тогда ПремияЗаОбщий=0 КонецЕсли;
	
	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("План магазина за выбранный месяц: " + СтруктураОбщийПлан.СуммаПлана+"р."+ 
													" Факт. продаж: " + СтруктураОбщийПлан.СуммаФакт + "р. Что составляет: ",, ЦветСиний));
													
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураОбщийПлан.ПроцентВыполнения), 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("% плана." + Символы.ПС + "Сумма премии магазина: ", 		, ЦветСиний));
	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураОбщийПлан.СуммаПремияЗаОбщий)+ "р.", 	, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(" Ваша премия: " , 		, ЦветСиний));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(ЛичнаяПремияЗавыполнениеПлана)+ "р.", 	, ЦветКрасный));
	
	Элементы.ДекорацияНадписьОбщийПлан2.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);
	
	ВыводДиаграммыПоПланам_2(СтруктураОбщийПлан);
	ВыводДиаграммыПоПланамЗаСегодня_2(СтруктураОбщийПлан);	
	
	//Премия за проценты. 

	Если НЕ ЗначениеЗаполнено(Продавец) тогда
		СтруктураПремииЗаПроцент	=	новый Структура;
		СтруктураПремииЗаПроцент.Вставить("СуммаПродаж",			0);
		СтруктураПремииЗаПроцент.Вставить("Процент",				0);
		СтруктураПремииЗаПроцент.Вставить("ПремиязаПроцент",		0);
	
	иначе
		СтруктураПремииЗаПроцент	=	ПолучитьДанныеПоПремиямЗаПроцент_2(Продавец, ПереключательМесяцДень, Период, флЭтоВторойПродавец);//единый процент на все продажи
	КонецЕсли;
	
	
	МассЧастей = Новый Массив;
	МассЧастей.Добавить(Новый ФорматированнаяСтрока("Процент премии за выполнение плана: " 								,, ЦветСиний));	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(СтруктураПремииЗаПроцент.Процент)+"%."						,, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(" Сумма ваших личных продаж: "										,, ЦветСиний));   	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(Окр(СтруктураПремииЗаПроцент.СуммаПродаж,0))+ "р."			,, ЦветКрасный));
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Символы.ПС + "Сумма премии: "										,, ЦветСиний));  	
	МассЧастей.Добавить(Новый ФорматированнаяСтрока(Строка(Окр(СтруктураПремииЗаПроцент.ПремиязаПроцент,0))+ "р."		,, ЦветКрасный));
	
	Элементы.ДекорацияНадписьПремияЗаПроцент2.Заголовок = Новый ФорматированнаяСтрока(МассЧастей);	
		
	ПремиязаПроцент						=	СтруктураПремииЗаПроцент.ПремиязаПроцент;	

	//Итоги
	Итог	=	СуммаОклада + ЛичнаяПремияЗаВыполнениеПлана + ПремиязаПроцент;
	Всего	=	Итог + ИтогоПремииФокус; 
	Элементы.ДекорацияИтог2.Заголовок	=	"Итого оклад + премии: " + Итог  			+" рублей."+Символы.ПС+
											"Итого за фокус. группы: "  + ИтогоПремииФокус	+" рублей."+Символы.ПС+
											"Всего: "+ Всего + " рублей." ;
	
	
	
КонецПроцедуры

//Функции получения данных
&НаСервере
Функция ПолучитьДанныеПоОбщемуПлану_2(Период)
	СуммаПлана				=	0;
	СуммаПремияЗаОбщий		=	0;
	
	ТЗ_ПремияМоглаБыть	=	Новый ТаблицаЗначений;
	ТЗ_ПремияМоглаБыть.Колонки.Добавить("СуммаПремии");
	ТЗ_ПремияМоглаБыть.Колонки.Добавить("НужноВыполнитьПланНа");

	ТЗ_Интервалы = Новый ТаблицаЗначений();
	ТЗ_Интервалы.Колонки.Добавить("ПроцентС");
	ТЗ_Интервалы.Колонки.Добавить("ПроцентДо");
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период МЕЖДУ &ПериодН И &ПериодК
	      	 	             |	И ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана = ""План ТО""
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	Запрос.УстановитьПараметр("ПериодН", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодК", КонецМесяца(Период));
	Рез = запрос.Выполнить().Выбрать(); 
	Если Рез.Следующий()  Тогда
		СуммаПлана		=	Рез.Сумма;	
	КонецЕсли;
	

	СуммаФакт			=	ПолучитьСуммуФактПоТипуПлана("План ТО");
	ПроцентВыполнения	=	0;
	
	Если СуммаПлана>0 тогда
		ПроцентВыполнения	=	Окр((СуммаФакт/СуммаПлана)*100,2);		
	КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда	
		Для каждого Строка Из Рез.Ссылка.Проценты Цикл
			
			Если не (Строка.ПроцентС = 0 и 	Строка.ПроцентДо = 0) тогда
				НовСтрока_Инт	=	ТЗ_Интервалы.Добавить();
				НовСтрока_Инт.ПроцентС	=	Строка.ПроцентС;
				НовСтрока_Инт.ПроцентДо	=	Строка.ПроцентДо;
			КонецЕсли;
			
			
			Если Строка.ПроцентС = 0 и 	Строка.ПроцентДо = 0 тогда
				СуммаПремияЗаОбщий	=	Строка.СуммаПремии;
				
			иначеЕсли ПроцентВыполнения > Строка.ПроцентС тогда
				СуммаПремияЗаОбщий	=	Строка.СуммаПремии;
				
			Иначе
				НовСтрока	=	ТЗ_ПремияМоглаБыть.Добавить();	
				НовСтрока.СуммаПремии			=	Строка.СуммаПремии;
				НовСтрока.НужноВыполнитьПланНа	=	Строка.ПроцентС;
			КонецЕсли;	
		КонецЦикла; 
	КонецЕсли;
		
	Струк	=	новый Структура;
	Струк.Вставить("СуммаПлана",			Окр(СуммаПлана,0)); 
	Струк.Вставить("СуммаФакт",				Окр(СуммаФакт,0));
	Струк.Вставить("ПроцентВыполнения",		Окр(ПроцентВыполнения,0));
	Струк.Вставить("СуммаПремияЗаОбщий",	Окр(СуммаПремияЗаОбщий,0));
	Струк.Вставить("ТЗ_ПремияМоглаБыть",	ТЗ_ПремияМоглаБыть);
	Струк.Вставить("ТЗ_Интервалы",			ТЗ_Интервалы);
	
	Возврат Струк;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоПремиямЗаПроцент_2(Продавец_, ПереключательМесяцДень, Период, флЭтоВторойПродавец)
	НоменклатураИсключения	=	Новый СписокЗначений;
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.ГруппыИсключений Цикл
			НоменклатураИсключения.Добавить(Строка.Номенклатура);	
		КонецЦикла; 
	КонецЦикла;
	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК День,
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТБКСменыСотрудников.Продавец) КАК КоличествоПродавцовВЭтотДень
	      	 	             |ПОМЕСТИТЬ ТЗ
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И НЕ ТБКСменыСотрудников.ПродавецНаЗамену
	      	 	             |	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата) КАК День
	      	 	             |ПОМЕСТИТЬ ДниЭтогоПродавца
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ТБКСменыСотрудников.КассоваяСмена.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ТЗ.День КАК День,
	      	 	             |	ТЗ.КоличествоПродавцовВЭтотДень КАК КоличествоПродавцовВЭтотДень
	      	 	             |ПОМЕСТИТЬ ИтогПоДням
	      	 	             |ИЗ
	      	 	             |	ТЗ КАК ТЗ
	      	 	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДниЭтогоПродавца КАК ДниЭтогоПродавца
	      	 	             |		ПО ТЗ.День = ДниЭтогоПродавца.День
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК СуммаЧеки,
	      	 	             |	ДЕНЬ(ЧекККМТовары.Ссылка.Дата) КАК День
	      	 	             |ПОМЕСТИТЬ ПродажиПоДням
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары,
	      	 	             |	ИтогПоДням КАК ИтогПоДням
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&НоменклатураИсключения)
	      	 	             |	И ДЕНЬ(ЧекККМТовары.Ссылка.Дата) В (ИтогПоДням.День)
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ДЕНЬ(ЧекККМТовары.Ссылка.Дата)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ПродажиПоДням.День КАК День,
	      	 	             |	ЕСТЬNULL(ПродажиПоДням.СуммаЧеки / ИтогПоДням.КоличествоПродавцовВЭтотДень, 0) КАК СуммаПродажПродавца
	      	 	             |ПОМЕСТИТЬ ПолныйИтог
	      	 	             |ИЗ
	      	 	             |	ПродажиПоДням КАК ПродажиПоДням
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогПоДням КАК ИтогПоДням
	      	 	             |		ПО ПродажиПоДням.День = ИтогПоДням.День
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ПолныйИтог.СуммаПродажПродавца), 0) КАК СуммаПродажПродавца
	      	 	             |ИЗ
	      	 	             |	ПолныйИтог КАК ПолныйИтог");	
	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Продавец",Продавец_);  	
	Запрос.УстановитьПараметр("НоменклатураИсключения",НоменклатураИсключения.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);

	СуммаПродажПродавца	=	0;
	Итог	=	Запрос.Выполнить().Выбрать();
	Если Итог.Следующий()  Тогда
		СуммаПродажПродавца	=	Итог.СуммаПродажПродавца;	
	КонецЕсли; 
	
	//Процент премии
	ПроцентПремии 					=	0;	
	
	запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.Проценты Цикл
			Если Строка.ПроцентС = 0 и 	Строка.ПроцентДо = 0 тогда
				ПроцентПремии	=	Строка.ПроцентПремии;
				
				Если флЭтоВторойПродавец тогда
					Прервать;
				КонецЕсли;
			иначе
				ПроцентПремии	=	Строка.ПроцентПремии;
				Прервать;
				
			КонецЕсли;		
		КонецЦикла; 
	КонецЦикла;
	
	ПремиязаПроцент				=	Окр((СуммаПродажПродавца/100)*ПроцентПремии,0);
		
	Струк	=	новый Структура;           	
	Струк.Вставить("СуммаПродаж",					СуммаПродажПродавца);
	Струк.Вставить("Процент",						ПроцентПремии);
	Струк.Вставить("ПремиязаПроцент",				ПремиязаПроцент);
	
	Возврат Струк;		
КонецФункции

Процедура ВыводДиаграммыПоПланам_2(СтруктураОбщийПлан);
	//1 СПИДОМЕТР
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	НазваниеДиаграммы	= "ПланДиаграмма";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "Выполнение магазина %";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ГруппаДиаграммыПоМагазину_Общая);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("Факт");
	НДиаг1.ТипДиаграммы			=	ТипДиаграммы.Измерительная;
	//НДиаг1.ТипДиаграммы			=	ТипДиаграммы.КольцеваяОбъемная;


	// Создать полосы.
	Ном = 1;
	
	Для каждого Строка из СтруктураОбщийПлан.ТЗ_Интервалы цикл 
		Если Строка.ПроцентС = 0 тогда
			Полосы = НДиаг1.ПолосыИзмерительнойДиаграммы;
			НоваяПолоса = Полосы.Добавить();
			НоваяПолоса.Начало 		= 0;
			НоваяПолоса.Конец  		= Строка.ПроцентДо;
			НоваяПолоса.ЦветФона 	= WebЦвета.Красный;			
			Продолжить;
		КонецЕсли;
		
		Если Строка.ПроцентДо = 0 тогда
			Полосы = НДиаг1.ПолосыИзмерительнойДиаграммы;
			НоваяПолоса = Полосы.Добавить();
			НоваяПолоса.Начало = Строка.ПроцентС;
			НоваяПолоса.Конец  = 150;
			//НоваяПолоса.ЦветФона = Новый Цвет(148, 225, 109); 
			НоваяПолоса.ЦветФона = WebЦвета.ЗеленаяЛужайка;
			Продолжить;
		КонецЕсли;
		
		
		Полосы = НДиаг1.ПолосыИзмерительнойДиаграммы;
		НоваяПолоса = Полосы.Добавить();
		НоваяПолоса.Начало = Строка.ПроцентС;
		НоваяПолоса.Конец  = Строка.ПроцентДо;
		Если Ном = 1 тогда
			НоваяПолоса.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
		ИначеЕсли  Ном = 2 тогда 
			НоваяПолоса.ЦветФона = WebЦвета.Желтый;
		КонецЕсли;
		
		Ном	=	Ном+1;
	КонецЦикла;
	//

	ТочкаФакт 	 	 			= НДиаг1.УстановитьТочку("Факт");	
	ТочкаФакт.ПриоритетЦвета	= Истина;  	
	ТочкаФакт.Цвет 				= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаФакт
		, НДиаг1.Серии[0]
		, СтруктураОбщийПлан.ПроцентВыполнения
		, Неопределено
		, "Факт: " + СтруктураОбщийПлан.ПроцентВыполнения);   		
		
		
	НДиаг1.ОтображатьЛегенду		= Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	150;
	НДиаг1.ОтображениеЗначенияИзмерительнойДиаграммы	=	ОтображениеЗначенияИзмерительнойДиаграммы.Сектор;	
	НДиаг1.Рамка										=	новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	НДиаг1.ОсьЗначений.СпособОпределенияМинимальногоЗначения	=	 СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;

	Диаг.Высота						=	8;
	Диаг.Ширина						= 	30;
	Диаг.ВертикальноеПоложение		=	ВертикальноеПоложениеЭлемента.Верх;
	Диаг.АвтоМаксимальнаяВысота		=	Ложь;
	
	//2Столбики
	ВыводДиаграммыПоПремиям_2(СтруктураОбщийПлан);
КонецПроцедуры

Процедура ВыводДиаграммыПоПремиям_2(СтруктураОбщийПлан);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	НазваниеДиаграммы	= "ПланПремияМагазина";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "Премия магазина";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ГруппаДиаграммыПоМагазину_Общая);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("ТекущаяПремия");

	
	ТочкаТекущаяПремия 	 	= НДиаг1.УстановитьТочку("Текущая премия");
	
	МаксимальноеЗначение	=	СтруктураОбщийПлан.СуммаПремияЗаОбщий;
	
	Для каждого Строка из СтруктураОбщийПлан.ТЗ_ПремияМоглаБыть цикл
		ТочкаПремия_МоглаБыть 	 = НДиаг1.УстановитьТочку("Премия могла быть, при выполнении плана на " + Строка.НужноВыполнитьПланНа+"%");
		
		
		НДиаг1.УстановитьЗначение(ТочкаПремия_МоглаБыть
			, НДиаг1.Серии[0]
			, Строка.СуммаПремии
			, Неопределено
			, "Премия могла быть: " + Строка.СуммаПремии+" При выполнении плана на " + Строка.НужноВыполнитьПланНа+"%");
				
		ТочкаПремия_МоглаБыть.ПриоритетЦвета	 = Истина;   		
		ТочкаПремия_МоглаБыть.Цвет 				 = WebЦвета.БледноКрасноФиолетовый; 	
		
		МаксимальноеЗначение	=	 Строка.СуммаПремии;
	КонецЦикла;
	
		
	
	ТочкаТекущаяПремия.ПриоритетЦвета	= Истина;  	
	ТочкаТекущаяПремия.Цвет 			= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаТекущаяПремия
		, НДиаг1.Серии[0]
		, СтруктураОбщийПлан.СуммаПремияЗаОбщий
		, Неопределено
		, "Текущая премия " + СтруктураОбщийПлан.СуммаПремияЗаОбщий);   		
		
		
		
	НДиаг1.ОтображатьЛегенду		= Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	МаксимальноеЗначение*1.2; 	
	
	Диаг.Высота						=	8;
	Диаг.Ширина						= 	70;
КонецПроцедуры

Процедура ВыводДиаграммыПоПланамЗаСегодня_2(СтруктураОбщийПлан);
	//1 СПИДОМЕТР
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	НазваниеДиаграммы	= "ПланДиаграммаСегодня";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "Выполнение плана за сегодняшний день";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ГруппаДиаграммыПоМагазину_Сегодня);		
	Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	Диаг.ПутьКДанным			= НазваниеДиаграммы;
	Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;

	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("Факт");
	НДиаг1.ТипДиаграммы			=	ТипДиаграммы.Измерительная;
	//НДиаг1.ТипДиаграммы			=	ТипДиаграммы.КольцеваяОбъемная;

	КоличествоДней	=	Число(Сред(КонецМесяца(ТекущаяДата()), 1, 2));
	ПланСегодня		=	Окр(СтруктураОбщийПлан.СуммаПлана /  КоличествоДней,0);
	//ПланСегодня		=	Строка(Окр(СтруктураОбщийПлан.СуммаПлана /  КоличествоДней,0));
	//ПланСегодня		=	Число( Сред(ПланСегодня,1, СтрДлина(ПланСегодня) - 2) + "00") ;

	// Создать четыре полосы.
	Полосы = НДиаг1.ПолосыИзмерительнойДиаграммы;
	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = 0;
	НоваяПолоса.Конец = (ПланСегодня/100)*25;
	НоваяПолоса.ЦветФона = WebЦвета.Красный;

	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (ПланСегодня/100)*25;
	НоваяПолоса.Конец = (ПланСегодня/100)*50;
	НоваяПолоса.ЦветФона = WebЦвета.БледноКрасноФиолетовый;

	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (ПланСегодня/100)*50;
	НоваяПолоса.Конец = (ПланСегодня/100)*75;
	//НоваяПолоса.ЦветФона = Новый Цвет(225, 221, 19);
	НоваяПолоса.ЦветФона = WebЦвета.Желтый;
	
	НоваяПолоса = Полосы.Добавить();
	НоваяПолоса.Начало = (ПланСегодня/100)*75;
	НоваяПолоса.Конец = ПланСегодня;
	//НоваяПолоса.ЦветФона = Новый Цвет(148, 225, 109);
	НоваяПолоса.ЦветФона = WebЦвета.ЗеленаяЛужайка;
	
	СуммаФактСегодня	=	ПолучитьСуммуФактПоТипуПлана("План ТО", ,Истина);
	

	ТочкаФакт 	 	 			= НДиаг1.УстановитьТочку("Факт");	
	ТочкаФакт.ПриоритетЦвета	= Истина;  	
	ТочкаФакт.Цвет 				= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаФакт
		, НДиаг1.Серии[0]
		, СуммаФактСегодня
		, Неопределено
		, "Факт: " + СуммаФактСегодня+" План дня: "+ПланСегодня);   		
		

	
	НДиаг1.ОтображатьЛегенду		= Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Нет;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	ПланСегодня;
	НДиаг1.ОтображениеЗначенияИзмерительнойДиаграммы	=	ОтображениеЗначенияИзмерительнойДиаграммы.Сектор;	
	НДиаг1.Рамка										=	новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	НДиаг1.ОсьЗначений.СпособОпределенияМинимальногоЗначения	=	 СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;

	Диаг.Высота						=	8;
	Диаг.Ширина						= 	40;
	Диаг.ВертикальноеПоложение		=	ВертикальноеПоложениеЭлемента.Верх;
	Диаг.АвтоМаксимальнаяВысота		=	Ложь;
КонецПроцедуры

//

#КонецОбласти

#область ДопФункции
&НаСервереБезКонтекста
Функция ПолучитьКоличествоСмен(Продавец, Период)
	Запрос			=	Новый Запрос("ВЫБРАТЬ
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Поле1,
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
		      			 	             |ПОМЕСТИТЬ ПродавцыСмены
		      			 	             |ИЗ
		      			 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		      			 	             |ГДЕ
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		      			 	             //|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      			 	             |	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
		      			 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец = &Продавец
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
		      			 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец
		      			 	             |;
		      			 	             |
		      			 	             |////////////////////////////////////////////////////////////////////////////////
		      			 	             |ВЫБРАТЬ
		      			 	             |	ПродавцыСмены.Продавец КАК Продавец,
		      			 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродавцыСмены.Поле1) КАК КолСмен
		      			 	             |ИЗ
		      			 	             |	ПродавцыСмены КАК ПродавцыСмены
		      			 	             |
		      			 	             |СГРУППИРОВАТЬ ПО
		      			 	             |	ПродавцыСмены.Продавец");
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Продавец",Продавец);

	ПродавцыСмены	=	Запрос.Выполнить().Выбрать();
	
	КолСмен	=	0;
	Если ПродавцыСмены.Следующий() тогда
		КолСмен	=	ПродавцыСмены.КолСмен;
	КонецЕсли; 
	
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена КАК КассоваяСмена
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.Продавец = &Продавец
	      	 	             |	И ТБКСменыСотрудников.КассоваяСмена.Статус = &Статус");
	      	 	             //|	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца");
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыКассовойСмены.Открыта);
	Запрос.УстановитьПараметр("Продавец",Продавец);
	
	ОткрытыеСмены	=	Запрос.Выполнить().Выбрать();

	Если ОткрытыеСмены.Следующий() тогда
		КолСмен	=	КолСмен + 1;
	КонецЕсли; 

	
	Возврат КолСмен;  	
КонецФункции

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	Если ВариантМотивации = 1 тогда
		Если Переключатель = 0 тогда
			ЗаполнитьВариантПлановойМотивации();	
		Иначе
			ЗаполнитьВариантПлановойМотивации_Личный();
		КонецЕсли; 		
	иначеЕсли ВариантМотивации = 2 тогда
		Если Переключатель = 0 тогда
			ЗаполнитьВариантПроцентнойМотивации();	
		Иначе
			ЗаполнитьВариантПроцентнойМотивации_Личный();
		КонецЕсли; 
		
	иначеЕсли ВариантМотивации = 3 тогда
		Если Переключатель = 0 тогда
			ЗаполнитьВариантПроцентнойМотивации();//он такой же	
		Иначе
			ЗаполнитьВариантФокуснойМотивации();
		КонецЕсли; 
		
	иначеЕсли ВариантМотивации = 5 тогда
		ЗаполнитьВариантНовойМотивации();
		
	иначеЕсли ВариантМотивации = 6 тогда
		ЗаполнитьВариантНовойМотивации_2();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВывестиТаблицу(Родитель, ТаблицаРасшифровка, ИтогоБонус, Продавец, СЧ);
	//Родитель.Заголовок				=	Строка(Продавец) + "; Кол. смен: " + КоличествоСмен + 
	//												"; Сумма премии: "+ИтогоБонус + "р.";  				
	Родитель.ОтображатьЗаголовок	=	Истина; 
			
	// добавим таблицу: сначала саму таблицу, потом колонку.
	Реквизиты = Новый Массив;

		
	Реквизиты.Добавить(Новый РеквизитФормы("ТаблицаНаФорме"+СЧ, Новый ОписаниеТипов("ТаблицаЗначений")));
	Для Каждого Ст ИЗ ТаблицаРасшифровка.Колонки Цикл
		Реквизиты.Добавить(Новый РеквизитФормы(Ст.Имя, Ст.ТипЗначения, "ТаблицаНаФорме"+СЧ,Ст.заголовок));
	КонецЦикла;

	// добавим реквизиты на форму
	ИзменитьРеквизиты(Реквизиты);

	// добавим элементы формы
	Таб = Элементы.Добавить("ТаблицаНаФорме"+СЧ, Тип("ТаблицаФормы"),Родитель);
	Таб.ПутьКДанным = "ТаблицаНаФорме"+СЧ;
	Таб.Высота		=	11;
	//Таб.Ширина	=	200;
	// запретим менять положение строк и сами строки, отключим командную панель
	Таб.ИзменятьСоставСтрок = Ложь;
	Таб.ИзменятьПорядокСтрок = Ложь;
	Таб.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;

	Для Каждого Ст ИЗ ТаблицаРасшифровка.Колонки Цикл
		Если Ст.Имя = "Заголовок" тогда Продолжить; КонецЕсли;
		
		Рек = Элементы.Добавить("Колонка" + Ст.Имя+сч, Тип("ПолеФормы"), Таб);
		Рек.Вид = ВидПоляФормы.ПолеНадписи;
		Рек.ПутьКДанным = "ТаблицаНаФорме"+СЧ + "." + Ст.Имя;
		Рек.Заголовок = Ст.заголовок;
		Если  Ст.Имя	= "ФокусГруппа" тогда
			Рек.Ширина	= 30;	
		иначе
			Рек.Ширина	= 15;
		КонецЕсли;
	КонецЦикла;

	// заполним таблицу
	ЗначениеВРеквизитФормы(ТаблицаРасшифровка, "ТаблицаНаФорме"+СЧ);
	УстановитьДействиеПриАктивизацииСтрокиНаФорме();

КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеПриАктивизацииСтрокиНаФорме()
	Элементы["ТаблицаНаФорме0"].УстановитьДействие("ПриАктивизацииСтроки", "ПриАктивизацииСтрокиТаблицы");   
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиТаблицы();
	Если Элементы["ТаблицаНаФорме0"].ТекущиеДанные <> Неопределено тогда
		Элементы.Декорация1.Заголовок	=	Элементы["ТаблицаНаФорме0"].ТекущиеДанные.Заголовок;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроставитьСписокПродавцов(Период)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
	      	 	             |ИЗ
	      	 	             |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
	      	 	             |ГДЕ
	      	 	             //|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
	      	 	             |	 ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец");  
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	РезВсеПродавцы	=	Запрос.Выполнить().Выгрузить();    
	РезВсеПродавцы.Свернуть("Продавец");
	
	
	Элементы.Продавец.СписокВыбора.Очистить();
	Для каждого Строка из РезВсеПродавцы цикл 	
		Элементы.Продавец.СписокВыбора.Добавить(Строка.Продавец);
	КонецЦикла;
	
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена КАК КассоваяСмена,
	      	 	             |	ТБКСменыСотрудников.Продавец КАК Продавец
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	      	 	             |ГДЕ
	      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Статус = &Статус");
	      	 	             //|	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца");
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыКассовойСмены.Открыта);
	
	ОткрытыеСмены	=	Запрос.Выполнить().Выбрать();

	Пока ОткрытыеСмены.Следующий() цикл
		Если Элементы.Продавец.СписокВыбора.НайтиПоЗначению(ОткрытыеСмены.Продавец) = Неопределено тогда
			Элементы.Продавец.СписокВыбора.Добавить(ОткрытыеСмены.Продавец);
		КонецЕсли;
	КонецЦикла;; 


КонецФункции



Процедура УдалитьРеквизиты(флТолькоПоФокусу = Ложь)
	УдаляемыеРеквизиты = Новый Массив;
	
	
	Если флТолькоПоФокусу тогда
		Для каждого элемент из ЭтаФорма.ПолучитьРеквизиты() цикл
		    Если (Найти(элемент.Имя, "ФокусДиаграмма") или Найти(элемент.Имя, "ТаблицаНаФорме")) и не  Найти(элемент.Имя, "фл") тогда
				УдаляемыеРеквизиты.Добавить(элемент.Имя);  	
			КонецЕсли;
		КонецЦикла;  
		
	иначе
		Для каждого элемент из ЭтаФорма.ПолучитьРеквизиты() цикл
		    Если (Найти(элемент.Имя, "План") или Найти(элемент.Имя, "ТаблицаНаФорме")) и не  Найти(элемент.Имя, "фл") тогда
				УдаляемыеРеквизиты.Добавить(элемент.Имя);  	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	ЭтаФорма.ИзменитьРеквизиты(,УдаляемыеРеквизиты);    
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	//Период = НачалоМесяца(Период);
	фПостроенаПлановаяОбщая	=	Ложь;
	флПостроенаПлановаяЛичная	=	ложь;

	УдалитьРеквизиты();
			
	Если ВариантМотивации = 1 тогда
		Если Переключатель = 0 тогда		
			ЗаполнитьВариантПлановойМотивации();
		иначе
			ЗаполнитьВариантПлановойМотивации_Личный();
		КонецЕсли;	
		
	ИначеЕсли ВариантМотивации = 2 тогда
		ЗаполнитьВариантПроцентнойМотивации_Личный();
		
	ИначеЕсли ВариантМотивации = 3 тогда
		Если Переключатель = 0 тогда
			ЗаполнитьВариантПроцентнойМотивации();//он такой же в общем варианте, отличается только в личном
		иначе
			ЗаполнитьВариантФокуснойМотивации();
		КонецЕсли;
		
	ИначеЕсли ВариантМотивации = 4 тогда
		ЗаполнитьВариантОбщейМотивации();
		
	ИначеЕсли ВариантМотивации = 5 тогда
		ЗаполнитьВариантНовойМотивации();
		
	ИначеЕсли ВариантМотивации = 6 тогда
		ЗаполнитьВариантНовойМотивации_2();

	КонецЕсли;
	
	ПроставитьСписокПродавцов(Период);	
	КоличествоСмен						=	ПолучитьКоличествоСмен(Продавец, Период);
	Элементы.КолСменСтрока.Заголовок	=	"Кол.смен: " + Строка(КоличествоСмен);
КонецПроцедуры

&НаКлиенте
Процедура ПериодСписокПриИзменении(Элемент)
	Если ПериодСписок = "Январь" тогда Период	=	Дата(Год(текущаяДата()),1,1) КонецЕсли;
	Если ПериодСписок = "Февраль" тогда Период	=	Дата(Год(текущаяДата()),2,1) КонецЕсли;
	Если ПериодСписок = "Март" тогда Период		=	Дата(Год(текущаяДата()),3,1) КонецЕсли;
	Если ПериодСписок = "Апрель" тогда Период	=	Дата(Год(текущаяДата()),4,1) КонецЕсли;
	Если ПериодСписок = "Май" тогда Период		=	Дата(Год(текущаяДата()),5,1) КонецЕсли;
	Если ПериодСписок = "Июнь" тогда Период		=	Дата(Год(текущаяДата()),6,1) КонецЕсли;
	Если ПериодСписок = "Июль" тогда Период		=	Дата(Год(текущаяДата()),7,1) КонецЕсли;
	Если ПериодСписок = "Август" тогда Период	=	Дата(Год(текущаяДата()),8,1) КонецЕсли;
	Если ПериодСписок = "Сентябрь" тогда Период	=	Дата(Год(текущаяДата()),9,1) КонецЕсли;
	Если ПериодСписок = "Октябрь" тогда Период	=	Дата(Год(текущаяДата()),10,1) КонецЕсли;
	Если ПериодСписок = "Ноябрь" тогда Период	=	Дата(Год(текущаяДата()),11,1) КонецЕсли;
	Если ПериодСписок = "Декабрь" тогда Период	=	Дата(Год(текущаяДата()),12,1) КонецЕсли;

	ПериодПриИзменении(Неопределено);

КонецПроцедуры                                                         


&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	КоличествоСмен	=	ПолучитьКоличествоСмен(Продавец, Период);
	Элементы.КолСменСтрока.Заголовок	=	"Кол.смен: "+Строка(КоличествоСмен);
	
	УдалитьРеквизиты();

	Если ВариантМотивации = 1 тогда
		Если Переключатель = 0 тогда		
			ЗаполнитьВариантПлановойМотивации();
		иначе
			ЗаполнитьВариантПлановойМотивации_Личный();
		КонецЕсли;	
		
	ИначеЕсли ВариантМотивации = 2 тогда
		ЗаполнитьВариантПроцентнойМотивации_Личный();
		
	ИначеЕсли ВариантМотивации = 3 тогда
		Если Переключатель = 0 тогда
			ЗаполнитьВариантПроцентнойМотивации();//он такой же в общем варианте, отличается только в личном
		иначе
			ЗаполнитьВариантФокуснойМотивации();
		КонецЕсли;
		
	ИначеЕсли ВариантМотивации = 4 тогда
		ЗаполнитьВариантОбщейМотивации();
		
	ИначеЕсли ВариантМотивации = 5 тогда
		ЗаполнитьВариантНовойМотивации();   

	ИначеЕсли ВариантМотивации = 6 тогда
		ЗаполнитьВариантНовойМотивации_2();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательМесяцДеньПриИзменении(Элемент)
	Если ПереключательМесяцДень = 0 тогда
		ПериодСписокПриИзменении(Неопределено);
	иначе
		Период	=	ТекущаяДата();
	КонецЕсли;
	
	УдалитьРеквизиты();
	
	Если ВариантМотивации = 1 тогда
		ЗаполнитьВариантПлановойМотивации();
		
	ИначеЕсли ВариантМотивации = 2 тогда
		Элементы.Переключатель.Видимость	= Ложь;
		//ЗаполнитьВариантПроцентнойМотивации();
		ЗаполнитьВариантПроцентнойМотивации_Личный();
		
	ИначеЕсли ВариантМотивации = 3 тогда
		ЗаполнитьВариантПроцентнойМотивации();//он такой же в общем варианте, отличается только в личном
		
	ИначеЕсли ВариантМотивации = 4 тогда
		ЗаполнитьВариантОбщейМотивации();
		
	ИначеЕсли ВариантМотивации = 5 тогда
		ЗаполнитьВариантНовойМотивации();
		
	ИначеЕсли ВариантМотивации = 6 тогда
		ЗаполнитьВариантНовойМотивации_2();



	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереключательТаблицаДиаграммаПриИзменении(Элемент)
	УдалитьРеквизиты(истина);
	//ЗаполнитьВариантОбщейМотивации(); 
	ЗаполнитьФокусныеПремииОбщаяМотивация();
	
	Если ПереключательТаблицаДиаграмма	=	0 тогда
		Элементы.Декорация1.Видимость			=	Истина;
		//ЭтаФорма.Высота	=	30;
	иначе
		Элементы.Декорация1.Видимость			=	Ложь;
		//ЭтаФорма.Высота	=	45;
	КонецЕсли;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеПоУценке(ПереключательМесяцДень, Период, Продавец)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	КомментарииСтатистики.ХешНаименования КАК ХешНаименования,
	      	 	             |	КомментарииСтатистики.Наименование КАК Наименование
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.КомментарииСтатистики КАК КомментарииСтатистики
	      	 	             |ГДЕ
	      	 	             |	КомментарииСтатистики.Наименование ПОДОБНО &НаименованиеТБК
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 4, 2) = &Месяц
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 7, 4) = &Год
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 1, 2) = &День");
	Запрос.УстановитьПараметр("НаименованиеТБК","%tbkskidka%");

	ДеньСтрока	=	Строка(День(Период));
	МесяцСтрока	=	Строка(Месяц(Период));
	ГодСтрока	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(Год(Период)));

	Если СтрДлина(МесяцСтрока) = 1 тогда МесяцСтрока = "0"+ МесяцСтрока; КонецЕсли;
	
	Запрос.УстановитьПараметр("Месяц",МесяцСтрока);
	Запрос.УстановитьПараметр("Год",ГодСтрока);
	
	Если ПереключательМесяцДень = 1 тогда
		Если СтрДлина(ДеньСтрока) = 1 тогда ДеньСтрока = "0"+ ДеньСтрока; КонецЕсли;
		Запрос.УстановитьПараметр("День",ДеньСтрока);   
	иначе
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 1, 2) = &День","");		
	КонецЕсли;
	
	МассивВозврата	=	Новый Массив;
	
	
	ПроданоТабак	=	0;
	ПроданоСувениры	=	0;
	ПремияТабак		=	0;
	ПремияСувениры	=	0;
	СуммаТабак		=	0;
	СуммаСувениры	=	0;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из рез цикл
		//изменения 20240205
		Если ЗначениеЗаполнено(Продавец) и ТекущаяДата() > '20240301' тогда
			НомерЧека	=	Прав(Строка.ХешНаименования,11);
			
			СтрокаДата	=	Лев(Строка.ХешНаименования,19); 
			Если Прав(СтрокаДата,1) = ";" тогда
				СтрокаДата	=	Лев(СтрокаДата,18);	
			КонецЕсли;   			
			ДатаЧека	=	Дата(СтрокаДата);

			НужЧек		=	Документы.ЧекККМ.НайтиПоНомеру(НомерЧека, ДатаЧека);
			
			Если Не НужЧек.Пустая() тогда
				Если НужЧек.Товары.Количество() >0 тогда
					Если НужЧек.Товары[0].Продавец <> Продавец тогда
						
						Продолжить;
						
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Данные		=	Строка.Наименование;		
		Поз3		=	СтрНайти(Данные,"/",,,3);
		Поз9		=	СтрНайти(Данные,"/",,,9);
		Поз10		=	СтрНайти(Данные,"/",,,10);
		ПозЗагружен	=	СтрНайти(Данные,"загружен");
		
		КодГруппы	=	Сред(Данные,Поз3+1,11);
		
		КодГруппы	=	СтрЗаменить(КодГруппы,"u","Ю");
		
		Попытка
			Если Поз10 = 0 тогда 
				Если ПозЗагружен >0 тогда
					Сумма		=	Сред(Данные,Поз9+1, ПозЗагружен-Поз9-1);
				иначе
					Сумма		=	Сред(Данные,Поз9+1);
				КонецЕсли;
				Сумма	=	Число(Сумма);
				
			иначе
				Если ПозЗагружен >0 тогда
					Сумма		=	Сред(Данные,Поз10+1, ПозЗагружен-Поз10-1);
				иначе
					Сумма		=	Сред(Данные,Поз10+1);
				КонецЕсли;
				Сумма	=	Число(Сумма);
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;


		ПК			=	Справочники.Номенклатура.НайтиПоКоду(КодГруппы).ПолныйКод();
		Если найти(ПК, "00048205349") тогда //Это Табак
			ПроданоТабак	=	ПроданоТабак +1;
			ПремияТабак		=	ПремияТабак + (Сумма/100)*10;	
			Попытка
				СуммаТабак		=	СуммаТабак + Сумма;
			Исключение
			КонецПопытки;
		иначе
			ПроданоСувениры	=	ПроданоСувениры + 1;
			ПремияСувениры	=	ПремияСувениры  +  (Сумма/100)*20;	
			Попытка
				СуммаСувениры	=	СуммаСувениры + Сумма;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураПремийУценка	=	Новый Структура;
	СтруктураПремийУценка.Вставить("ПроданоТабак", 		ПроданоТабак);
	СтруктураПремийУценка.Вставить("ПроданоСувениры", 	ПроданоСувениры);
	СтруктураПремийУценка.Вставить("СуммаТабак", 		СуммаТабак);
	СтруктураПремийУценка.Вставить("СуммаСувениры", 	СуммаСувениры);
	СтруктураПремийУценка.Вставить("ПремияТабак", 		ПремияТабак);
	СтруктураПремийУценка.Вставить("ПремияСувениры", 	ПремияСувениры);
	
	
	Возврат СтруктураПремийУценка;
	
	
КонецФункции

&НаКлиенте
Процедура Группа8ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.заголовок = "Основная" тогда
		ТекущаяСтраница.РастягиватьПоВертикали	=	Ложь;
		//ТекущаяСтраница.Высота					=	45;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Основная.РастягиватьПоВертикали	=	Ложь;
	Если флразвернуть тогда
		Попытка
			WSHShell = Новый COMОбъект("WScript.Shell");
			WSHShell.SendKeys("% ");
			WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");

		Исключение
		КонецПопытки;
	КонецЕсли;
	
	
	
КонецПроцедуры

#КонецОбласти
 

	////Выводим Суммы ФОКУС мотивации БЕЗ ПЛАНА! для примера гистограммы с накоплением
	//Запрос	=	Новый Запрос("ВЫБРАТЬ
	//      	 	             |	ТБКФокуснаяМотивация.Период КАК Период,
	//      	 	             |	ТБКФокуснаяМотивация.Номенклатура КАК Номенклатура,
	//      	 	             |	ТБКФокуснаяМотивация.Процент КАК Процент,
	//      	 	             |	ТБКФокуснаяМотивация.Сумма КАК Сумма
	//      	 	             |ИЗ
	//      	 	             |	РегистрСведений.ТБКФокуснаяМотивация КАК ТБКФокуснаяМотивация
	//      	 	             |ГДЕ
	//      	 	             |	ТБКФокуснаяМотивация.Период МЕЖДУ &ДатаНач И &ДатаКон
	//      	 	             |	И ТБКФокуснаяМотивация.ПланКоличество = 0");
	//
	//Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	//Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//НазваниеДиаграммы	=	"ПланФокус";
	//НДиаг         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	//
	//ДобавляемыеРеквизиты = Новый Массив;
	//ДобавляемыеРеквизиты.Добавить(НДиаг);  	
	//ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

	//Диаг 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа2);		
	//Диаг.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	//Диаг.ПутьКДанным			= НазваниеДиаграммы;
	//Диаг.ЦветТекстаЗаголовка	= WebЦвета.Синий;
	//Диаг.Ширина					=	15;
	//
	//НДиаг						=	ЭтаФорма[НазваниеДиаграммы];
	//НДиаг.ТипДиаграммы			=	ТипДиаграммы.ГистограммаСНакоплениемОбъемная;

	//ТочкаСуммаПремии 			=	НДиаг.УстановитьТочку("Премии");

	//СуммаИтог	=	0;
	//Ном = 0;
	//Пока Рез.Следующий() цикл
	//	
	//	//СтрокаФокусГруппа	=	ТЗ_Премии.найти(Строка(Рез.Номенклатура));
	//	//Если СтрокаФокусГруппа<>Неопределено тогда
	//	//	СуммаПремииФокус	=	СтрокаФокусГруппа.СуммаОборот;
	//	//иначе
	//	//	Продолжить;
	//	//КонецЕсли; 
	//	
	//	ТЗПродано	=	ПолучитьКоличествоПродажПоГруппе(Продавец, Рез.Номенклатура,  Истина);	
	//	Если ТЗПродано.Количество() = 0 тогда Продолжить; КонецЕсли;
	//	
	//	Если Рез.Процент>0 тогда
	//		СуммаПремииФокус	=	(ТЗПродано[0].Сумма/100) * Рез.Процент;
	//	иначе
	//		СуммаПремииФокус	=	ТЗПродано[0].Количество * Рез.Сумма;
	//	КонецЕсли;
	//	
	//	СуммаИтог			=	СуммаИтог + СуммаПремииФокус;		

	//	НДиаг.Серии.Добавить(Строка(Рез.Номенклатура));
	//	
	//	//определяем точки

	//	НДиаг.УстановитьЗначение(ТочкаСуммаПремии
	//					, НДиаг.Серии[Ном]
	//					, СуммаПремииФокус
	//					, Неопределено
	//					, "Премия за " + Строка(Рез.Номенклатура)+" "+СуммаПремииФокус);
	//					

	//	Ном	=	Ном+1;
	//	
	//	ИтогоПремии	=	ИтогоПремии +  СуммаПремииФокус;
	//КонецЦикла;
	//Диаг.Заголовок		= "Премии по фокус.группам: " + СуммаИтог;
