Функция ПередвинутьДокументыНаДату(датаКудаПеренести) ЭКСПОРТ
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаркетинговаяАкция.Ссылка КАК Ссылка,
	               |	МаркетинговаяАкция.Дата КАК Дата
	               |ИЗ
	               |	Документ.МаркетинговаяАкция КАК МаркетинговаяАкция
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МаркетинговаяАкция.Дата";
	
	рез = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	Пока рез.Следующий() Цикл		
		об = рез.Ссылка.ПолучитьОбъект();
		Если ЛОЖЬ Тогда об = Документы.МаркетинговаяАкция.СоздатьДокумент(); КонецЕсли;		
		
		об.Дата = датаКудаПеренести;		
		об.Записать(?(об.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Проведение));
		
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции