
&Перед("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Найти(Комментарий, "Смена ИП") Тогда
		
		Запрос = Новый запрос("ВЫБРАТЬ
		                      |	Контрагенты.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Контрагенты КАК Контрагенты
		                      |ГДЕ
		                      |	Контрагенты.Наименование <> """"
		                      |	И Контрагенты.Поставщик
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Контрагенты.Наименование");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			
				Контрагент = Выборка.Ссылка;	
			
			КонецЕсли;	
		
		КонецЕсли;
			
	
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	
	
	
КонецПроцедуры
