&Перед("ОбработкаПроверкиЗаполнения")
Процедура ТБКОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Марк 2025-01-22
	Если Найти(Комментарий, "Смена ИП") Тогда //поступление просто для остатков. сказано пофиг что будет тут указано
		
		Если НЕ Контрагент.Пустая() И Найти(Строка(Контрагент), "<Объект не найден>") или Контрагент.Пустая()Тогда 
			
			Запрос = Новый запрос("ВЫБРАТЬ
			                      |	Контрагенты.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.Контрагенты КАК Контрагенты
			                      |ГДЕ
			                      |	Контрагенты.Наименование <> """"
			                      |	И Контрагенты.Поставщик
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	Контрагенты.Наименование");
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда

				Контрагент = Выборка.Ссылка;	

			КонецЕсли;	
			
		КонецЕсли;

		Для каждого Строка Из Товары Цикл 
			
			//ндс не пересчитываю, поступление просто для остатков. сказано пофиг что будет тут указано
			Строка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			
		КонецЦикла;	
		
	КонецЕсли;
	//КонецМарк
КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	//Марк 2025-01-22
	////исправление <Объект не найден> +++ 
	//МассивНеНайденныхСсылок = Новый Массив;
	//мСоответствиеИдентификаторовТипов = Неопределено;
	//
	//Для каждого Строка Из Товары Цикл 
	//	
	//	Если НЕ Строка.Номенклатура.Пустая() И Найти(Строка(Строка.Номенклатура), "<Объект не найден>") Тогда
	//		Если Строка.Номенклатура.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Номенклатура), мСоответствиеИдентификаторовТипов));	
	//		КонецЕсли;
	//	КонецЕсли;  
	//	
	//	Если НЕ Строка.Характеристика.Пустая() И Найти(Строка(Строка.Характеристика), "<Объект не найден>") Тогда
	//		Если Строка.Характеристика.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Характеристика), мСоответствиеИдентификаторовТипов));		
	//		КонецЕсли;	
	//	КонецЕсли;
	//	
	//	Если НЕ Строка.Упаковка.Пустая() И Найти(Строка(Строка.Упаковка), "<Объект не найден>") Тогда
	//		Если Строка.Упаковка.ПолучитьОбъект() = Неопределено Тогда
	//			МассивНеНайденныхСсылок.Добавить(ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Упаковка), мСоответствиеИдентификаторовТипов));	
	//		КонецЕсли;
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	//
	//
	//Если ЗначениеЗаполнено(МассивНеНайденныхСсылок) Тогда
	//	
	//	эл = Новый Структура;
	//	эл.Вставить("Array_GUID", МассивНеНайденныхСсылок);
	//	эл.Вставить("Dokument_GUID", Строка(Ссылка.УникальныйИдентификатор())); 
	//	
	//	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
	//	
	//	Если Прокси <> Неопределено Тогда 
	//		
	//		Попытка
	//			JS = ОбщегоНазначения.СтруктураВjson_Общая(эл);
	//			Ответ = Прокси.RregistrationLinks(JS);	
	//		Исключение
	//			
	//		КонецПопытки;	
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////исправление <Объект не найден> ---
	//КонецМарк
	
КонецПроцедуры
