
&Вместо("ОткрытьФормуПодбораНоменклатурыПоШтрихкодам")
Процедура ТБКОткрытьФормуПодбораНоменклатурыПоШтрихкодам(НеизвестныеШтрихкоды, ФормаВладелец, ОповещениеОЗакрытии)
	
	ЕстьПравоСопоставленияНоменклатуры 	= НЕ УправлениеПользователямиВызовСервера.ПолучитьБулевоЗначениеПраваПользователя(
	ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.НеСопоставлятьТовары"), Ложь);
	
	Если ЕстьПравоСопоставленияНоменклатуры Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
		ОткрытьФорму("Обработка.РаботаСНоменклатурой.Форма.ПоискНоменклатурыПоШтрихкоду",
		СтруктураПараметров, ФормаВладелец, Новый УникальныйИдентификатор, , , ОповещениеОЗакрытии);
		
	Иначе
		
		Для Каждого Штрихкод Из НеизвестныеШтрихкоды Цикл
			
			//Марк 2025-03-14
			Если ТипЗнч(Штрихкод) = Тип("Структура") Тогда
				
				СтрокаСообщения = НСтр("ru = 'Данные по коду не найдены: %1%'");
				СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", Штрихкод.Штрихкод);
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
				
			иначе 
			//КонецМарк

				СтрокаСообщения = НСтр("ru = 'Данные по коду не найдены: %1%'");
				СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", Штрихкод);
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
			
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры
