
&НаСервереБезКонтекста
&Вместо("СНООрганизации")
Функция ТБКСНООрганизации(Организация)
	
	Результат = Новый Структура("СНО, ОбъектНалогообложения, ОсвобожденОтНДС");
	
	СНООрганизации = РегистрыСведений.ПрименениеСистемНалогообложения.СистемаНалогообложенияОрганизации(Организация);
	
	Если СНООрганизации <> Неопределено Тогда
		
		Если СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход Тогда
			Результат.СНО 					= "УСН";
			Результат.ОбъектНалогообложения = "Доход";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			Результат.СНО 					= "УСН";
			Результат.ОбъектНалогообложения = Нстр("ru='Доход минус расход'");
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			Результат.СНО = "ОСН";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			Результат.СНО = "ЕНВД";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			Результат.СНО = "Патент";	
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			Результат.СНО = "ЕСН";
			//Марк 2025-02-13
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход5 Тогда
			Результат.СНО = "УСНДоходРасход5";
		ИначеЕсли СНООрганизации.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход7 Тогда
			Результат.СНО = "УСНДоходРасход7";
			//КонецМарк
		КонецЕсли;
		
		Результат.ОсвобожденОтНДС = СНООрганизации.ОсвобожденОтНДС;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТБКСистемаНалогообложенияПриИзмененииВместо(Элемент)
	Если СистемаНалогообложения = "УСН" или СистемаНалогообложения = "УСНДоходРасход5" или СистемаНалогообложения = "УСНДоходРасход7" Тогда
		Элементы.УСНОбъектНалогообложения.Видимость = Истина;
		Элементы.ОсвобожденОтНДС.Видимость 			= Ложь;
		
	ИначеЕсли СистемаНалогообложения = "ОСН" ИЛИ СистемаНалогообложения = "ЕСН" Тогда
		Элементы.УСНОбъектНалогообложения.Видимость = Ложь;
		Элементы.ОсвобожденОтНДС.Видимость 			= Истина;
	Иначе
		Элементы.УСНОбъектНалогообложения.Видимость = Ложь;
		Элементы.ОсвобожденОтНДС.Видимость 			= Ложь;
	КонецЕсли;
КонецПроцедуры
