
&Вместо("СоздатьВТДокументыНаККМ")
Процедура ТБКСоздатьВТДокументыНаККМ(МенеджерВременныхТаблиц, КассоваяСмена, СсылкаНаОтчет)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КассаККМ", КассоваяСмена.КассаККМ);
	Запрос.УстановитьПараметр("НачалоКассовойСмены", КассоваяСмена.НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ОкончаниеКассовойСмены", КассоваяСмена.ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("ОтчетОРозничныхПродажах", СсылкаНаОтчет);
	
	Если ЗначениеЗаполнено(СсылкаНаОтчет) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ВидОперации КАК ВидОперации,
		|	Док.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	Док.ЧекККМПродажа КАК ЧекККМПродажа,
		|	Док.ОперацияСДенежнымиСредствами КАК ОперацияСДенежнымиСредствами,
		|	Док.ВыручкаНаличными КАК ВыручкаНаличными,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
		|				И Док.ОтчетОРозничныхПродажах <> &ОтчетОРозничныхПродажах
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоВозвратПослеЗакрытияСмены,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК КоэффициентВидаОплаты,
		|	Док.АналитикаХозяйственнойОперации КАК АналитикаХозяйственнойОперации
		|ПОМЕСТИТЬ втТаблицаЧеков
		|ИЗ
		|	Документ.ЧекККМ КАК Док
		|ГДЕ
		|	Док.КассаККМ = &КассаККМ
		|	И Док.Проведен
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Отложенный)
		|	И Док.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|	И Док.Дата >= &Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные) КАК ВидОплаты,
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаПоступления,
		|	0 КАК СуммаВозврата
		|ПОМЕСТИТЬ втДокументыНаККМ
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|	И ПриходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И ПриходныйКассовыйОрдер.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|	И ПриходныйКассовыйОрдер.Дата >= &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка,
		|	РасходныйКассовыйОрдер.Контрагент,
		|	РасходныйКассовыйОрдер.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные),
		|	0,
		|	РасходныйКассовыйОрдер.СуммаДокумента
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|	И РасходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И РасходныйКассовыйОрдер.Проведен
		|	И РасходныйКассовыйОрдер.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|	И РасходныйКассовыйОрдер.Дата >= &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаОтПокупателяПлатежнойКартой.Ссылка,
		|	ОплатаОтПокупателяПлатежнойКартой.Контрагент,
		|	ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация,
		|	ОплатаОтПокупателяПлатежнойКартой.ВидОплаты,
		|	ВЫБОР
		|		КОГДА ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|			ТОГДА ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|			ТОГДА 0
		|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
		|ГДЕ
		|	ОплатаОтПокупателяПлатежнойКартой.КассаККМ = &КассаККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.ПробиватьЧекиПоКассеККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.Проведен
		|	И ОплатаОтПокупателяПлатежнойКартой.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|	И ОплатаОтПокупателяПлатежнойКартой.Дата >= &Дата";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ВидОперации КАК ВидОперации,
		|	Док.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	Док.ЧекККМПродажа КАК ЧекККМПродажа,
		|	Док.ОперацияСДенежнымиСредствами КАК ОперацияСДенежнымиСредствами,
		|	Док.ВыручкаНаличными КАК ВыручкаНаличными,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
		|				И Док.ЧекККМПродажа.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Архивный)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоВозвратПослеЗакрытияСмены,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК КоэффициентВидаОплаты,
		|	Док.АналитикаХозяйственнойОперации КАК АналитикаХозяйственнойОперации
		|ПОМЕСТИТЬ втТаблицаЧеков
		|ИЗ
		|	Документ.ЧекККМ КАК Док
		|ГДЕ
		|	Док.КассаККМ = &КассаККМ
		|	И (Док.Дата МЕЖДУ &НачалоКассовойСмены И &ОкончаниеКассовойСмены
		|			ИЛИ &ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1))
		|	И Док.Проведен
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Архивный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Отложенный)
		|	И Док.Дата >= &Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные) КАК ВидОплаты,
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаПоступления,
		|	0 КАК СуммаВозврата
		|ПОМЕСТИТЬ втДокументыНаККМ
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|	И ПриходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И НЕ ПриходныйКассовыйОрдер.СменаЗакрыта
		|	И ПриходныйКассовыйОрдер.Дата >= &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка,
		|	РасходныйКассовыйОрдер.Контрагент,
		|	РасходныйКассовыйОрдер.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные),
		|	0,
		|	РасходныйКассовыйОрдер.СуммаДокумента
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|	И РасходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И РасходныйКассовыйОрдер.Проведен
		|	И НЕ РасходныйКассовыйОрдер.СменаЗакрыта
		|	И РасходныйКассовыйОрдер.Дата >= &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаОтПокупателяПлатежнойКартой.Ссылка,
		|	ОплатаОтПокупателяПлатежнойКартой.Контрагент,
		|	ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация,
		|	ОплатаОтПокупателяПлатежнойКартой.ВидОплаты,
		|	ВЫБОР
		|		КОГДА ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|			ТОГДА ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|			ТОГДА 0
		|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
		|ГДЕ
		|	ОплатаОтПокупателяПлатежнойКартой.КассаККМ = &КассаККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.ПробиватьЧекиПоКассеККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.Проведен
		|	И НЕ ОплатаОтПокупателяПлатежнойКартой.СменаЗакрыта
		|	И ОплатаОтПокупателяПлатежнойКартой.Дата >= &Дата";
		
	КонецЕсли;	
	Запрос.УстановитьПараметр("дата", ТекущаяДата() - 24*60*60);
	Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
