&Перед("ОбработкаПроверкиЗаполнения")
Процедура ТБКОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Строка из Товары цикл
		Если не ЗначениеЗаполнено(Строка.цена) тогда
			Строка.цена = Строка.Сумма / Строка.Количество;	
		КонецЕсли;
	КонецЦикла;
	
	//Вик 2024-08-20
	Для каждого СТрока из Товары цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Характеристика) и Строка.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики тогда
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			      	 	             |ГДЕ
			      	 	             |	ХарактеристикиНоменклатуры.Наименование = &Наименование
			      	 	             |	И ХарактеристикиНоменклатуры.Владелец = &Владелец
			      	 	             |	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления");	
			Запрос.УстановитьПараметр("Наименование", Строка(Строка.цена) );
			Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура );
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Строка.Характеристика	=	Рез.Ссылка;	
			КонецЕсли;

		КонецЕсли;		
	КонецЦикла;	
	//


КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	ОбщегоНазначения.ЗаполнитьЗапросДанныхДляНовойУт(Товары);
КонецПроцедуры
