
&НаСервере
Процедура ОтобразитьПродажиПоГруппам(ДН,ДК);
	ТаблицаПродаж.Очистить();
	
	Группа = Справочники.Номенклатура.НайтиПоКоду("00048205348");
	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПродажиОбороты.СтоимостьОборот КАК СтоимостьОборот
	      	 	             |ИЗ
	      	 	             |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, , Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ПродажиОбороты");
	Запрос.УстановитьПараметр("ДатаНач",ДН);
	Запрос.УстановитьПараметр("ДатаКон",ДК);
	Запрос.УстановитьПараметр("Номенклатура",Группа);
	Рез = Запрос.Выполнить().Выгрузить();
	
	НоваяСтрока	=	ТаблицаПродаж.Добавить();
	НоваяСтрока.Группа			=	Группа;
	Если Рез.Количество()>0 тогда
		НоваяСтрока.Сумма	=	Рез[0].СтоимостьОборот;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОтобразитьПродажиПоГруппам(ДатаНач,КонецДня(ДатаКон)); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНач	=	НачалоДня(ТекущаяДата());
	ДатаКон	=	ТекущаяДата();
	ОтобразитьПродажиПоГруппам(ДатаНач,КонецДня(ДатаКон));
КонецПроцедуры
