Функция Установить_ОсобенностьУчетаДля_ТабачнаяПродукция() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	               |	Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	               |	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	               |		ПО (ВидыНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	               |			И (ВидыНоменклатуры.ОсобенностьУчета = &ОсобенностьУчета)
	               |			И Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики = ВидыНоменклатуры.ИспользоватьХарактеристики
	               |ГДЕ
	               |	Номенклатура.ПометкаУдаления = ЛОЖЬ
	               |	И Номенклатура.ТабачнаяПродукция = ИСТИНА
	               |	И (Номенклатура.ОсобенностьУчета <> &ОсобенностьУчета
	               |			ИЛИ Номенклатура.ВидНоменклатуры <> ВидыНоменклатуры.Ссылка)";
	
	
	
	особенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
	
	Запрос.УстановитьПараметр("ОсобенностьУчета",особенностьУчета);
	
	рез = Запрос.Выполнить().Выбрать();
	
	инд = 0;
	Пока Рез.Следующий() Цикл
		об = рез.Ссылка.ПолучитьОбъект();
		Если Ложь Тогда об = Справочники.Номенклатура.СоздатьЭлемент(); КонецЕсли;
		
		об.ВидНоменклатуры = рез.ВидНоменклатуры;
		об.ОсобенностьУчета = особенностьУчета;
		
		Попытка
			об.Записать();
			инд = инд + 1;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат инд;
КонецФункции





Функция УдалитьХарактеристики_НеЗаполнено() ЭКСПОРТ
	
	//TODO только для теста, в бою ен стоит удалять характеристики
	возврат 0;
	
	Запрос = Новый Запрос;
	
	мПодлежитУдалению = Новый Массив;
	мПодлежитУдалению.Добавить("<Не заполнено>");
	мПодлежитУдалению.Добавить("не назначена");
	                                 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.ИспользоватьХарактеристики = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать)
	               |	И ХарактеристикиНоменклатуры.Наименование В(&мПодлежитУдалению)";
	
	Запрос.УстановитьПараметр("мПодлежитУдалению",мПодлежитУдалению);
	
	рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Рез.Ссылка.получитьОбъект().Удалить();
	Конеццикла;
	
КонецФункции
