
&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	Адрес = ПоместитьТоварВоВременноеХранилище();
	ОповеститьОВыборе(Адрес);
		
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Товар.Выгрузить());

КонецФункции // ПосместитьВоВременноеХралище()
 



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.НоменклатураБК;
		
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номеклатура = Параметры.НоменклатураБК;
	НоваяСтрока.склад = Параметры.ПараметрыСканирования.склад;
	
КонецПроцедуры  

