

Функция Получить_Магазин() ЭКСПОРТ
	Возврат Получить_ЗначениеКонстанты("Магазин");
КонецФункции

Функция Установить_Магазин(магазин) ЭКСПОРТ
	Установить_ЗначениеКонстанты("Магазин",магазин);
КонецФункции




Функция Получить_РежимРаботыРасширения() ЭКСПОРТ
	Возврат Получить_ЗначениеКонстанты("РежимРаботыРасширения");
КонецФункции

Функция Установить_РежимРаботыРасширения(режимРаботыРасширения) ЭКСПОРТ
	Установить_ЗначениеКонстанты( "РежимРаботыРасширения",режимРаботыРасширения);
	
	док = Новый ТекстовыйДокумент();
	док.УстановитьТекст(режимРаботыРасширения);
	док.Записать("c:\app\database\Tabakon.Configuration.txt", "windows-1251");
	
	//"c:\app\database\Tabakon.version.loaded.txt"  
КонецФункции










Функция Установить_ЗначениеКонстанты(имяКонстанты, значениеКонстанты)
	запись = РегистрыСведений.ТБК_Константы.СоздатьМенеджерЗаписи();
	
	запись.ИмяКонстанты = имяКонстанты;
	запись.ЗначениеКонстанты = значениеКонстанты; 
	запись.Записать(Истина);
КонецФункции

Функция Получить_ЗначениеКонстанты(имяКонстанты)
	запись = РегистрыСведений.ТБК_Константы.СоздатьМенеджерЗаписи();
	запись.ИмяКонстанты = имяКонстанты;
	запись.Прочитать();
	
	Если запись.Выбран() Тогда
		Возврат запись.ЗначениеКонстанты;
	КонецЕсли;

КонецФункции