Функция ПолучитьВерсиюРасширения() экспорт 	
	
	результ = "";
	
	НужнаяПоз = найти(ПараметрыСеанса.ПодключенныеРасширения,")");
	результ   = Сред(ПараметрыСеанса.ПодключенныеРасширения,1,НужнаяПоз);
	результ = СтрЗаменить(результ,")","");
	результ = СтрЗаменить(результ,"(","");

	Возврат результ;
	
	//мРасширений = РасширенияКонфигурации.Получить();
	//
	//Для Каждого расширение из мРасширений Цикл
	//	результ = результ + ?(ЗначениеЗаполнено(результ),"; ","")+расширение.Имя+":"+расширение.Версия;
	//КонецЦикла;
	//
	//возврат результ;
	
КонецФункции



Функция ПолучитьМагазин() ЭКСПОРТ
	Возврат ПолучитьМагазинИзООРП();
КонецФункции



Функция ПолучитьМагазинИзООРП() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетОРозничныхПродажах.Магазин КАК Магазин
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |ГДЕ
	               |	ОтчетОРозничныхПродажах.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетОРозничныхПродажах.Дата УБЫВ";
	
	рез = Запрос.Выполнить().Выгрузить();
	
	Если рез.Количество()>0 тогда
		Возврат Рез[0].Магазин;
	иначе
		Возврат Справочники.Магазины.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьСкладИзООРП() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетОРозничныхПродажах.Магазин.СкладПродажи КАК Склад
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |ГДЕ
	               |	ОтчетОРозничныхПродажах.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетОРозничныхПродажах.Дата УБЫВ";
	
	рез = Запрос.Выполнить().Выгрузить();
	
	Если рез.Количество()>0 тогда
		Возврат Рез[0].Склад;
	иначе
		Возврат Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьКассаККМИзООРП() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетОРозничныхПродажах.КассаККМ КАК КассаККМ
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |ГДЕ
	               |	ОтчетОРозничныхПродажах.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетОРозничныхПродажах.Дата УБЫВ";
	
	рез = Запрос.Выполнить().Выгрузить();
	
	Если рез.Количество()>0 тогда
		Возврат Рез[0].КассаККМ;
	иначе
		Возврат Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
КонецФункции


Функция СтруктураВjson_Общая(Значение) экспорт

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли; 	
	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции

Функция ПолучитьСтруктуруПодключенияFTP() экспорт
	СтруктураВозврата	=	новый Структура;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	НастройкиТранспортаОбменаДанными.Корреспондент КАК Корреспондент,
	      	 	             |	НастройкиТранспортаОбменаДанными.FTPСоединениеПуть КАК FTPСоединениеПуть,
	      	 	             |	НастройкиТранспортаОбменаДанными.FTPСоединениеПользователь КАК FTPСоединениеПользователь,
	      	 	             |	НастройкиТранспортаОбменаДанными.FTPСоединениеПорт КАК FTPСоединениеПорт
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.НастройкиТранспортаОбменаДанными КАК НастройкиТранспортаОбменаДанными
	      	 	             |ГДЕ
	      	 	             |	НЕ НастройкиТранспортаОбменаДанными.Корреспондент.ПометкаУдаления");
	
	Рез = запрос.Выполнить().Выгрузить();
	
	для каждого Строка из рез цикл
		Если ТипЗнч(Строка.Корреспондент) = Тип("ПланОбменаСсылка.ОбменРозницаУправлениеТорговлей103") тогда
			Пароль			=	ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка.Корреспондент, "FTPСоединениеПароль");
			НужПользователь	=	Строка.FTPСоединениеПользователь;
			Порт			=	Строка.FTPСоединениеПорт;

			
			СерверИКаталогНаСервере = ОбменДаннымиСервер.FTPИмяСервераИПуть(СокрЛП(Строка.FTPСоединениеПуть));
			
			ИмяFTPСервера			= СерверИКаталогНаСервере.Сервер;
			КаталогНаСервере 		= СерверИКаталогНаСервере.Путь;
			
			СтруктураВозврата.Вставить("ИмяFTPСервера",ИмяFTPСервера);
			СтруктураВозврата.Вставить("КаталогНаСервере",КаталогНаСервере);
			СтруктураВозврата.Вставить("Пользователь",НужПользователь);
			СтруктураВозврата.Вставить("Пароль",Пароль);
			СтруктураВозврата.Вставить("Порт",Порт);
			
			Возврат СтруктураВозврата;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;
			
КонецФункции


Функция ПолучитьТерминал(РабочееМесто) экспорт
	СписокУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам( , , РабочееМесто);
	
	Для каждого Строка из СписокУстройств цикл
		Если Строка.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал тогда
			
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
			      	 	             |ГДЕ
			      	 	             |	НЕ ЭквайринговыеТерминалы.ПометкаУдаления
			      	 	             |	И (ЭквайринговыеТерминалы.ПодключаемоеОборудование = &ПодключаемоеОборудование
			      	 	             |			ИЛИ ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования)");
			Запрос.УстановитьПараметр("ПодключаемоеОборудование",Строка.Ссылка);
			
			Рез = Запрос.Выполнить().Выгрузить();
			Если рез.Количество() >0 тогда
				Возврат Рез[0].Ссылка;
			иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции