Функция ПолучитьВерсиюРасширения() экспорт 	
	
	результ = "";
	
	мРасширений = РасширенияКонфигурации.Получить();
	
	Для Каждого расширение из мРасширений Цикл
		результ = результ + ?(ЗначениеЗаполнено(результ),"; ","")+расширение.Имя+":"+расширение.Версия;
	КонецЦикла;
	
	возврат результ;
	
КонецФункции



Функция ПолучитьМагазин() ЭКСПОРТ
	Запрос	=	новый Запрос("ВЫБРАТЬ
	      	 	             |	Кассы.Ссылка КАК Ссылка,
	      	 	             |	Кассы.Магазин КАК Магазин
	      	 	             |ИЗ
	      	 	             |	Справочник.Кассы КАК Кассы
	      	 	             |ГДЕ
	      	 	             |	Кассы.Магазин <> &Магазин");
	Запрос.УстановитьПараметр("Магазин",Справочники.Магазины.ПустаяСсылка());
	рез = Запрос.Выполнить().Выгрузить();
	
	Если рез.Количество()>0 тогда
		Возврат Рез[0].Магазин;
	КонецЕсли;
КонецФункции
