Функция ПолучитьВерсиюРасширения() экспорт 	
	
	результ = "";
	
	НужнаяПоз = найти(ПараметрыСеанса.ПодключенныеРасширения,")");
	результ   = Сред(ПараметрыСеанса.ПодключенныеРасширения,1,НужнаяПоз);
	результ = СтрЗаменить(результ,")","");
	результ = СтрЗаменить(результ,"(","");

	Возврат результ;
	
	//мРасширений = РасширенияКонфигурации.Получить();
	//
	//Для Каждого расширение из мРасширений Цикл
	//	результ = результ + ?(ЗначениеЗаполнено(результ),"; ","")+расширение.Имя+":"+расширение.Версия;
	//КонецЦикла;
	//
	//возврат результ;
	
КонецФункции



Функция ПолучитьМагазин() ЭКСПОРТ
	Возврат ПолучитьМагазинИзООРП();
КонецФункции



Функция ПолучитьМагазинИзООРП() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
	               |	ОтчетОРозничныхПродажах.Дата КАК Дата,
	               |	ОтчетОРозничныхПродажах.Магазин КАК Магазин
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |ГДЕ
	               |	ОтчетОРозничныхПродажах.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетОРозничныхПродажах.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Магазин",Справочники.Магазины.ПустаяСсылка());
	рез = Запрос.Выполнить().Выгрузить();
	
	Если рез.Количество()>0 тогда
		Возврат Рез[0].Магазин;
	КонецЕсли;
КонецФункции