
&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)	
	
	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать продажи'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='JSON (*.json)|*.json'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

		
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			продажиЗаПериод = ВыгрузитьВФайлНаСервере(
				ЭтаФорма.ПериодВыгрузки.ДатаНачала, 
				ЭтаФорма.ПериодВыгрузки.ДатаОкончания
			);
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(имяФайла);
			ЗаписатьJSON(ЗаписьJSON,продажиЗаПериод);
			ЗаписьJSON.Закрыть();
			
			Сообщить("Файл сформирован: "+ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьВФайлНаСервере(датаН, датаК)
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продажи.Номенклатура КАК Номенклатура,
	               |	Продажи.Характеристика КАК Характеристика,
	               |	МАКСИМУМ(Продажи.Цена) КАК Цена,
	               |	СУММА(Продажи.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ЧекККМ.Товары КАК Продажи
	               |ГДЕ
	               |	Продажи.Ссылка.Проведен
	               |	И Продажи.Ссылка.СтатусЧекаККМ В(&СтатусыЧекаККМ)
	               |	И Продажи.Ссылка.Дата >= &датаН
	               |	И Продажи.Ссылка.Дата <= &датаК
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Номенклатура,
	               |	Продажи.Характеристика";
	
	
	СтатусыЧекаККМ = Новый Массив;
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Архивный);
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Пробитый);
	
	Запрос.УстановитьПараметр("СтатусыЧекаККМ",СтатусыЧекаККМ);
	Запрос.УстановитьПараметр("датаН",НачалоДня(датаН));
	Запрос.УстановитьПараметр("датаК",КонецДня(датаК));
	
	рез = Запрос.Выполнить().Выбрать();
	
	результ = Новый Массив;
	Пока рез.Следующий() Цикл
		результ.Добавить(
			Новый Структура("НоменклатураУИ,Номенклатура,ХарактеристикаУИ,Характеристика,Количество,Цена",
				Строка(рез.Номенклатура.УникальныйИдентификатор()),
				Строка(рез.Номенклатура),
				?(рез.Характеристика=неопределено,"",Строка(рез.Характеристика.УникальныйИдентификатор())),
				?(рез.Характеристика=неопределено,"",Строка(рез.Характеристика)),
				рез.Количество,
				рез.Цена
			)
		);
	КонецЦикла;
	
	Возврат результ;
КонецФункции


&НаКлиенте
Процедура ВыгрузитьВФайлОРП(Команда)	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать документы'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='JSON (*.json)|*.json'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки_ОРП", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

		
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки_ОРП(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			ОРП_ = ВыгрузитьВФайлНаСервереОРП();
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(ИмяФайла);
			ЗаписатьJSON(ЗаписьJSON, ОРП_);
			ЗаписьJSON.Закрыть();
			
			Сообщить("Файл сформирован: " + ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

&НаСервере
Функция ВыгрузитьВФайлНаСервереОРП()
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|	ОтчетОРозничныхПродажахТовары.Характеристика КАК Характеристика,
		|	ОтчетОРозничныхПродажахТовары.Количество КАК Количество,
		|	ОтчетОРозничныхПродажахТовары.Цена КАК Цена,
		|	ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|ГДЕ
		|	ОтчетОРозничныхПродажахТовары.Ссылка В(&МассивОРП)
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОРП", ОРП.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	МассивОбщий	=	Новый Массив; 
	
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Склад", 	            Строка(ВыборкаСсылка.Ссылка.Магазин.СкладПродажи));
		СтруктураДанных.Вставить("СуммаДокумента", 	        ВыборкаСсылка.Ссылка.СуммаДокумента);
		СтруктураДанных.Вставить("Номер", 	                Строка(ВыборкаСсылка.Ссылка.Номер));
		СтруктураДанных.Вставить("Дата", 	                Строка(ВыборкаСсылка.Ссылка.Дата)); 
		
		Товары = Новый Массив;
		СтруктураДанных.Вставить("Товары", Товары);
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Товары.Добавить(Новый Структура("НоменклатураУИ, Номенклатура, ХарактеристикаУИ, Характеристика, Количество, Цена",
			Строка(ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор()),
			Строка(ВыборкаДетальныеЗаписи.Номенклатура),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика.УникальныйИдентификатор())),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика)),
			ВыборкаДетальныеЗаписи.Количество,
			ВыборкаДетальныеЗаписи.Цена));
		КонецЦикла;
		
			МассивОбщий.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивОбщий;
	
КонецФункции

