
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Установка значений параметров
	ГруппаХозТовары = Новый Массив;
	
	ГруппаХозТовары.Добавить(Справочники.Номенклатура.НайтиПоКоду("00048203136")); 
	ГруппаХозТовары.Добавить(Справочники.Номенклатура.НайтиПоКоду("Ю2-00007771")); 
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.ПометкаУдаления = ЛОЖЬ
	               |	И Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаХозТовары)
	               |	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |ИТОГИ ПО
	               |	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ГруппаХозТовары", ГруппаХозТовары); 
	
	Данные = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Данные, "ДеревоНоменклатуры");
	
	Элементы.ДеревоНоменклатуры.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНоменклатурыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Закрыть(Элементы.ДеревоНоменклатуры.ТекущиеДанные.Номенклатура);
КонецПроцедуры
