
&Вместо("ОбменРозницаУправлениеТорговлей103ЗарегистрироватьИзменениеДокумента")
Процедура ТБКОбменРозницаУправлениеТорговлей103ЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	//Вик 2025-12-25
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		Возврат;	
	КонецЕсли;
	//
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменРозницаУправлениеТорговлей103", Источник, Отказ, РежимЗаписи, РежимПроведения);


КонецПроцедуры
