
&Вместо("РазобратьКодМаркировки")
Функция ТБКРазобратьКодМаркировки(Знач ДанныеДляРазбора, ВидыПродукции, ПримечаниеКРезультатуРазбора)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(ДанныеДляРазбора, ВидыПродукции, ПримечаниеКРезультатуРазбора);
	
	//Костыль для воды 2023-06-15
	Если Результат = Неопределено и (СтрДлина(ДанныеДляРазбора) = 37 или СтрДлина(ДанныеДляРазбора) = 31) тогда
		Результат = Новый Структура;
		Результат.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
		Результат.Вставить("КодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("НормализованныйКодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("ТипШтрихкода",Перечисления.ТипыШтрихкодов.DataMatrix);
		
		СоставКодаМаркировки	=	Новый Структура;
		СоставКодаМаркировки.Вставить("EAN", Сред(ДанныеДляРазбора,4,13));
		СоставКодаМаркировки.Вставить("GTIN", "010"+СоставКодаМаркировки.EAN);
		СоставКодаМаркировки.Вставить("МРЦ", "0");
		СоставКодаМаркировки.Вставить("МРЦСтрокой", Сред(ДанныеДляРазбора,30,2));
		СоставКодаМаркировки.Вставить("СерийныйНомер", Сред(ДанныеДляРазбора,17,13));
		
		Результат.Вставить("СоставКодаМаркировки",СоставКодаМаркировки);

	КонецЕсли;
	
	//Костыль для мак баррен 2024-06-06
	Если Результат = Неопределено и ( СтрДлина(ДанныеДляРазбора) = 32 или  СтрДлина(ДанныеДляРазбора) = 33) тогда
		Результат = Новый Структура;
		Результат.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
		Результат.Вставить("КодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("НормализованныйКодМаркировки", ДанныеДляРазбора);
		Результат.Вставить("ТипШтрихкода",Перечисления.ТипыШтрихкодов.DataMatrix);
		
		СоставКодаМаркировки	=	Новый Структура;
		СоставКодаМаркировки.Вставить("EAN", Сред(ДанныеДляРазбора,4,13));
		СоставКодаМаркировки.Вставить("GTIN", "010"+СоставКодаМаркировки.EAN);
		СоставКодаМаркировки.Вставить("МРЦ", "0");
		СоставКодаМаркировки.Вставить("МРЦСтрокой", "AAAA");
		СоставКодаМаркировки.Вставить("СерийныйНомер", Сред(ДанныеДляРазбора,17,13));
		
		Результат.Вставить("СоставКодаМаркировки",СоставКодаМаркировки);

	КонецЕсли;

	
	
	
	Возврат Результат;
КонецФункции
