
&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
&После("ОбновитьОстаткиНоменклатурыВДереве")
Процедура ТБКОбновитьОстаткиНоменклатурыВДереве()
	// Вставить содержимое метода.
	ДеревоЗначений    = ДанныеФормыВЗначение(ДеревоВыбора, Тип("ДеревоЗначений")); 
	ДеревоЗначений.Строки.Сортировать("Остаток Убыв", Истина); 
	
	тт = ДеревоВыбора.ПолучитьЭлементы();
	тт.Очистить(); 

	Для Каждого узел из  ДеревоЗначений.Строки Цикл
		ЗаполнитьЗначенияСвойств(тт.Добавить(), узел);
	КонецЦикла;
	//ЗначениеВДанныеФормы(ДеревоВыбора, ДеревоЗначений); 
	
КонецПроцедуры
