
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период	= ТекущаяДата();
	ЗаполнитьПланы();
КонецПроцедуры

Процедура ЗаполнитьПланы()
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	|	ТБК_ПланыМагазинаПоПериодам.ПериодС КАК ПериодС,
	|	ТБК_ПланыМагазинаПоПериодам.ПериодПо КАК ПериодПо,
	|	ТБК_ПланыМагазинаПоПериодам.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ТБК_ПланыМагазинаПоПериодам КАК ТБК_ПланыМагазинаПоПериодам
	|ГДЕ
	|	(ТБК_ПланыМагазинаПоПериодам.ПериодС = НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
	|			ИЛИ КОНЕЦПЕРИОДА(ТБК_ПланыМагазинаПоПериодам.ПериодПо, ДЕНЬ) = КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ))");
	
	
	Запрос.УстановитьПараметр("ТекущаяДата", Период);
	
	ТЗ_ПланФакт	= Новый ТаблицаЗначений;
	ТЗ_ПланФакт.Колонки.Добавить("ПериодС");
	ТЗ_ПланФакт.Колонки.Добавить("ПериодПо");
	ТЗ_ПланФакт.Колонки.Добавить("План");
	ТЗ_ПланФакт.Колонки.Добавить("Факт");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СуммаПлан = Выборка.Сумма;
		СуммаФакт_ВМТ = ПолучитьДанныеСуммаФакт_ВМТ(Выборка.ПериодС, Выборка.ПериодПо);
		
		СтрокаПланФакт = ТЗ_ПланФакт.Добавить();
		СтрокаПланФакт.ПериодС = Выборка.ПериодС;
		СтрокаПланФакт.ПериодПо = Выборка.ПериодПо;
		СтрокаПланФакт.План = Выборка.Сумма;
		СтрокаПланФакт.Факт = СуммаФакт_ВМТ;
		
	КонецЦикла;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	// день
	НазваниеДиаграммы	= "ДеньНовыйГод";
	НДиаг1         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг1.Заголовок	= "Новый год день";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг1);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	
	ДиагДень 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ПоказателиЗаДень);		
	ДиагДень.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	ДиагДень.ПутьКДанным			= НазваниеДиаграммы;
	ДиагДень.ЦветТекстаЗаголовка	= WebЦвета.Синий;
	
	НДиаг1	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг1.Серии.Добавить("ТекущаяПремия");
	
	// месяц
	НазваниеДиаграммы	= "МесяцНовыйГод";
	НДиаг2         		= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);
	НДиаг2.Заголовок	= "Новый год месяц";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НДиаг2);  	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	
	ДиагМесяц 						= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.ПоказателиЗаМесяц);		
	ДиагМесяц.Вид					= ВидПоляФормы.ПолеДиаграммы; 
	ДиагМесяц.ПутьКДанным			= НазваниеДиаграммы;
	ДиагМесяц.ЦветТекстаЗаголовка	= WebЦвета.Синий;
	
	НДиаг2	=	ЭтаФорма[НазваниеДиаграммы];
	НДиаг2.Серии.Добавить("ТекущаяПремия");

	
	// расчет на один день
	ТекущаяДата = Период;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТБК_ПланыМагазинаПоПериодам.ПериодС КАК ПериодС,
	|	ТБК_ПланыМагазинаПоПериодам.ПериодПо КАК ПериодПо,
	|	ТБК_ПланыМагазинаПоПериодам.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.ТБК_ПланыМагазинаПоПериодам КАК ТБК_ПланыМагазинаПоПериодам
	|ГДЕ
	|	ТБК_ПланыМагазинаПоПериодам.ПериодС <= &ТекущаяДата
	|	И ТБК_ПланыМагазинаПоПериодам.ПериодПо > &ТекущаяДата";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПланСегодня = 0;
	
	Если Выборка.Следующий() Тогда
		КоличествоДней	=	Число(Сред(КонецМесяца(ТекущаяДата), 1, 2));
		ПланСегодня		=	Окр(Выборка.Сумма /  КоличествоДней,0)
	КонецЕсли;
	
	СуммаФакт_Сегодня = ПолучитьДанныеСуммаФакт_ВМТ(НачалоДня(ТекущаяДата), НачалоДня(ТекущаяДата));
	
	ТочкаПлан 	 	= НДиаг1.УстановитьТочку("План на сегодня ");	 
	
	ТочкаПлан.ПриоритетЦвета	= Истина;  	
	ТочкаПлан.Цвет 			= WebЦвета.КоролевскиГолубой; 	
	
	НДиаг1.УстановитьЗначение(ТочкаПлан
	, НДиаг1.Серии[0]
	, ПланСегодня
	, Неопределено
	, "План на сегодня " + ПланСегодня);  	
	
	
	ТочкаФакт 	 	= НДиаг1.УстановитьТочку("Факт на сегодня");	 
	
	ТочкаФакт.ПриоритетЦвета	= Истина;  	
	ТочкаФакт.Цвет 			= WebЦвета.БледноКрасноФиолетовый; 	
	
	НДиаг1.УстановитьЗначение(ТочкаФакт
	, НДиаг1.Серии[0]
	, СуммаФакт_Сегодня
	, Неопределено
	, "Факт на сегодня " + СуммаФакт_Сегодня);

	МаксимальноеЗначениеДень = Макс(ПланСегодня, СуммаФакт_Сегодня); 
	
	МаксимальноеЗначениеМесяц = 0;
	
	Для каждого СтрокаПланФакт Из ТЗ_ПланФакт Цикл
		
		ПериодС = Формат(СтрокаПланФакт.ПериодС, "ДФ='d MMMM '");
		ПериодС_Число = Формат(СтрокаПланФакт.ПериодС, "ДФ=д");
		ПериодПо = Формат(СтрокаПланФакт.ПериодПо, "ДФ='d MMMM '");
		
		ТочкаПлан 	 	= НДиаг2.УстановитьТочку("План с " + ПериодС_Число + " по " + ПериодПо);	 
		
		ТочкаПлан.ПриоритетЦвета	= Истина;  	
		ТочкаПлан.Цвет 			= WebЦвета.КоролевскиГолубой; 	
		
		НДиаг2.УстановитьЗначение(ТочкаПлан
		, НДиаг2.Серии[0]
		, СтрокаПланФакт.План
		, Неопределено
		, "План " + СтрокаПланФакт.План);  	
		
		
		ТочкаФакт 	 	= НДиаг2.УстановитьТочку("Факт с " + ПериодС_Число + " по " + ПериодПо);	 
		
		ТочкаФакт.ПриоритетЦвета	= Истина;  	
		ТочкаФакт.Цвет 			= WebЦвета.БледноКрасноФиолетовый; 	
		
		НДиаг2.УстановитьЗначение(ТочкаФакт
		, НДиаг2.Серии[0]
		, СтрокаПланФакт.Факт
		, Неопределено
		, "Факт " + СтрокаПланФакт.Факт);
		
		МаксимальноеЗначениеМесяц	= Макс(МаксимальноеЗначениеМесяц, Макс(СтрокаПланФакт.План, СтрокаПланФакт.Факт)); 
		
	КонецЦикла;	
	
	НДиаг1.ОтображатьЛегенду		=   Ложь;	 		
	НДиаг1.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг1.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг1.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг1.МинимальноеЗначение		=	0; 	
	НДиаг1.МаксимальноеЗначение		=	МаксимальноеЗначениеДень * 1.2; 	
	НДиаг1.ОсьЗначений.СпособОпределенияМинимальногоЗначения	=	 СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	НДиаг2.ОтображатьЛегенду		=   Ложь;	 		
	НДиаг2.ВидПодписей				=	ВидПодписейКДиаграмме.Значение;
	НДиаг2.АвтоМаксимальноеЗначение	=	Ложь;
	НДиаг2.АвтоМинимальноеЗначение	=	Ложь;
	НДиаг2.МинимальноеЗначение		=	0; 	
	НДиаг2.МаксимальноеЗначение		=	МаксимальноеЗначениеМесяц * 1.2; 	
	НДиаг2.ОсьЗначений.СпособОпределенияМинимальногоЗначения	=	 СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	ДиагДень.Высота						=	8;
	ДиагДень.Ширина						= 	50;
	
	ДиагМесяц.Высота					=	8;
	ДиагМесяц.Ширина					= 	80; 
	
КонецПроцедуры

// Толстоухов 22.09.2025 ++
Функция ПолучитьДанныеСуммаФакт_ВМТ(ПериодС, ПериодПо)
	
	НоменклатураИсключения	=	Новый СписокЗначений;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТБКОкладыПремииИПроцентыНоваяМотивация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТБКОкладыПремииИПроцентыНоваяМотивация КАК ТБКОкладыПремииИПроцентыНоваяМотивация
	|ГДЕ
	|	ТБКОкладыПремииИПроцентыНоваяМотивация.Период <= &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТБКОкладыПремииИПроцентыНоваяМотивация.Период УБЫВ"); 
	Запрос.УстановитьПараметр("Период", ПериодС);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Для каждого Строка Из Рез.Ссылка.ГруппыИсключений Цикл
			НоменклатураИсключения.Добавить(Строка.Номенклатура);	
		КонецЦикла; 
	КонецЦикла;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	|					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	|				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	|			КОНЕЦ), 0) КАК СуммаЧеки
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|ГДЕ
	|	ЧекККМТовары.Ссылка.Проведен
	|	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	|			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	|	И НЕ ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&НоменклатураИсключения)
	|	И НЕ(ЧекККМТовары.Ссылка.Комментарий ПОДОБНО &Комментарий
	|				ИЛИ ЧекККМТовары.Ссылка.Комментарий ПОДОБНО &Комментарий1)");
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодС));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодПо)); 
	
	Запрос.УстановитьПараметр("НоменклатураИсключения",НоменклатураИсключения.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
	Запрос.УстановитьПараметр("Комментарий", "Чек н.ф.");
	Запрос.УстановитьПараметр("Комментарий1", "Добавлен в ООРП");
	
	Рез1 = Запрос.Выполнить().Выбрать();
	
	Если Рез1.Следующий() тогда    
		СуммаФакт_ВМТ =	Рез1.СуммаЧеки;	
	иначе    
		СуммаФакт_ВМТ = 0; 
	КонецЕсли;
	
	Возврат СуммаФакт_ВМТ;
	
КонецФункции

Процедура УдалитьРеквизиты()
	
	УдаляемыеРеквизиты = Новый Массив;
	
	Для каждого элемент из ЭтаФорма.ПолучитьРеквизиты() цикл
		Если (Найти(элемент.Имя, "ДеньНовыйГод") или Найти(элемент.Имя, "МесяцНовыйГод")) Тогда
			УдаляемыеРеквизиты.Добавить(элемент.Имя);  	
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(,УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УдалитьРеквизиты();
	ЗаполнитьПланы();
КонецПроцедуры

