
&Вместо("ПроверитьДанныеГосИС")
Процедура ТБКПроверитьДанныеГосИС(ТаблицаТоваров, ТаблицаНедостающихМарок, ДанныеГосИСДостаточны, ДокументОбъект, ОсобыйВыводСообщения, ТекстПолногоСообщения, ПроверятьМарки)
	// Вставить содержимое метода.
	Если ТекущаяДата() >= ИнтеграцияМОТПВызовСервера.ДатаОбязательнойМаркировкиТабачнойПродукции() Тогда                 
		ПродолжитьВызов(ТаблицаТоваров, ТаблицаНедостающихМарок, ДанныеГосИСДостаточны, ДокументОбъект, ОсобыйВыводСообщения, ТекстПолногоСообщения, ПроверятьМарки);
	КонецЕсли;
КонецПроцедуры
