
//&Вместо("ОбработатьДанныеШтрихкода")
//Функция ТБКОбработатьДанныеШтрихкода(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор)
//	// Вставить содержимое метода.
//	Результат = ПродолжитьВызов(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор);
//	
//	Если СтрНачинаетсяС(Результат.ТекстОшибки,"ИНН владельца:") Тогда
//		//ТекстОшибки	"ИНН владельца: 3443033593 "	Строка
//		Сообщить(Результат.ТекстОшибки);
//		Результат.ТекстОшибки = "";
//	КонецЕсли;
//	тмп = ПолучитьИзВременногоХранилища(Результат.АдресДанныхШтрихкода);
//	тмп.Характеристика = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьХарактеристику(тмп.Номенклатура,тмп.МРЦ);
//	ПоместитьВоВременноеХранилище(тмп,Результат.АдресДанныхШтрихкода);
//	Возврат Результат;
//КонецФункции

//&Вместо("ОбработатьШтрихкоды")
//Функция ТБКОбработатьШтрихкоды(СписокШтрихкодов, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор)
//	// Вставить содержимое метода.
//	Результат = ПродолжитьВызов(СписокШтрихкодов, ПараметрыСканирования, КэшированныеЗначения, УникальныйИдентификатор);
//	Возврат Результат;
//КонецФункции
