
&Вместо("ЭтоКодМаркировкиТабачнойПачки")
Функция ТБКЭтоКодМаркировкиТабачнойПачки(КодМаркировки, EAN, МРЦ)
	//Костыль для воды 2023-06-15
	Если СтрДлина(КодМаркировки) = 31 тогда
		EAN	=	Сред(КодМаркировки,4,13);
		Возврат истина;
	КонецЕсли;
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак");
	ВидУпаковки  = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская");
	
	РезультатРазбора = ШтрихкодированиеИСВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если РезультатРазбора = Неопределено Или РезультатРазбора.ВидУпаковки <> ВидУпаковки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставКодаМаркировки = РезультатРазбора.СоставКодаМаркировки;
	
	EAN = СоставКодаМаркировки.EAN;
	
	Если СоставКодаМаркировки.Свойство("МРЦ") И ЗначениеЗаполнено(СоставКодаМаркировки.МРЦ) Тогда
		МРЦ = СоставКодаМаркировки.МРЦ;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции
