Функция ПроверитьВозможностьРедактирования_Общая() экспорт
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

Функция ПолучитьПроктиWStbk() Экспорт 

	Возврат ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");	

КонецФункции // ()

Функция ПолучитьПрокси(Пароль="", Пользователь = "", Адрес = "", Таймаут = 60, НеВыводитьошибку = Ложь) Экспорт
	
	ТекстОшибки = "";
	ИмяСервиса = "tbk"; 
	ИмяСервисаСоап = "tbkSoap";
	
	
	Попытка                                 
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль, Таймаут);
	Исключение			
		Если не НеВыводитьошибку тогда
			Сообщить(ОписаниеОшибки());
		КонецЕсли;
		Возврат Неопределено; 
	КонецПопытки;
	
	URI =  "http://www.1c.ru/SaaS/1.0/WS";
	Прокси = Новый WSПрокси(Определения, URI, ИмяСервиса, ИмяСервисаСоап);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	Возврат Прокси; 
	
КонецФункции

Функция ПроверитьЧекНаНаличиеСкидок(ЧекККМПродажаОснование) экспорт
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	КомментарииСтатистики.Наименование КАК Наименование
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.КомментарииСтатистики КАК КомментарииСтатистики
	      	 	             |ГДЕ
	      	 	             |	КомментарииСтатистики.Наименование Подобно &Наименование");
	Запрос.УстановитьПараметр("Наименование","%"+ЧекККМПродажаОснование.Номер+"%");
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции

Функция УдалитьЛидирующиеНули(НужнаяСтрока) Экспорт
	
	Если ТипЗнч(НужнаяСтрока) <> Тип("Строка") Тогда
		Возврат НужнаяСтрока;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НужнаяСтрока) Тогда
		Возврат НужнаяСтрока;
	КонецЕсли; 
	

	НомерПервойЦифры = 0;
	Для а = 1 По СтрДлина(НужнаяСтрока) Цикл
		НомерПервойЦифры = НомерПервойЦифры + 1;
		КодСимвола = КодСимвола(Сред(НужнаяСтрока, а, 1));
		Если КодСимвола <> 48 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	НужнаяСтрока = Сред(НужнаяСтрока, НомерПервойЦифры);

	Возврат НужнаяСтрока;  	
КонецФункции

Функция ЭтоМаркированнаяНоменклатураСервер(Номенклатура) экспорт
	возврат Найти(Номенклатура.ВидНоменклатуры.Наименование,"Табак (х)") или Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;	
КонецФункции

Функция EmailValid(Адрес) Экспорт

    //Адрес = "test@me@gmail.narod.am";

    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";

    Цифры = "0123456789";

    //ищем крайний справа символ @ для правильного выделения локальной и доменной части

    ИндексСобаки = Найти(Адрес,"@");

    //1. строка адреса вообще не содержит разделителя

    Если ИндексСобаки = 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);

    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл

        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");

        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);

    КонецЦикла;

    ДоменнаяЧасть = Сред(Адрес, ИндексСобаки+1);

    ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);

    //2. Проверяем длину локальной части

    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //3. Проверяем длину доменной части

    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."

    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд

    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки

    Если Лев(ДоменнаяЧасть, 1) = "." Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд

    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда

        Возврат ЛОЖЬ;

    КонецЕсли;

    //8. Проверка частей доменной части

    //каждая часть начинается с буквы и заканчивается буквой или цифрой

    //каждая часть длиной не более 63 символов

    ИдентификаторыДоменнойЧасти = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");

    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл

        Если СтрДлина(ИдентификаторДомена) > 63 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0

            //для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)

            И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0

            Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда

            Возврат ЛОЖЬ;

        КонецЕсли;

    КонецЦикла;



    //Все проверки пройдены - радуемся

    Возврат ИСТИНА;

КонецФункции

Функция ОткрытьНужнуюИнструкцию(НазваниеИнструкции) экспорт  		
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_Инструкции.СсылкаНаФайл КАК СсылкаНаФайл
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБК_Инструкции КАК ТБК_Инструкции
	      	 	             |ГДЕ
	      	 	             |	ТБК_Инструкции.Наименование ПОДОБНО &Наименование");   
	Запрос.УстановитьПараметр("Наименование","%" + НазваниеИнструкции + "%"); 
	
	// Толстоухов 23.01.2026 HR-10 ++
	// сделал, чтобы открывались сразу две инструкции
	
	//Рез = Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() тогда 
	//	ЗапуститьПриложение(Рез.СсылкаНаФайл);
	//иначе
	//	Сообщить("Не найдена инструкция: " + НазваниеИнструкции);
	//КонецЕсли;
	
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Рез = Результат.Выбрать();
		Пока Рез.Следующий() Цикл
			ЗапуститьПриложение(Рез.СсылкаНаФайл);
		КонецЦикла;
	Иначе	
		Сообщить("Не найдена инструкция: " + НазваниеИнструкции);
	КонецЕсли; 
	
	// Толстоухов 23.01.2026 --	
	
КонецФункции 

Функция ПолучитьТекущегоПродавца() экспорт
	текущийПользователь = Пользователи.ТекущийПользователь();
	Возврат текущийПользователь.ФизическоеЛицо;
КонецФункции

Функция  ПолучитьЦветФонаКонпки() экспорт
	Возврат ЦветаСтиля.ЦветФонаКнопки;
КонецФункции

//Марк
Функция ПолучитьНоменклатураБК(Номенклатура) Экспорт
	Возврат Справочники.Номенклатура.НайтиПоНаименованию("" + СокрЛП(Номенклатура) + " БК");   	
КонецФункции // ()
//конецМарк

//Вик 2023-09-13
Процедура ЗаписатьВЛог(ТекстСообщения) экспорт
	СтрокаСоединенияСБД =  СтрокаСоединенияИнформационнойБазы();
	ПутьКБД 			= Сред(СтрокаСоединенияСБД, 7, СтрДлина(СтрокаСоединенияСБД) -8);
	Каталог = Новый Файл(ПутьКБД);
	
	ТекстСообщения	=	Строка(ТекущаяДата()) + ": " + ТекстСообщения;

	Если Каталог.Существует() Тогда
		ПутьКФайлу	=	ПутьКБД + "\tbk_log.txt";
		Файл_Лога = Новый Файл(ПутьКФайлу);
		
		Если не Файл_Лога.Существует() Тогда  			
			док = Новый ТекстовыйДокумент();
			док.УстановитьТекст(ТекстСообщения);
			док.Записать(ПутьКФайлу, "windows-1251");
		иначе

			Текст = Новый ЗаписьТекста(ПутьКФайлу, "windows-1251",,Истина);
			Текст.ЗаписатьСтроку(Символы.ПС+Символы.ПС+ТекстСообщения);
			Текст.Закрыть();

		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

Функция Установить_ЗначениеКонстанты_Общая(имяКонстанты, значениеКонстанты)экспорт
	запись = РегистрыСведений.ТБК_Константы.СоздатьМенеджерЗаписи();
	
	запись.ИмяКонстанты = имяКонстанты;
	запись.ЗначениеКонстанты = значениеКонстанты; 
	запись.Записать(Истина);
КонецФункции

Функция ПолучитьЦенуНоменклатуры(Номенклатура) экспорт
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ДействующиеЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	      	 	             |	ДействующиеЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ДействующиеЦеныНоменклатурыСрезПоследних");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() Тогда
		Возврат Результат[Результат.Количество() - 1].цена;	
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;
 	
КонецФункции

Функция ПолучитьРеальнуюНоменклатуруДляБК(Номенклатура) экспорт
	Возврат	Справочники.Номенклатура.НайтиПоНаименованию(СтрЗаменить(Номенклатура.Наименование, " БК",""));	
КонецФункции

Функция ПолучитьНоменклатуруПоКуару(Данные) экспорт
	ШК						 = Данные; 
	ШтрихкодEAN				 = ШтрихкодированиеИС.ТБКEANИзКодаМаркировки(Данные);  
 
	Если не ЗначениеЗаполнено(ШтрихкодEAN) тогда
		//ШтрихкодEAN	=	ПолучитьЕАН(СканированныйШК_Копия);
		
		Если лев(ШК,3) = "010" тогда
			ШК = Сред(СокрЛП(ШК),4);
		КонецЕсли;
		
		Если лев(ШК,5) = "00000" тогда
			флЭтоЕан8	=	Истина;
		иначе
			флЭтоЕан8	=	ложь;
		КонецЕсли;
		
		ШК  = ОбщегоНазначенияВызовСервера.УдалитьЛидирующиеНули(ШК);
		
		ШК	= лев(ШК,13);
		
		Если флЭтоЕан8 тогда
			ШК	= лев(ШК,8);
		иначе
			Попытка
				ФФФ	=	Число(ШК);
			Исключение
				ШК = Лев("0" + ШК, 13);
			КонецПопытки;
		КонецЕсли;
		
		ШтрихкодEAN = ШК;
	КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	Штрихкоды.Владелец КАК Владелец,
	      	 	             |	Штрихкоды.Упаковка КАК Упаковка
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.Штрихкоды КАК Штрихкоды
	      	 	             |ГДЕ
	      	 	             |	Штрихкоды.Штрихкод = &Штрихкод"); 
	Запрос.УстановитьПараметр("Штрихкод",ШтрихкодEAN); 
	рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда     
		Запрос.УстановитьПараметр("Штрихкод","0"+ШтрихкодEAN);	
		рез = Запрос.Выполнить().Выгрузить();

		Если Рез.Количество() = 0 тогда  
			Запрос.УстановитьПараметр("Штрихкод","00000"+ШтрихкодEAN);	
			рез = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Рез[0].Владелец; 

КонецФункции

Функция ПолучитьКоличествоВУпаковкеПоКуару(Данные) экспорт
	ШК						 = Данные; 
	ШтрихкодEAN				 = ШтрихкодированиеИС.ТБКEANИзКодаМаркировки(Данные);  
 
	Если не ЗначениеЗаполнено(ШтрихкодEAN) тогда
		//ШтрихкодEAN	=	ПолучитьЕАН(СканированныйШК_Копия);
		
		Если лев(ШК,3) = "010" тогда
			ШК = Сред(СокрЛП(ШК),4);
		КонецЕсли;
		
		Если лев(ШК,5) = "00000" тогда
			флЭтоЕан8	=	Истина;
		иначе
			флЭтоЕан8	=	ложь;
		КонецЕсли;
		
		ШК  = ОбщегоНазначенияВызовСервера.УдалитьЛидирующиеНули(ШК);
		
		ШК	= лев(ШК,13);
		
		Если флЭтоЕан8 тогда
			ШК	= лев(ШК,8);
		иначе
			Попытка
				ФФФ	=	Число(ШК);
			Исключение
				ШК = Лев("0" + ШК, 13);
			КонецПопытки;
		КонецЕсли;
		
		ШтрихкодEAN = ШК;
	КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	Штрихкоды.Владелец КАК Владелец,
	      	 	             |	Штрихкоды.Упаковка КАК Упаковка,
	      	 	             |	Штрихкоды.Упаковка.Коэффициент КАК УпаковкаКоэффициент
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.Штрихкоды КАК Штрихкоды
	      	 	             |ГДЕ
	      	 	             |	Штрихкоды.Штрихкод = &Штрихкод"); 
	Запрос.УстановитьПараметр("Штрихкод",ШтрихкодEAN); 
	рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда     
		Запрос.УстановитьПараметр("Штрихкод","0"+ШтрихкодEAN);	
		рез = Запрос.Выполнить().Выгрузить();

		Если Рез.Количество() = 0 тогда  
			Запрос.УстановитьПараметр("Штрихкод","00000"+ШтрихкодEAN);	
			рез = Запрос.Выполнить().Выгрузить();   
		КонецЕсли;
	КонецЕсли;
	
	Если Рез.Количество() = 0 тогда
		возврат 1;
	иначе
		Возврат Рез[0].УпаковкаКоэффициент; 
	КонецЕсли;

КонецФункции

Процедура  ПроставитьПризнакиМаркировкиЕслиНужно(НоменклатураИзКуара) экспорт 
    флНадоЗаписать	=	Ложь;  
	ВидТабак			= Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Табак");
	ОсобенностьУчета	= Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
	
	Если НоменклатураИзКуара.ОсобенностьУчета <> ОсобенностьУчета тогда  
		флНадоЗаписать = Истина;
	КонецЕсли; 	
		
	Если НоменклатураИзКуара.ВидНоменклатуры <> ВидТабак тогда  
		флНадоЗаписать = Истина;
	КонецЕсли;  
	
	Если флНадоЗаписать тогда
		Об = НоменклатураИзКуара.ПолучитьОбъект();
		Об.ВидНоменклатуры	=	ВидТабак;  
		Об.ОсобенностьУчета	=	ОсобенностьУчета;
		Об.Записать();	
		
		планы = ПланыОбмена.ОбменРозницаУправлениеТорговлей103.Выбрать();
		Пока планы.Следующий() Цикл
			Если планы.НомерПринятого > 0 Тогда  
				ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Номенклатура);    
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

Функция ПолучитьКоличествоЧеков(ДатаНач = Неопределено, ДатаКон = Неопределено, Продавец = Неопределено) экспорт
	СтруктураОтвета	=	Новый Структура;
	СтруктураОтвета.Вставить("КолЧеков",0);
	СтруктураОтвета.Вставить("КолЧековЛояльность",0);
	СтруктураОтвета.Вставить("КолЧековСНачалаМесяца",0);
	СтруктураОтвета.Вставить("КолЧековЛояльностьСНачалаМесяца",0);
	
	Если ДатаНач = Неопределено тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		      	 	             |	КассоваяСмена.Дата КАК Дата
		      	 	             |ИЗ
		      	 	             |	Документ.КассоваяСмена КАК КассоваяСмена
		      	 	             |ГДЕ
		      	 	             |	КассоваяСмена.Проведен
		      	 	             |	И КассоваяСмена.Статус = &Статус
		      	 	             |	И КассоваяСмена.Дата >= &Дата
		      	 	             |	И НЕ КассоваяСмена.КассаККМ.ПометкаУдаления
		      	 	             |
		      	 	             |УПОРЯДОЧИТЬ ПО
		      	 	             |	Дата");
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКассовойСмены.Открыта); 
		Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 24*60*60 );

		Рез = Запрос.Выполнить().Выбрать();
		
		
		Если Рез.Следующий() тогда
			НужДатаНач = Рез.Дата;	
			НужДатаКон = ТекущаяДата();	
		КонецЕсли; 
	иначе
		НужДатаНач = ДатаНач;	
		НужДатаКон = ДатаКон;			
	КонецЕсли;
	Запрос	=	Новый Запрос();
	Запрос.Текст			= "ВЫБРАТЬ
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМТовары.Ссылка) КАК КолЧеков
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ЧекККМТовары.Ссылка.ВидОперации = &ВидОперации
	      	 	             |	И ЧекККМТовары.Ссылка.СтатусЧекаККМ <> &СтатусЧекаККМ" +?(ЗначениеЗаполнено(Продавец)," 
	      	 	             |	И (ЧекККМТовары.Продавец = &Продавец
	      	 	             |			ИЛИ ЧекККМТовары.Продавец1 = &Продавец
	      	 	             |			ИЛИ ЧекККМТовары.Продавец2 = &Продавец)","");	
	
	Запрос.УстановитьПараметр("ДатаНач", 		НужДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", 		НужДатаКон);
	Запрос.УстановитьПараметр("СтатусЧекаККМ", 	Перечисления.СтатусыЧековККМ.Аннулированный);
	Запрос.УстановитьПараметр("ВидОперации", 	Перечисления.ВидыОперацийЧекККМ.Продажа);
	Запрос.УстановитьПараметр("Продавец", 		Продавец);
		
	Рез1	=	Запрос.Выполнить().Выбрать();
	
	Если Рез1.Следующий() тогда
		СтруктураОтвета.КолЧеков	=	Рез1.КолЧеков;
	КонецЕсли;
	
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТБК_ИсторияПокупокРозница.Чек) КАК КолЧековЛояльность
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ИсторияПокупокРозница КАК ТБК_ИсторияПокупокРозница
	      	 	             |ГДЕ
	      	 	             |	ТБК_ИсторияПокупокРозница.ВидОперации = &ВидОперации
	      	 	             |	И ТБК_ИсторияПокупокРозница.Чек.Проведен
	      	 	             |	И ТБК_ИсторияПокупокРозница.Чек.Дата МЕЖДУ &ДатаНач И &ДатаКон" +?(ЗначениеЗаполнено(Продавец),"
	      	 	             |	И (ТБК_ИсторияПокупокРозница.Чек.Товары.Продавец = &Продавец
	      	 	             |			ИЛИ ТБК_ИсторияПокупокРозница.Чек.Товары.Продавец1 = &Продавец
	      	 	             |			ИЛИ ТБК_ИсторияПокупокРозница.Чек.Товары.Продавец2 = &Продавец)",""));	
	Запрос.УстановитьПараметр("ДатаНач", 		НужДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", 		НужДатаКон); 
	Запрос.УстановитьПараметр("ВидОперации", 	"Продажа");
	Запрос.УстановитьПараметр("Продавец", 		Продавец);
	
	
	Рез1	=	Запрос.Выполнить().Выбрать();
	
	Если Рез1.Следующий() тогда
		СтруктураОтвета.КолЧековЛояльность	=	Рез1.КолЧековЛояльность;
	КонецЕсли;

	
	Возврат СтруктураОтвета;	
КонецФункции

Функция ПолучитьКоличествоКассККМ() экспорт
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КассыККМ.Ссылка), 0) КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.КассыККМ КАК КассыККМ
	      	 	             |ГДЕ
	      	 	             |	НЕ КассыККМ.ПометкаУдаления");	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		Возврат Рез.Ссылка;
	иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьИННОрганизацииПоМагазину(Магазин) экспорт  
	
	Если ЗначениеЗаполнено(Магазин.Организация) тогда
		Возврат Магазин.Организация.ИНН;
	иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСписок_НашиОрганизацииИНН() экспорт
	Прокси = ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl", 10); 
	
	Если Прокси = Неопределено тогда 
		Сообщить("Ошибка подключения к УТ");
		Возврат 0; 
	КонецЕсли;
	
	Ответ	= Прокси.get_org_inn();
	
	ОтветJSOON = ОбщегоНазначения.jsonВСтруктура_Общая(Ответ);
	
	СЗ = Новый СписокЗначений;
	
	Для каждого Значение Из ОтветJSOON Цикл
		
		СЗ.Добавить(Значение.ИНН);		
	КонецЦикла; 
		
	Прокси	=	Неопределено;

	Возврат СЗ;	

КонецФункции

Функция ПолучитьСистемуНалогообложенияСрезПоследнихПоПервойОгранизации() Экспорт

	Запрос = Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПрименениеСистемНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	                      |ИЗ
	                      |	РегистрСведений.ПрименениеСистемНалогообложения.СрезПоследних(
	                      |			,
	                      |			Организация В
	                      |				(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |					Организации.Ссылка КАК Ссылка
	                      |				ИЗ
	                      |					Справочник.Организации КАК Организации
	                      |				ГДЕ
	                      |					НЕ Организации.ПометкаУдаления)) КАК ПрименениеСистемНалогообложенияСрезПоследних
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПрименениеСистемНалогообложенияСрезПоследних.Период УБЫВ");
	
	ВыборкаСистемНалогообложения = Запрос.Выполнить().Выбрать();
			
	Если ВыборкаСистемНалогообложения.Следующий() Тогда 
		
		Если ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход  
			или ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			Возврат "УСН доход-расход";       
		ИначеЕсли ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда
			Возврат "ОСН";
		ИначеЕсли ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД Тогда
			Возврат "ЕНВД";
		ИначеЕсли ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент Тогда
			Возврат "Патент";
		ИначеЕсли ВыборкаСистемНалогообложения.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН Тогда
			Возврат "ЕСН";
		КонецЕсли;
		Возврат Строка(ВыборкаСистемНалогообложения.СистемаНалогообложения);
		
	иначе
		Возврат Неопределено;                                                            
	КонецЕсли;

КонецФункции // ()

Функция jsonВСтруктура_Общая(json) Экспорт 

	Возврат ОбщегоНазначения.jsonВСтруктура_Общая(json);	

КонецФункции // ()

Процедура ДобавитьДанныеШтрихкодаК_ТБК_ЗапросДанныхУ_УТ(ШК) Экспорт 
	
	Рег = РегистрыСведений.ТБК_ЗапросДанныхУ_УТ.СоздатьМенеджерЗаписи();
	Рег.Данные = ШК;
	Рег.ТипДанных = "Штрихкод";
	Рег.Записать();
	
КонецПроцедуры  


// Данная функция предназначена для извлечения номенклатуры из данных сканирования, таких как штрихкоды. 
// Она выполняет предобработку данных, определяет тип штрихкода (EAN-13 или EAN-8), 
// ищет соответствующую номенклатуру в регистрах сведений "Штрихкоды" и "ТБК_Штрихкоды"
// В случае неудачи поиска, функция добавляет данные штрихкода и возвращает Неопределено.
//
// Параметры:
//  ДанныеСканирования  - Строка - Штрихкод или QR
// Возвращаемое значение:
//   Номенклатура.Ссылка
Функция ПолучитьНоменклатуруИзДанныхСканирования(ДанныеСканирования, АвтоматическиПодгружатьНоменклатуру = Ложь) Экспорт
	
	ПроверяемыеДанные = ДанныеСканирования;
	ПроверяемыеДанные = СтрЗаменитьПоРегулярномуВыражению(ПроверяемыеДанные, "^[010]+",		""); //ублираем слева 001
	ПроверяемыеДанные = СтрЗаменитьПоРегулярномуВыражению(ПроверяемыеДанные, "^[(01)]+", 	""); //ублираем слева (01)
	ПроверяемыеДанные = СтрЗаменитьПоРегулярномуВыражению(ПроверяемыеДанные, "^[0]+", 		""); //ублираем слева все нули
	
	ПроверяемыйШК = Неопределено;
	// Ищем EAN-13: 13 цифр с начала строки
	Если СтрДлина(ПроверяемыеДанные) >= 13 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(ПроверяемыеДанные, 13)) Тогда
		ПроверяемыйШК = Лев(ПроверяемыеДанные, 13);
		// Ищем EAN-8: 8 цифр с начала строки
	ИначеЕсли СтрДлина(ПроверяемыеДанные) >= 8 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(ПроверяемыеДанные, 8)) Тогда
		ПроверяемыйШК = Лев(ПроверяемыеДанные, 8);
	КонецЕсли;
	
	Если ПроверяемыйШК = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	Штрихкоды.Владелец КАК Номенклатура
	//                      |ИЗ
	//                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
	//                      |ГДЕ
	//                      |	Штрихкоды.Штрихкод В(&ВариантыШтрихкодов)
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТБК_Штрихкоды.Владелец
	//                      |ИЗ
	//                      |	РегистрСведений.ТБК_Штрихкоды КАК ТБК_Штрихкоды
	//                      |ГДЕ
	//                      |	ТБК_Штрихкоды.Штрихкод В(&ВариантыШтрихкодов)");  
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Штрихкоды.Владелец КАК Номенклатура
		                      |ИЗ
		                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
		                      |ГДЕ
		                      |	Штрихкоды.Штрихкод В(&ВариантыШтрихкодов)");	
	МассивВаринтовШК = Новый Массив;
	МассивВаринтовШК.Добавить(ПроверяемыйШК);
	МассивВаринтовШК.Добавить("0" + ПроверяемыйШК);
	МассивВаринтовШК.Добавить("00" + ПроверяемыйШК);
	МассивВаринтовШК.Добавить("000" + ПроверяемыйШК);
	МассивВаринтовШК.Добавить("0000" + ПроверяемыйШК);
	МассивВаринтовШК.Добавить("00000" + ПроверяемыйШК);
	МассивВаринтовШК.Добавить("000000" + ПроверяемыйШК);
	Запрос.УстановитьПараметр("ВариантыШтрихкодов", МассивВаринтовШК);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Если Выборка.Следующий() Тогда			
		Возврат Выборка.Номенклатура;
	иначе   
		//Вик 2025-06-26
		Если АвтоматическиПодгружатьНоменклатуру тогда  
			Номенклатура = Неопределено;
			
			Попытка
				ЗагрузитьНоменклатуру_ИзНовойУТ(ПроверяемыйШК);  
				
				Номенклатура = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруИзДанныхСканирования(ДанныеСканирования);  
			Исключение
			КонецПопытки;
			
			Если Номенклатура <> Неопределено тогда   
				Возврат Номенклатура;
			иначе 
				
				ДобавитьДанныеШтрихкодаК_ТБК_ЗапросДанныхУ_УТ(ПроверяемыйШК);
				Возврат Неопределено;    			
			КонецЕсли;   		
		иначе
			
			ДобавитьДанныеШтрихкодаК_ТБК_ЗапросДанныхУ_УТ(ПроверяемыйШК);
			Возврат Неопределено; 			
		КонецЕсли;			
		//   
	КонецЕсли; 

КонецФункции // ()

Функция ЗагрузитьНоменклатуру_ИзНовойУТ(ПроверяемыйШК) экспорт  

	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/trade/ws/tbk?wsdl");
	
	Данные	=	Прокси.get_nomenklat(ПроверяемыйШК);

    Прокси = Неопределено;   
	
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ОбработкаОбмена.РежимОбмена = "Загрузка";
	ОбработкаОбмена.ВыводВОкноСообщенийИнформационныхСообщений	= Ложь;
	ОбработкаОбмена.ВыводВПротоколИнформационныхСообщений		= Ложь;
	ОбработкаОбмена.ВыводВПротоколСообщенийОбОшибках			= Ложь;

	
	РаботаВозможна = ОбработкаОбмена.ВыполнитьДействияПередЧтениемДанных(Данные.Получить());
	
	Если НЕ РаботаВозможна Тогда
		Сообщить("Ошибка обмена данных!");
	КонецЕсли;	

	ОбработкаОбмена.ПроизвестиЧтениеДанных(ТекстОшибки);
	
	ОбработкаОбмена.ВыполнитьДействияПослеЗавершенияЧтенияДанных();
	
КонецФункции

Функция ПолучитьИнкасациюЗаСегодня() Экспорт 
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКИнкасация.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ТБКИнкасация КАК ТБКИнкасация
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБКИнкасация.ПометкаУдаления
	      	 	             |	И ТБКИнкасация.Дата МЕЖДУ &ДатаНач И &ДатаКон");
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()) ); 
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()) );
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если рез.Следующий() тогда
		Возврат рез.Ссылка;	
	КонецЕсли;

КонецФункции

Функция ОтправитьСообщениеВТелеграмм(Токен, ИДПолучателя, Текст) экспорт
	АПИ		=	"api.telegram.org";
	
	Приемник = "bot" + Токен + "/sendMessage?chat_id=" + ИДПолучателя + "&text=" + Текст  ;
	HTTPСоединение  =  Новый HTTPСоединение(АПИ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(Приемник);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос); 
	
КонецФункции


#Область VKTeams

Процедура ОтправитьФайлВVKTeams(АдресСервера, Порт, ТБ, ФорматФайла, NameFile = "document") Экспорт

    // Сохраняем во временный файл
    ИмяФайла = ПолучитьИмяВременногоФайла(ФорматФайла);
    Если ФорматФайла = ".xlsx" Тогда
		ТБ.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	//ИначеЕсли ФорматФайла = ".pdf" Тогда
	//    ТБ.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
    КонецЕсли;

    // Читаем файл и кодируем в Base64
    ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
    Base64Строка = Base64Строка(ДвоичныеДанные);
    // Убираем переносы строк которые добавляет 1С
    Base64Строка = СтрЗаменить(Base64Строка, Символы.ПС, "");
    Base64Строка = СтрЗаменить(Base64Строка, Символы.ВК, "");

    // Формируем JSON
    ПолноеИмяФайла = NameFile + ФорматФайла;
    Тело = "{""filename"": """ + ПолноеИмяФайла + """, ""file_b64"": """ + Base64Строка + """, ""caption"": """ + NameFile + """}";

    // Отправляем на бота
    HTTPСоединение = Новый HTTPСоединение(АдресСервера, Порт);
    HTTPЗапрос = Новый HTTPЗапрос("/notify/file/b64");
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
    HTTPЗапрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);

    Попытка
        ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        Сообщить("Ответ: " + ОтветHTTP.ПолучитьТелоКакСтроку());
    Исключение
        Сообщить("Ошибка: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура SendMessageВVKTeams(Порт, message) Экспорт
	
	АдресСервера = "192.168.1.34";
	
    Тело = "{""message"": """ + message + """}";

    // Отправляем на бота
    HTTPСоединение = Новый HTTPСоединение(АдресСервера, Порт);
    HTTPЗапрос = Новый HTTPЗапрос("/notify");
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
    HTTPЗапрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);

    Попытка
        ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        Сообщить("Ответ: " + ОтветHTTP.ПолучитьТелоКакСтроку());
    Исключение
        Сообщить("Ошибка: " + ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти



Процедура УстановитьНастройки_ПоштучнаяПродажа(Номенклатура) Экспорт 
	
	ВидНоменклатурыОбъект	=	Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Сигары, сигариллы"); 
	
	Если ВидНоменклатурыОбъект.Пустая() тогда
		ВидНоменклатурыОбъект	=	Справочники.ВидыНоменклатуры.СоздатьЭлемент(); 
		
		ВидНоменклатурыОбъект.Заполнить(Неопределено);
		ВидНоменклатурыОбъект.УстановитьНовыйКод();
		
		ВидНоменклатурыОбъект.Наименование		=	"Сигары, сигариллы"; 
		ВидНоменклатурыОбъект.ТипНоменклатуры	=	Перечисления.ТипыНоменклатуры.Товар;		
		ВидНоменклатурыОбъект.ПризнакПредметаРасчета = Справочники.ПризнакиПредметовРасчета.Товар;
		
		ОсобенностьУчетаНоменклатуры	=	Перечисления.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак;
		
		ВидНоменклатурыОбъект.ОсобенностьУчета = ОсобенностьУчетаНоменклатуры;
		ВидНоменклатурыОбъект.ПризнакПредметаРасчета = Справочники.ПризнакиПредметовРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ;
		
		ВидНоменклатурыОбъект.ИспользованиеХарактеристик              = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать;
		ВидНоменклатурыОбъект.ИспользоватьХарактеристики              = Ложь;
		
		ВидНоменклатурыОбъект.Записать();
			
	КонецЕсли;
	
	Если Номенклатура.ВидНоменклатуры <> ВидНоменклатурыОбъект.Ссылка тогда  
		
		Об = Номенклатура.ПолучитьОбъект();
		
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	УпаковкиНоменклатуры.Ссылка КАК Ссылка,
		      	 	             |	УпаковкиНоменклатуры.Коэффициент КАК Коэффициент
		      	 	             |ИЗ
		      	 	             |	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		      	 	             |ГДЕ
		      	 	             |	УпаковкиНоменклатуры.Владелец = &Владелец
		      	 	             |	И УпаковкиНоменклатуры.Коэффициент > 1
		      	 	             |	И НЕ УпаковкиНоменклатуры.ПометкаУдаления
		      	 	             |	И УпаковкиНоменклатуры.Наименование ПОДОБНО ""%упак%""");  
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);   
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Количество() = 1 тогда
			рез.Следующий();
			
			НачатьТранзакцию();
			
			Об.ВидНоменклатуры	=	ВидНоменклатурыОбъект.Ссылка; 		
			Об.НаборУпаковок	=	Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры;	
			
			Об.ТипНоменклатуры	=	Об.ВидНоменклатуры.ТипНоменклатуры;
			Об.ОсобенностьУчета	=	Об.ВидНоменклатуры.ОсобенностьУчета; 
			Об.Записать();
			
			Рег = РегистрыСведений.ОписаниеНоменклатурыИС.СоздатьМенеджерЗаписи();
			Рег.Номенклатура							=	Об.Ссылка;
			Рег.ЕмкостьПотребительскойУпаковки			=	Рез.Коэффициент;
			Рег.КоличествоВПотребительскойУпаковке		=	Рез.Коэффициент;
			Рег.ВариантЧастичногоВыбытия				=	Перечисления.ВариантыУчетаЧастичногоВыбытияИС.ТекущаяНоменклатура;
			Рег.ВариантИспользованияЕдиницыХранения		=	Перечисления.ВариантыИспользованияЕдиницыХраненияИС.ЗаданУпаковками;
			
			Рег.ПотребительскаяУпаковка		=	Рез.Ссылка;
			Рег.УпаковкаЧастичногоВыбытия	=	Об.Ссылка.ЕдиницаИзмерения;
			
			
			Рег.Записать();	 
			
			ЗафиксироватьТранзакцию(); 
		КонецЕсли;
	КонецЕсли;   
	
	
КонецПроцедуры // ()

Процедура ЗафиксироватьАктивнойПользователя(Событие, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.ТБКАктивностьПользователя.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.Дата = Дата;
	Запись.Событие = Событие;
    Запись.Записать();
	
КонецПроцедуры

Функция ИННОрганизации(Организация) Экспорт

	Возврат Организация.ИНН;			

КонецФункции

Функция ЭтуМаркуБитьПоБК(Номенклатура) Экспорт	

	Если ЗначениеЗаполнено(Номенклатура) тогда
		ПК = Номенклатура.ПолныйКод();
	иначе
		Возврат Ложь;
	КонецЕсли;
	
	//Марк 2024-11-19
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПробиватьПоБК.Дата КАК Дата
	                      |ИЗ
	                      |	РегистрСведений.ПробиватьПоБК КАК ПробиватьПоБК
	                      |ГДЕ
	                      |	ПробиватьПоБК.НоменклатурнаяГруппа.Код В(&Код)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Массив_ПК = СтрРазделить(ПК, "/");
	Запрос.УстановитьПараметр("Код", Массив_ПК);

	ВыборкаБитьПоБК = запрос.Выполнить().Выбрать();
	
	Если ВыборкаБитьПоБК.Следующий() Тогда
		
		Если ТекущаяДата() >= ВыборкаБитьПоБК.Дата Тогда
			Возврат Истина;	
		КонецЕсли;	
		
	КонецЕсли;
	//КонецМарк
	
	Возврат Ложь;
	
КонецФункции

Процедура _ЗаписьЖурналаРегистрации(ТекстКомментария) Экспорт 

	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Информация,,,ТекстКомментария);

КонецПроцедуры
