Функция ПроверитьВозможностьРедактирования_Общая() экспорт
	Возврат Найти(нрег(Пользователи.АвторизованныйПользователь().Наименование),"админ");	
КонецФункции

Функция ПолучитьПрокси(Пароль="", Пользователь = "", Адрес = "") Экспорт
	
	ТекстОшибки = "";
	ИмяСервиса = "tbk"; 
	ИмяСервисаСоап = "tbkSoap";
	
	Попытка                                 
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль, 60);
	Исключение      
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	URI =  "http://www.1c.ru/SaaS/1.0/WS";
	Прокси = Новый WSПрокси(Определения, URI, ИмяСервиса, ИмяСервисаСоап);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	Возврат Прокси;   	
КонецФункции
