Функция ПроверитьВозможностьРедактирования_Общая() экспорт
	Возврат Найти(нрег(Пользователи.АвторизованныйПользователь().Наименование),"админ");	
КонецФункции

Функция ПолучитьПрокси(Пароль="", Пользователь = "", Адрес = "") Экспорт
	
	ТекстОшибки = "";
	ИмяСервиса = "tbk"; 
	ИмяСервисаСоап = "tbkSoap";
	
	Попытка                                 
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль, 60);
	Исключение      
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	URI =  "http://www.1c.ru/SaaS/1.0/WS";
	Прокси = Новый WSПрокси(Определения, URI, ИмяСервиса, ИмяСервисаСоап);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	Возврат Прокси;   	
КонецФункции

Функция ПроверитьЧекНаНаличиеСкидок(ЧекККМПродажаОснование) экспорт
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	КомментарииСтатистики.Наименование КАК Наименование
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.КомментарииСтатистики КАК КомментарииСтатистики
	      	 	             |ГДЕ
	      	 	             |	КомментарииСтатистики.Наименование Подобно &Наименование");
	Запрос.УстановитьПараметр("Наименование","%"+ЧекККМПродажаОснование.Номер+"%");
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции
