Процедура ЗаполнитьОстаткиНоменклатурыБезУчетаХарактеристик(Объект, ИмяТабличнойЧасти, ДатаПоследнегоИнвента = '00010101') Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Склад
	|ПОМЕСТИТЬ ТаблицаВЗапрос
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ТоварыНаСкладахОстатки.РезервОстаток КАК ОстатокБезРезерва
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			(Номенклатура,  Склад) В
	|				(ВЫБРАТЬ
	|					ТаблицаВЗапрос.Номенклатура,
	|					ТаблицаВЗапрос.Склад
	|				ИЗ
	|					ТаблицаВЗапрос КАК ТаблицаВЗапрос)) КАК ТоварыНаСкладахОстатки";
	
	ТаблицаНоменклатуры = Объект[ИмяТабличнойЧасти].Выгрузить();
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	ТаблицаОстатков = Результат.Выгрузить();
	
	СтруктураПоиска = Новый Структура;
	МассивОстатков = Новый Массив;
	
	Для каждого СтрокаТаблицыНоменклатуры Из Объект[ИмяТабличнойЧасти] Цикл
		Если не СтрокаТаблицыНоменклатуры.ХарактеристикиИспользуются тогда
	
			СтруктураПоиска.Вставить("Номенклатура"  , СтрокаТаблицыНоменклатуры.Номенклатура);
			СтруктураПоиска.Вставить("Склад"         , СтрокаТаблицыНоменклатуры.Склад);
			
			МассивСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() > 0  Тогда
				СтрокаТаблицыНоменклатуры.Остаток = МассивСтрок[0].ОстатокБезРезерва;
				МассивСтрок[0].ОстатокБезРезерва = МассивСтрок[0].ОстатокБезРезерва - СтрокаТаблицыНоменклатуры.Количество;
			Иначе
				СтрокаТаблицыНоменклатуры.Остаток = 0;
			КонецЕсли;  		
		КонецЕсли;	 
					
		//Вик 2023-05-31
		Если ЗначениеЗаполнено(ДатаПоследнегоИнвента) тогда
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
			      	 	             |ИЗ
			      	 	             |	РегистрНакопления.Продажи.Обороты(&ДатаНач, , , Номенклатура = &Номенклатура) КАК ПродажиОбороты");
			Запрос.УстановитьПараметр("ДатаНач", ДатаПоследнегоИнвента);
			Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицыНоменклатуры.Номенклатура); 
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				СтрокаТаблицыНоменклатуры.Продано = Рез.КоличествоОборот; 
			иначе
				СтрокаТаблицыНоменклатуры.Продано = 0; 
            КонецЕсли;
		КонецЕсли;
		//   

	КонецЦикла;
	
КонецПроцедуры
