
&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	//Марк 2025-01-25
	//исправление <Объект не найден> +++ 
	Для каждого Строка Из Товары Цикл 
		
		Если НЕ Строка.Номенклатура.Пустая() И Найти(Строка(Строка.Номенклатура), "<Объект не найден>") Тогда
			Если Строка.Номенклатура.ПолучитьОбъект() = Неопределено Тогда
				рег = РегистрыСведений.ТБК_ЗапросДанныхУ_УТ.СоздатьМенеджерЗаписи();
				рег.Данные = ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Номенклатура), Неопределено).GUID;
				рег.ТипДанных = "Ссылка";
				рег.Записать(); 	
			КонецЕсли;
		КонецЕсли;  
		
		Если НЕ Строка.Характеристика.Пустая() И Найти(Строка(Строка.Характеристика), "<Объект не найден>") Тогда
			Если Строка.Характеристика.ПолучитьОбъект() = Неопределено Тогда
				рег = РегистрыСведений.ТБК_ЗапросДанныхУ_УТ.СоздатьМенеджерЗаписи();
				рег.Данные = ОбщегоНазначения.РасшифровкаПредставленияБитойСсылки(Строка(Строка.Характеристика), Неопределено).GUID;
				рег.ТипДанных = "Ссылка";
				рег.Записать();
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	//КонецМарк
	
КонецПроцедуры
