
&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	Если Найти(Комментарий, "Смена ИП") Тогда
		
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		      	 	             |ГДЕ
		      	 	             |	ПриходныйОрдерНаТовары.Проведен
		      	 	             |	И ПриходныйОрдерНаТовары.ДокументОснование = &ДокументОснование");
		Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		Если не Запрос.Выполнить().Пустой() тогда
			//Сообщить("Товар уже принят!",СтатусСообщения.Важное);	
			Возврат;
		КонецЕсли;
		
		Попытка
			ЗаписатьДанныеПоПеремещению(Ссылка,Новый ХранилищеЗначения(Товары.Выгрузить()));	
			//Об = Ссылка.ПолучитьОбъект();
			//Об.КоличествоПакетовФакт = КоличествоПакетовФакт;
			//Об.Комментарий = Комментарий;
			//Об.Записать(РежимЗаписиДокумента.Проведение);
		Исключение   
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		//Ордер
		НовыйДокументПОНТ = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		НовыйДокументПОНТ.Заполнить(Ссылка);
		
		//Доп контроль количества
		Если НовыйДокументПОНТ.Товары.Количество() = 0 тогда
			//Сообщить("Нет товаров к поступлению! Возможно нужно перепровести перемещение.",СтатусСообщения.Важное);	
			Возврат;
		КонецЕсли;
		
		Если НовыйДокументПОНТ.Товары.Итог("Количество") <> Ссылка.Товары.Итог("Количество") тогда
			//Сообщить("Различаются количества товаров! Возможно нужно перепровести перемещение.",СтатусСообщения.Важное);	
			Возврат;
		КонецЕсли;
		
		НовыйДокументПОНТ.Дата = ТекущаяДата();
		НовыйДокументПОНТ.ДокументОснование = Ссылка;
		
		//Доп контроль цены
		Для каждого Строка из Ссылка.Товары цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",Строка.Номенклатура);
			Отбор.Вставить("Характеристика",Строка.Характеристика);
			Строки =   НовыйДокументПОНТ.Товары.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 тогда
				//Сообщить("Не найден товар! Возможно нужно перепровести перемещение.",СтатусСообщения.Важное);	
				Возврат; 
			иначеЕсли Строки[0].Цена <> Строка.Цена тогда
				Строки[0].Цена  = Строка.Цена;
				Строки[0].Сумма = Строки[0].Цена * Строки[0].Количество;
			КонецЕсли;			
		КонецЦикла;
		
		НовыйДокументПОНТ.Записать(РежимЗаписиДокумента.Проведение);
		
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ЗаписатьДанныеПоПеремещению(Ссылка,ХранЗнач)
	Рег = РегистрыСведений.СохраненныеДанныеПомощникаПриемкиОтгрузки.СоздатьНаборЗаписей();
	Рег.Отбор.ДокументРаспоряжение.Установить(Ссылка); 
	
	НоваяСтрока	=	Рег.Добавить();
	НоваяСтрока.ДокументРаспоряжение	=	Ссылка;
	НоваяСтрока.ТоварыПеремещение		=	ХранЗнач;
	
	Рег.Записать();	
	
КонецПроцедуры


