
&НаКлиенте
Процедура ГруппаСпискиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.заголовок = "Список эксп." Тогда
		
		ПрочитатьТабличныйДокумент("C:\app\database\manual\Временные\40. Список эксп..xlsx");
		
	ИначеЕсли ТекущаяСтраница.заголовок = "Допуск представителей сигареты" Тогда
		
		ПрочитатьТабличныйДокумент("C:\app\database\manual\Временные\39.Допуск представителей сигареты.xlsx");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ПрочитатьТабличныйДокумент(ИмяФайла)
	
	Попытка
		ТабличныйДокументЭксель.Прочитать(ИмяФайла);	
	Исключение
		
		ТабличныйДокументЭксель.Очистить();
		ТабличныйДокументЭксель.Область(2, 1).Текст = "файл не найден";
		ТабличныйДокументЭксель.Область(2, 1).Шрифт = Новый Шрифт(, , Истина);
		
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьТабличныйДокумент("C:\app\database\manual\Временные\40. Список эксп..xlsx");
КонецПроцедуры
