
//вхПараметры - структура
//	UserName - string
//  Password - string
Функция SetPassword(вхПараметры) ЭКСПОРТ
	ИмяПользователя = СокрЛП(вхПараметры.FullName);
	Пароль			= СокрЛП(вхПараметры.Password);

	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	
	Если Пользователь <> Неопределено Тогда
		Пользователь.Пароль	=	Пароль;
		Пользователь.Записать();
		
		результат = Истина;
	иначе
		сообщить("Не найден пользователь с именем: "+ИмяПользователя);
		результ = Ложь;;
	КонецЕсли;
	
	Возврат результат;
КонецФункции


//вхПараметры - структура
//	UserName - string
//  Password - string
//  FullName - string - Фамилия Имя Отчество
//  Birthdate - string - 20000101
Функция CreateUser(вхПараметры) ЭКСПОРТ

	Попытка
		Результат = Справочники.ФизическиеЛица.СоздатьПользователя(вхПараметры);
	Исключение
		Сообщить(ОписаниеОшибки());
		Результат =  Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции


//вхПараметры - структура
// Configuration - string (Release, Alpha, Gama)
Функция SetExtConfiguration(вхПараметры) ЭКСПОРТ
	
	config = вхПараметры.Configuration;
	
	РегистрыСведений.ТБК_Константы.Установить_РежимРаботыРасширения(config);
КонецФункции


Функция Run_exRetailOle(вхПараметры) ЭКСПОРТ
	имяФайла = "C:\app\database\exRetailOle.cmd"; 
	
	файл_cmd = Новый Файл(имяФайла);
	WshShell=Новый COMОбъект("WScript.Shell");
	WshShell.Run(имяФайла);
	
КонецФункции

Функция Run_apply_cfe(вхПараметры) ЭКСПОРТ
	
	фв = Новый файл("c:\app\database\Tabakon.version.loaded.txt");
	Если фв.Существует() Тогда
		УдалитьФайлы("c:\app\database\Tabakon.version.loaded.txt");
	КонецЕсли;
	
	имяФайла = "C:\app\database\apply_cfe.cmd"; 
	
	файл_cmd = Новый Файл(имяФайла);
	WshShell=Новый COMОбъект("WScript.Shell");
	WshShell.Run(имяФайла);
КонецФункции