
Функция remnants() 
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРозницеОстатки.Склад.Наименование КАК СкладНаименование,
	               |	ТоварыВРозницеОстатки.Склад.Код КАК СкладКод,
				   |	ТоварыВРозницеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыВРозницеОстатки.Номенклатура.Код КАК НоменклатураКод,
	               |	ЕСТЬNULL(ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	               |	ТоварыВРозницеОстатки.КоличествоОстаток,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ТипЦен.Наименование, """") КАК ТипЦенНаименование,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРознице.Остатки КАК ТоварыВРозницеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыВРозницеОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &типЦены)
	               |			И (НЕ ТоварыВРозницеОстатки.Номенклатура.ВестиУчетПоХарактеристикам
	               |				ИЛИ ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)";
				   
				   
	Результат = новый массив;
	макетСтруктуры = "СкладНаименование,СкладКод,НоменклатураУИ,НоменклатураКод,ХарактеристикаНоменклатурыНаименование,КоличествоОстаток,ТипЦенНаименование,Цена";
	
	типЦены = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("ec5b124a-ef8e-11e6-9ce5-0cc47aabb907"));
	Запрос.УстановитьПараметр("типЦены",типЦены);
	
	рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		нЗапись = Новый Структура(макетСтруктуры);
		ЗаполнитьЗначенияСвойств(нЗапись,рез);
		нЗапись.НоменклатураКод = рез.Номенклатура.УникальныйИдентификатор();
		
		Для каждого эл из нЗапись цикл
			если ТипЗнч(эл.Значение) <> Тип("Число") Тогда
				нЗапись[эл.Ключ]=строка(эл.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Результат.Добавить(нЗапись);
	КонецЦикла;	
	
	Возврат СтруктураВjson(Результат);
	
КонецФункции



Функция СтруктураВjson(Значение)

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли; 	
	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции