Перем СтрукураДанныхКонтрагента;
&НаКлиенте
Процедура ТБКСогласоватьПосле(Команда)
	Если Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Согласован") тогда
		Сообщить("Заказ уже согласован!");
		Возврат          	
	КонецЕсли;

	
	ТекстВопроса = НСтр("ru='Заказ полностью подготовлен?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ТБКСогласовать", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);   	


КонецПроцедуры

&НаКлиенте
Процедура ТБКСогласовать(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Статус							=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Согласован");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет
		Записать();
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТБКВыкуплен(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет
		Записать();
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТБКВыкупленПосле(Команда)
	ТекстВопроса = НСтр("ru='Заказ полностью выкуплен?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ТБКВыкуплен", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 

КонецПроцедуры


&НаКлиенте
Процедура ТБКОплатить(Команда)
	Если Модифицированность Тогда 
		Попытка
			ПараметрыЗаписи = Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись);
			Записать(ПараметрыЗаписи); 			
	Исключение
			ТекстСообщения = НСтр("ru = 'Документ невозможно записать'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;	
	
	ТекстВопроса = НСтр("ru='Перейти к оплате зкааза?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ПеренестиВРМК", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры


&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
	УстановитьВидимостьКнопок();
	
	Если не Объект.Ссылка.Пустая() Тогда
	
		Элементы.Магазин.ТолькоПросмотр					= Истина;
		Элементы.Продавец.ТолькоПросмотр				= Истина;
		Элементы.Склад.ТолькоПросмотр					= Истина;
		Элементы.Организация.ТолькоПросмотр				= Истина;
		Элементы.Ответственный.ТолькоПросмотр			= Истина;
		Элементы.ТелефонКлиента.ТолькоПросмотр			= Истина;
		Элементы.ИмяКлиента.ТолькоПросмотр				= Истина;
		Элементы.СписокТоваров.ТолькоПросмотр			= Истина;
		Элементы.Товары.ТолькоПросмотр					= Истина;
		Элементы.Комментарий.ТолькоПросмотр				= Истина;
		
	КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт") Тогда
	
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Согласовать.Доступность = Ложь;
	    Элементы.Выкуплен.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьКнопок()
	флМожноПробивать = ПроверитьМожноПробивать(Объект.Ссылка);
	
	Элементы.ФормаОплатить.Доступность   		=  флМожноПробивать; 
	
	Если не ОбщегоНазначенияВызовСервера.ПроверитьВозможностьРедактирования_Общая() тогда
		Элементы.Статус.ТолькоПросмотр	=	Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьМожноПробивать(Ссылка)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ЧекККМТовары.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.ЗаказПокупателя = &ЗаказПокупателя
	      	 	             |	И ЧекККМТовары.Ссылка.Проведен");
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка);
	
	Возврат Запрос.Выполнить().Пустой(); 
КонецФункции

&НаКлиенте
Процедура ТБКОтвязатьЧекПосле(Команда)
	Пароль = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения, Пароль, "Введите пароль: "); 
КонецПроцедуры

&НаКлиенте
Процедура ВводСтроки(ПолученноеЗначение, ПереданныеПараметры) Экспорт
	Если ПолученноеЗначение = "0000" тогда 
		ТБКОтвязатьЧекПослеНаСервере(Объект.Ссылка);
		УстановитьВидимостьКнопок();
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТБКОтвязатьЧекПослеНаСервере(Ссылка)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЧекККМТовары.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.ЗаказПокупателя = &ЗаказПокупателя
	      	 	             |	И ЧекККМТовары.Ссылка.Проведен");
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда
		Сообщить("К этому документу нет чеков!");
	КонецЕсли;
	
	Для каждого Строка из рез цикл
		Об = Строка.Ссылка.ПолучитьОбъект();
		Для каждого Строка из Об.товары цикл
			Строка.ЗаказПокупателя	=	Документы.ЗаказПокупателя.ПустаяСсылка();
		КонецЦикла;
			
		Об.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхИзРабочегоМеста",истина);
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);

		Сообщить("Выполнено успешно!");
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВРМК(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Элементы.ФормаОплатить.Доступность   = Ложь; 
		
		Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет 
		
		ОкнаПриложения = ПолучитьОкна();
		Для каждого ОкноПриложения Из ОкнаПриложения Цикл
			// Анализ заголовка окна
			//Закрываем окна с заказами
			Если Найти(ОкноПриложения.Заголовок,"Заказ") Тогда
				НайденнаяФорма = ОкноПриложения.Содержимое[0];
				НайденнаяФорма.Закрыть();
			КонецЕсли;
			
			
			Если ОкноПриложения.Заголовок = "" или ОкноПриложения.Заголовок = "*" Тогда
				НужныйСклад		 =	ПолучитьСклад();

				
				НайденнаяФорма = ОкноПриложения.Содержимое[0];
				НайденнаяФорма.Объект.Товары.очистить();
				
				НужныйСклад		 =	ПолучитьСклад();
				НужнаяОрг		 =	НайденнаяФорма.Объект.Организация;
				НужаяСНО		=	ПолучитьВидНалогаСервер(НужнаяОрг);
				Для каждого Строка из Объект.Товары цикл
					НоваяСтрока	=	НайденнаяФорма.Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
					НоваяСтрока.Склад			=	НужныйСклад;
					НоваяСтрока.Организация		=	НужнаяОрг;
					НоваяСтрока.ЗаказПокупателя	=	Объект.Ссылка;
					НоваяСтрока.СтавкаНДС		=	ПолучитьСтавкуБезНДС();
					НоваяСтрока.ВидНалога		=	НужаяСНО;
					Если ЭтоМаркированнаяНоменклатура(НоваяСтрока.Номенклатура) тогда
						НоваяСтрока.НеобходимостьВводаАкцизнойМарки	=	истина;
						НоваяСтрока.СтатусПроверкиГосИС 			= 2;
						НоваяСтрока.ВидПродукцииИС					= ПолучитьВидТабак();
						НоваяСтрока.МаркируемаяПродукция			= Истина;  
					КонецЕсли;
				КонецЦикла;
				
				НайденнаяФорма.Активизировать();
				Возврат;			
				
			КонецЕсли;
		КонецЦикла; 
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьСклад()
	Возврат ОбщегоНазначения.ПолучитьСкладИзООРП();
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоМаркированнаяНоменклатура(Номенклатура)
	возврат Найти(Номенклатура.ВидНоменклатуры.Наименование,"Табак (х)") или Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидТабак()
	Возврат Перечисления.ВидыПродукцииИС.Табачная;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавкуБезНДС()
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидНалогаСервер(НужнаяОрг)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПрименениеСистемНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ПрименениеСистемНалогообложения.СрезПоследних КАК ПрименениеСистемНалогообложенияСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПрименениеСистемНалогообложенияСрезПоследних.Организация = &Организация");
	Запрос.УстановитьПараметр("Организация",НужнаяОрг);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если рез.Количество() = 0 тогда
		Сообщить("Внимание! Не найдена система налогооблажения!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат рез[0].СистемаНалогообложения;
	
КонецФункции

&НаКлиенте
Процедура ТБКСтатусПриИзмененииПосле(Элемент)
	Объект.НаличиеНезарезервированныхСтрок 	= Истина;
КонецПроцедуры

//Марк 28.07.2023
&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ЭтотОбъект.ПриЗаписиПерепроводить = Ложь;

	объект.ЖелаемаяДатаПродажи = '00010101';
	Если Объект.Ссылка.Пустая() Тогда
	
		Объект.Статус = Перечисления.СтатусыЗаказовПокупателей.НеСогласован;
		Объект.НаличиеНезарезервированныхСтрок = Истина;
	
	КонецЕсли;
	Если НЕ Объект.Магазин.Пустая() Тогда

		Объект.Склад = объект.Магазин.СкладПродажи;
		Объект.Организация = Объект.Склад.Организация;
	
	КонецЕсли;
	
	Объект.Продавец = Объект.Ответственный.ФизическоеЛицо;
	
	Если Объект.КонтрагентТелефонЗначение <> "" Тогда
	
		СтруктураКонтрагентДанные = ОбщегоНазначения.jsonВСтруктура_Общая(Объект.КонтрагентТелефонЗначение);
		
		Если СтруктураКонтрагентДанные.Свойство("КлиентТелефон") Тогда
		
			ТелефонКлиента = СтруктураКонтрагентДанные.КлиентТелефон;
		
		КонецЕсли;
		Если СтруктураКонтрагентДанные.Свойство("КлиентИмя") Тогда
		
			ИмяКлиента = СтруктураКонтрагентДанные.КлиентИмя;
		
		КонецЕсли;
		Если СтруктураКонтрагентДанные.Свойство("КомментарийСписокТоваров") Тогда
		
			КомментарийСписокТоваров = СтруктураКонтрагентДанные.КомментарийСписокТоваров;
		
		КонецЕсли;
		
	
	КонецЕсли;


	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаРеквизитовДляЗаписи()
	
	Если  НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен склад!";
		Сообщение.Поле = "Склад";
		Сообщение.УстановитьДанные(Объект.Склад);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Магазин) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен магазин!";
		Сообщение.Поле = "Магазин";
		Сообщение.УстановитьДанные(Объект.Магазин);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена организация!";
		Сообщение.Поле = "Организация";
		Сообщение.УстановитьДанные(Объект.Организация);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли СтрДлина(СокрЛП(ТелефонКлиента)) <> 12 Тогда			
		ПроверкаТелефона(ТелефонКлиента);			
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(ИмяКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено имя клиента!";
		Сообщение.Поле = "ИмяКлиента";
		Сообщение.УстановитьДанные(ИмяКлиента);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(КомментарийСписокТоваров) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните список товаров!";
		Сообщение.Поле = "КомментарийСписокТоваров";
		Сообщение.УстановитьДанные(КомментарийСписокТоваров);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Продавец) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен продавец!";
		Сообщение.Поле = "Продавец";
		Сообщение.УстановитьДанные(Объект.Продавец);
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТБКЗаписатьИЗакрытьПосле(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТБКТелефонКлиентаПриИзмененииПосле(Элемент)	
	ПроверкаТелефона(ТелефонКлиента);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТелефона(ТелефонКлиента)

	Если СтрДлина(СокрЛП(ТелефонКлиента)) <> 12 тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Номер должен быть 12 символов. Вы ввели: "+СтрДлина(СокрЛП(ТелефонКлиента)) + "  символов. Номер телефона: "+СокрЛП(ТелефонКлиента);
		Сообщение.Поле = "ТелефонКлиента";
		Сообщение.УстановитьДанные(ТелефонКлиента);
		Сообщение.Сообщить();
		Возврат
	КонецЕсли;
	
	Для Ном = 2 по СтрДлина(ТелефонКлиента) цикл
		Символ	=	Сред(ТелефонКлиента,Ном,1);	
		КодСимвола	=	КодСимвола(Символ);
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В номере телефона есть недопустимые символы. Сотрите номер и введите заново";
			Сообщение.Поле = "ТелефонКлиента";
			Сообщение.УстановитьДанные(ТелефонКлиента);
			Сообщение.Сообщить();
			Возврат
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры 

&НаСервере
Процедура ТБКПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СтрукураДанныхКонтрагента = Новый Структура();
	Если НЕ Отказ И СтрукураДанныхКонтрагента <> Тип("Структура") Тогда
	
		СтрукураДанныхКонтрагента.Вставить("КлиентИмя", 				Строка(ИмяКлиента));
		СтрукураДанныхКонтрагента.Вставить("КлиентТелефон", 			Строка(ТелефонКлиента));
		СтрукураДанныхКонтрагента.Вставить("КомментарийСписокТоваров", 	Строка(КомментарийСписокТоваров));
		
		JS = ОбщегоНазначения.СтруктураВjson_Общая(СтрукураДанныхКонтрагента);
		ТекущийОбъект.КонтрагентТелефонЗначение = JS;
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&Вместо("ОбновитьСостоянияЗаказаПокупателя")
Процедура ТБКОбновитьСостоянияЗаказаПокупателя()
	// Вставить содержимое метода.
	//ПродолжитьВызов();
КонецПроцедуры


&НаКлиенте
Процедура ТБКПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
	
		Отказ = ПроверкаРеквизитовДляЗаписи();

	КонецЕсли;
	
КонецПроцедуры
//КонецМарк
