
&НаКлиенте
Процедура ТБКПослеЗаписиПосле(ПараметрыЗаписи)
	ТБКПослеЗаписиПослеСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ТБКПослеЗаписиПослеСервере(ТекущийОбъект)
	Если ТекущийОбъект.ВидНоменклатуры.ОсобенностьУчета  = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция Тогда 
		ОбщегоНазначенияВызовСервера.ЗаполнитьВидПродукцииГИСМТ(ТекущийОбъект, "Табачная продукция");
	КонецЕсли; 
	// Толстоухов 29.10.2026 KRO-205 ++
	Если ТекущийОбъект.ВидНоменклатуры.ОсобенностьУчета  = Перечисления.ОсобенностиУчетаНоменклатуры.АльтернативныйТабак Тогда 
		ОбщегоНазначенияВызовСервера.УстановитьНастройки_ПоштучнаяПродажа(ТекущийОбъект);
	КонецЕсли;
	// Толстоухов 29.10.2026 --
КонецПроцедуры



