
&НаКлиенте
Процедура Обновить(Команда)
	ЗапросКУТ();
КонецПроцедуры

&НаСервере
Процедура ЗапросКУТ()
	
	Если Адрес_ВебСоединение  = "" Тогда
		Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
		
		Массив	=	Новый Массив;
		Массив.Добавить(Прокси);
		
		Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
	иначе
		
		Попытка
			Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
			Прокси	=	Массив[0]; 
			
			Если Прокси = Неопределено Тогда//повторное подключение
				Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
				
				Массив	=	Новый Массив;    					
				Массив.Добавить(Прокси);
				
				Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
				
			КонецЕсли;
		Исключение
			Сообщить("Не удалось подключиться к УТ. Попробуйте выполнить действие позже.");
		КонецПопытки;
		
	КонецЕсли;
	
	
	Если Прокси <> Неопределено Тогда
		
		НужСклад	= СокрЛП(Строка(ОбщегоНазначения.ПолучитьСкладИзООРП()));
		
		Структура = Новый Структура;
		
		Структура.Вставить("Магазин", 	            Строка(НужСклад));
		Структура.Вставить("ПолучитьДанные", 	    Ложь); 
		
		JS = ОбщегоНазначения.СтруктураВjson_Общая(Структура);
		
		//1. Проставляем замены
		Ответ	=	Прокси.get_households(JS);
		Если ЗначениеЗаполнено(Ответ) Тогда
			Если не Найти(Ответ,"Внимание!") Тогда 
				
				ОтветМассив	=	ОбщегоНазначения.jsonВСтруктура_Общая(Ответ);//В массив
				ТаблицаЗначений = ИнтеграцияИС.МассивВТаблицуЗначений(ОтветМассив);
				НомСч	=	0;
				
				Для каждого СтрокаМассива из ОтветМассив Цикл //добавляем
					
					СтрокаДанныеУТ = Нормативы.Добавить();
					СтрокаДанныеУТ.Номенклатура = СтрокаМассива.ТипХозТовара;
					СтрокаДанныеУТ.Количество = СтрокаМассива.Количество;
				КонецЦикла; 
			Иначе
				Сообщить(Ответ); 				
			КонецЕсли;
		КонецЕсли;
	Иначе
		Сообщить("Не удалось получить данные. Попоробуйте позже");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	НайденныеСтроки = Прочее.НайтиСтроки(Новый Структура("Количество", 0));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Сообщить("ВНИМАНИЕ! Пустое количество в табличной части Прочее: " + НайденныеСтроки.Количество());
		Возврат;
	КонецЕсли;	
	
	Если Нормативы.Количество() = 0 И Прочее.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПоХозЗаявке();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТБК_ДанныеПоХозТоварам.Период КАК Период
	|ИЗ
	|	РегистрСведений.ТБК_ДанныеПоХозТоварам КАК ТБК_ДанныеПоХозТоварам
	|ГДЕ
	|	ТБК_ДанныеПоХозТоварам.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И ТБК_ДанныеПоХозТоварам.Отправлен = ИСТИНА";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Сообщить("Данные уже отправлены в этом месяце");
		Элементы.ДанныеОбновить.Доступность = Ложь;
		Элементы.ДанныеОтправить.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗапросКУТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимВыбора", Истина);
    ПараметрыФормы.Вставить("ИдентификаторФомыВладельца", УникальныйИдентификатор);
	
	Обработчик = Новый ОписаниеОповещения("ДобавитьНоменклатуруЗавершение", ЭтотОбъект);

    ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ТБК_ХозНужды_ПодборНоменклатуры", ПараметрыФормы, ЭтотОбъект,,,,Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруЗавершение(Данные, ДополнительныеДанные) Экспорт
	ПозицияНоменклатуры = Прочее.Добавить();
	ПозицияНоменклатуры.Номенклатура = Данные;
КонецПроцедуры

Процедура ЗаписатьДанныеПоХозЗаявке()
	
	Магазин = СокрЛП(Строка(ОбщегоНазначения.ПолучитьСкладИзООРП()));
	Продавец = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТБК_ДанныеПоХозТоварам.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ТБК_ДанныеПоХозТоварам КАК ТБК_ДанныеПоХозТоварам
	               |ГДЕ
	               |	ТБК_ДанныеПоХозТоварам.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	               |	И ТБК_ДанныеПоХозТоварам.Отправлен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТБК_ДанныеПоХозТоварам.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ТБК_ДанныеПоХозТоварам КАК ТБК_ДанныеПоХозТоварам
	               |ГДЕ
	               |	ТБК_ДанныеПоХозТоварам.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	               |	И ТБК_ДанныеПоХозТоварам.Отправлен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата()));
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	Если Не РезультатПакет[0].Пустой() Тогда
		Сообщить("Данные уже отправлены в этом месяце");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатПакет[1].Выбрать();
		
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи = РегистрыСведений.ТБК_ДанныеПоХозТоварам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.Отправлен = Ложь; // исходное значение для поиска
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Отправлен = Ложь;
			МенеджерЗаписи.Продавец = Продавец;
			МенеджерЗаписи.Нормативы = Новый ХранилищеЗначения(Нормативы.Выгрузить());
			МенеджерЗаписи.Прочее = Новый ХранилищеЗначения(Прочее.Выгрузить());
			МенеджерЗаписи.Записать();
			//Сообщить("Изменена запись за " + Выборка.Период);
		КонецЕсли;
	Иначе	
		МенеджерЗаписи = РегистрыСведений.ТБК_ДанныеПоХозТоварам.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Магазин = Магазин;
		МенеджерЗаписи.Продавец = Продавец;
		МенеджерЗаписи.Нормативы = Новый ХранилищеЗначения(Нормативы.Выгрузить());
		МенеджерЗаписи.Прочее = Новый ХранилищеЗначения(Прочее.Выгрузить());
		МенеджерЗаписи.Период = ТекущаяДата();
		
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура тест(Команда)
	тестНаСервере();
КонецПроцедуры


&НаСервере
Процедура тестНаСервере()
	
	ТекущаяДата = ТекущаяДата();
	НомерДня = День(ТекущаяДата);
	Если Не (НомерДня > 20 И НомерДня <= 28) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТБК_ДанныеПоХозТоварам.Период КАК Период,
	               |	ТБК_ДанныеПоХозТоварам.Отправлен КАК Отправлен,
	               |	ТБК_ДанныеПоХозТоварам.Нормативы КАК Нормативы,
	               |	ТБК_ДанныеПоХозТоварам.Прочее КАК Прочее,
	               |	ТБК_ДанныеПоХозТоварам.Продавец КАК Продавец,
	               |	ТБК_ДанныеПоХозТоварам.Магазин КАК Магазин
	               |ИЗ
	               |	РегистрСведений.ТБК_ДанныеПоХозТоварам КАК ТБК_ДанныеПоХозТоварам
	               |ГДЕ
	               |	ТБК_ДанныеПоХозТоварам.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	               |	И ТБК_ДанныеПоХозТоварам.Отправлен = ЛОЖЬ";

	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Адрес_ВебСоединение  = "" тогда
			Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
			
			Массив	=	Новый Массив;
			Массив.Добавить(Прокси);
			
			Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
		Иначе
			
			Попытка
				Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
				Прокси	=	Массив[0]; 
				
				Если Прокси = Неопределено тогда//повторное подключение
					Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
					
					Массив	=	новый Массив;    					
					Массив.Добавить(Прокси);
					
					Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
					
				КонецЕсли;
			Исключение
				Сообщить("Не удалось подключиться к УТ. Попробуйте выполнить действие позже.");
			КонецПопытки;
			
		КонецЕсли;
		
		
		Если Прокси <> Неопределено Тогда
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Магазин", 	            Строка(Выборка.Магазин));
			СтруктураДанных.Вставить("ПолучитьДанные", 	        Истина);
			СтруктураДанных.Вставить("Продавец", 	            Строка(Выборка.Продавец)); 
			
			ФактическийОстаток = Новый Массив;
			СтруктураДанных.Вставить("ФактическийОстаток", ФактическийОстаток);
			
			ДанныеНормативы	=	Выборка.Нормативы.Получить(); 
			
			Для каждого Строка из ДанныеНормативы Цикл		
				
				ХозТовары = Новый Структура;
				
				ХозТовары.Вставить("ТипХозТоваров", Строка(Строка.Номенклатура));
				ХозТовары.Вставить("Количество", Строка.ФактическийОстаток);
				
				ФактическийОстаток.Добавить(ХозТовары);
				
			КонецЦикла;
			
			МассивПрочее = Новый Массив;
			СтруктураДанных.Вставить("Прочее", МассивПрочее);
			
			ДанныеПрочее	=	Выборка.Прочее.Получить(); 
			
			Для каждого Строка из ДанныеПрочее Цикл		
				
				ЗапросХозТовары = Новый Структура;
				
				ЗапросХозТовары.Вставить("Номенклатура", Строка(Строка.Номенклатура));
				ЗапросХозТовары.Вставить("Количество", Строка.Количество);
				
				МассивПрочее.Добавить(ЗапросХозТовары);
				
			КонецЦикла;
			
			JS = ОбщегоНазначения.СтруктураВjson_Общая(СтруктураДанных);
			
			Ответ	=	Прокси.get_households(JS);
			Если Ответ = "true" Тогда
				Сообщить("Данные отправлены в офис");
				
				МенеджерЗаписи = РегистрыСведений.ТБК_ДанныеПоХозТоварам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = Выборка.Период;
				МенеджерЗаписи.Отправлен = Ложь; 				
				МенеджерЗаписи.Прочитать();
				
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.Отправлен = Истина;
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			Иначе
				Сообщить("Не удалось отправить данные. Попоробуйте позже");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

