
&НаКлиенте
&Вместо("НастроитьПредставление")
Процедура ТБКНастроитьПредставление()
	
	ПараметрыПроверки     = ПараметрыПроверкиСредствамиККТ;
	
	//Марк 2025-03-20 сдесть проверять что отправляется в ккт
	Если ПараметрыПроверки.ЭлементыПроверки[0].КодМаркировки = "(01)04012922851628(21)tWwWj7h(8005)255000" Тогда
		
		//ПараметрыПроверки.ЭлементыПроверки[0].КодМаркировки = "04012922851628tWwWj7h";
		//ПараметрыПроверки.ЭлементыПроверки[0].ПолныйКодМаркировки = "MDEwNDAxMjkyMjg1MTYyODIxdFd3V2o3aB04MDA1MjU1MDAwHTkzVjBIMw==";
			
	КонецЕсли;
	//КонецМарк
	
	ЭлементПроверки       = ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ТекущийЭлементПроверкиСредствамиККТ(ПараметрыПроверки);
	КодМаркировки         = ЭлементПроверки.КодМаркировки;
	КоличествоЭлементов   = ПараметрыПроверки.ЭлементыПроверки.Количество();
	НомерТекущегоЭлемента = ПараметрыПроверки.ТекущийИндекс + 1;
	
	Для Каждого ЭлементПроверки Из ПараметрыПроверки.ЭлементыПроверки Цикл
		Если Не ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ЭлементПроверкиСредствамиКТТПроверяетсяНаОборудовании(ЭлементПроверки) Тогда
			КоличествоЭлементов = КоличествоЭлементов - 1;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеСтрокиСообщения = Новый Массив();
	Если ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.ЛокальнаяПроверка Тогда
		ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется локальная проверка средствами ККТ кода маркировки:'"));
	ИначеЕсли ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.УдаленнаяПроверка Тогда
		ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется проверка статуса ОИСМ кода маркировки средствами ККТ:'"));
	ИначеЕсли ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.Подтверждение Тогда
		ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется подтверждение кода маркировки на ККТ:'"));
	ИначеЕсли ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаИдентификатораГИСМТ
		Или ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.ПолучениеТокенаГИСМТ Тогда
		ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется разрешительный запрос ГИС МТ'"));
	ИначеЕсли ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.ОбновлениеCDNПлощадок Тогда
		ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется обновление CDN-площадок ГИС МТ'"));
	ИначеЕсли ПараметрыПроверки.ТекущаяОперация = ВыполняемыеОперации.ПроверкаЕдинымМетодомБПО Тогда
		Если ПараметрыПроверки.ТекущийЭтапПроверки = ВыполняемыеОперации.ЛокальнаяПроверка Тогда
			ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется локальная проверка средствами ККТ кода маркировки:'"));
		ИначеЕсли ПараметрыПроверки.ТекущийЭтапПроверки = ВыполняемыеОперации.УдаленнаяПроверка Тогда
			ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется проверка статуса ОИСМ кода маркировки средствами ККТ:'"));
		ИначеЕсли ПараметрыПроверки.ТекущийЭтапПроверки = ВыполняемыеОперации.Подтверждение Тогда
			ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Выполняется подтверждение кода маркировки на ККТ:'"));
		КонецЕсли;
	КонецЕсли;
	
	ДанныеСтрокиСообщения.Добавить(" ");
	ДанныеСтрокиСообщения.Добавить(Новый ФорматированнаяСтрока(КодМаркировки,,,, "СкопироватьШтриховойКодВБуферОбмена"));
	
	Если КоличествоЭлементов > 1 Тогда
		
		ПояснениеПрогресса = СтрШаблон(
			НСтр("ru = 'Код маркировки %1 из %2'"),
			НомерТекущегоЭлемента,
			КоличествоЭлементов);
		Если Не Элементы.Прогресс.Видимость Тогда
			Элементы.Прогресс.Видимость           = Истина;
			Элементы.ПояснениеПрогресса.Видимость = Истина;
		КонецЕсли;
		
		Если КоличествоЭлементов <> 0 Тогда
			Прогресс = Окр(НомерТекущегоЭлемента / КоличествоЭлементов * 100);
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеСтрокиСообщения.Добавить(Символы.ПС);
	ДанныеСтрокиСообщения.Добавить(НСтр("ru = 'Пожалуйста, подождите...'"));
	
	Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Заголовок = Новый ФорматированнаяСтрока(ДанныеСтрокиСообщения);
	Элементы.ПрерватьОперацию.Видимость                           = (Не ПараметрыПроверки.ЭтоСканирование И Не ПроверкаЕдинымМетодомБПО);
	
КонецПроцедуры
