
&Вместо("ПересчитатьСуммуРучнойСкидкиВСтрокеТЧКлиент")
Процедура ТБКПересчитатьСуммуРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуРучнойСкидки", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентРучнойСкидки / 100, 2);
		//Марк 2024-03-14
		ТекущаяСтрока.РучнаяСкидка = Окр(ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентРучнойСкидки / 100, 2);
		//КонецМарк
		
	КонецЕсли;
	
	//ПродолжитьВызов(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

