
&Вместо("ПодготовитьДанныеОперации")
Функция ТБКПодготовитьДанныеОперации(ПараметрыПодключения, ПроцессорДанных, Команда, ПараметрыОперации)
	// Вставить содержимое метода.    
	//вик 2025-04-17    
	Попытка
		ПараметрыОперации.Кассир	=	"Продавец-консультант " + ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПараметрыОперации.Кассир);		
	Исключение
	
	КонецПопытки;
	
	//
	
	Результат = ПродолжитьВызов(ПараметрыПодключения, ПроцессорДанных, Команда, ПараметрыОперации);
	Возврат Результат;
КонецФункции
