
&Вместо("ПроверитьАкцизныеМаркиПередЗаписьюЧека")
Процедура ТБКПроверитьАкцизныеМаркиПередЗаписьюЧека(СтруктураДляПроверки)
	// Вставить содержимое метода.
	//ПродолжитьВызов(СтруктураДляПроверки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект 				= СтруктураДляПроверки.Объект;
	ИмяТаблицыТоваров 	= СтруктураДляПроверки.ИмяТаблицыТоваров;
	Отказ 				= СтруктураДляПроверки.Отказ;
	ИтоговоеСообщение 	= СтруктураДляПроверки.ИтоговоеСообщение;
	ДатаРасчета 		= СтруктураДляПроверки.ДатаРасчета;
	Сообщать 			= СтруктураДляПроверки.Сообщать;
	ОрганизацияЕГАИС 	= СтруктураДляПроверки.ОрганизацияЕГАИС;
	
	ТаблицаАкцизныеМарки = Объект[ИмяТаблицыТоваров];
	ТаблицаТовары = Объект.Товары;
	
	АкцизныеМарки = Новый ТаблицаЗначений;
	АкцизныеМарки.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Число"));
	АкцизныеМарки.Колонки.Добавить("АкцизнаяМарка", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	
	Для Каждого АкцизнаяМарка Из ТаблицаАкцизныеМарки Цикл 
		НоваяСтрока = АкцизныеМарки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, АкцизнаяМарка);
	КонецЦикла;
	
	Организации = Новый ТаблицаЗначений;
	Организации.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Организации.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строка Из ТаблицаТовары Цикл 
		НоваяСтрока = Организации.Добавить();
		НоваяСтрока.КлючСвязи = Строка.КлючСвязи;
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЧекККМ") 
			 Или ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваров") 
			 Или ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
			НоваяСтрока.Организация = Объект.Организация;
		Иначе 
			НоваяСтрока.Организация = Строка.Организация;
		КонецЕсли;
	КонецЦикла;
	
	УсловиеРеализация = "";
	ДокументСсылка = Объект.Ссылка;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		УсловиеРеализация = "И РеализацияТоваровАкцизныеМарки.Ссылка <> &ДокументСсылка";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АкцизныеМарки.КлючСвязи КАК КлючСвязи,
	|	АкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка
	|ПОМЕСТИТЬ ТаблицаАкцизныеМарки
	|ИЗ
	|	&АкцизныеМарки КАК АкцизныеМарки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.КлючСвязи КАК КлючСвязи,
	|	Организации.Организация КАК Организация
	|ПОМЕСТИТЬ ТаблицаОрганизации
	|ИЗ
	|	&Организации КАК Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка,
	|	ТаблицаОрганизации.Организация КАК Организация
	|ПОМЕСТИТЬ ТаблицаОрганизацииИМарки
	|ИЗ
	|	ТаблицаАкцизныеМарки КАК ТаблицаАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОрганизации КАК ТаблицаОрганизации
	|		ПО ТаблицаАкцизныеМарки.КлючСвязи = ТаблицаОрганизации.КлючСвязи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцизнаяМарка,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМАкцизныеМарки.Ссылка КАК Ссылка,
	|	ЧекККМАкцизныеМарки.Ссылка.Дата КАК Дата,
	|	ЧекККМАкцизныеМарки.Ссылка.Номер КАК Номер,
	|	ЧекККМАкцизныеМарки.Ссылка.ВидОперации КАК ПоследняяОперация
	|ИЗ
	|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОрганизацииИМарки КАК ТаблицаОрганизацииИМарки
	|		ПО ЧекККМАкцизныеМарки.АкцизнаяМарка = ТаблицаОрганизацииИМарки.АкцизнаяМарка
	|			И (ЧекККМАкцизныеМарки.Ссылка.Дата > &ГлубинаПросмотра)
	|			И (ЧекККМАкцизныеМарки.Ссылка.Проведен)
	|ГДЕ
	|	ЧекККМАкцизныеМарки.Ссылка <> &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Ссылка УБЫВ";
	
	Если НЕ ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС", "");
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Иначе
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	КонецЕсли;
	
	НевыгруженныеСтатусы = Новый Массив;
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи);
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС);
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Отменен);
	Запрос.УстановитьПараметр("НевыгруженныеСтатусы", НевыгруженныеСтатусы);
	Запрос.УстановитьПараметр("Возврат", Перечисления.ВидыОперацийЧекККМ.Возврат);
	Запрос.УстановитьПараметр("Продажа", Перечисления.ВидыОперацийЧекККМ.Продажа);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Реализована", Перечисления.СтатусыАкцизныхМарок.Реализована);
	Запрос.УстановитьПараметр("АкцизныеМарки", АкцизныеМарки);
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ГлубинаПросмотра", ТекущаяДата() - 60*60*24*30);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеРеализация", УсловиеРеализация);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		
		ЕстьОшибка = Ложь;
		Если Выборка.ПоследняяОперация = Перечисления.ВидыОперацийЧекККМ.Продажа Тогда 
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если ЕстьОшибка Тогда
			
			СтруктураДляПроверки.Отказ = Истина;

			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(НСтр("ru = 'Присутствуют акцизные марки, которые '"));
			МассивСтрок.Добавить(НСтр("ru = 'ранее были учтены в документах:'"));
			МассивСтрок.Добавить(Символы.ПС);
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			ОбщегоНазначенияРТ.ПредставлениеДокумента(Выборка.Ссылка, Выборка.Номер, Выборка.Дата),,,,
				ПолучитьНавигационнуюСсылку(Выборка.Ссылка)));
			
			ТекстСообщения = Новый ФорматированнаяСтрока(МассивСтрок);
			
			Если Сообщать Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Иначе
				СтруктураДляПроверки.ИтоговоеСообщение = ИтоговоеСообщение + ТекстСообщения + Символы.ПС;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
