
&Вместо("ОтправитьДанныеВСервис")
Функция ТБКОтправитьДанныеВСервис(АдресЗапроса, ТелоЗапроса, КлючСессии, HTTPМетод, ПараметрыОтправкиHTTPЗапросов, ЗаголовокHTTP = Неопределено, HTTPОтветЭмуляция = Неопределено, Соединение = Неопределено) Экспорт
		
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыОтправкиHTTPЗапросов", ПараметрыОтправкиHTTPЗапросов);
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     HTTPМетод);
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    "");
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     "");
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   "");
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Скачивание файлов на клиент недоступно при работе в веб-клиенте.'");
	#КонецЕсли
	
	РасширенныеОбработкиОтправкиДанныхВСервис(ПараметрыОтправкиHTTPЗапросов);
	
	ЭтоДвоичныеДанные = ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные");
	ЭтоФайл           = ТипЗнч(ТелоЗапроса) = Тип("Файл");
	
	Если ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		ТелоЗапросаJSON = ТелоЗапроса;
	ИначеЕсли ТелоЗапроса <> Неопределено И Не ЭтоДвоичныеДанные И Не ЭтоФайл Тогда
		ТелоЗапросаJSON = ОбщегоНазначенияИСКлиентСервер.ОбъектВТекстJSON(ТелоЗапроса, Истина);
		КонецЕсли;
	
	Если ЗаголовокHTTP = Неопределено Тогда
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
		Если КлючСессии <> Неопределено Тогда
			ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP);
	Если ТелоЗапроса <> Неопределено Тогда
		Если ЭтоДвоичныеДанные Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		ИначеЕсли ЭтоФайл Тогда
			HTTPЗапрос.УстановитьИмяФайлаТела(ТелоЗапроса.ПолноеИмя);
		Иначе
			#Если ВебКлиент Тогда
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8);
			#Иначе
				HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияИСКлиентСерверПовтИсп.ЗащищенноеСоединение();
		
	Иначе
		
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
		
	КонецЕсли;
	
	//Марк 03-12-2025 https://jira.tabkn.ru/browse/ROZ-14
	ПопыткаПолзучиеHTTPОтвет = 0;
	~ПерейтиСюда:
	//КонецМарк
	Если HTTPОтветЭмуляция = Неопределено Тогда
				
		Попытка
			
			Если Соединение = Неопределено Тогда
				
				Соединение = Новый HTTPСоединение(
					ПараметрыОтправкиHTTPЗапросов.Сервер,
					ПараметрыОтправкиHTTPЗапросов.Порт,,,
					ИнтернетПрокси,
					ПараметрыОтправкиHTTPЗапросов.Таймаут,
					ЗащищенноеСоединение);
					
			КонецЕсли;
			
			Если HTTPМетод = "POST" Тогда
				HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			Иначе
				HTTPОтвет = Соединение.ВызватьHTTPМетод(HTTPМетод, HTTPЗапрос);
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			//Марк 03-12-2025 https://jira.tabkn.ru/browse/ROZ-14
			Если HTTPЗапрос.АдресРесурса = "api/v4/true-api/codes/check" И HTTPМетод = "POST" И СтрНайти(ТекстОшибки, "Ошибка работы с Интернет:  Превышен таймаут") И ПопыткаПолзучиеHTTPОтвет < 1  Тогда
				ТекстОшибки = "";
				ПопыткаПолзучиеHTTPОтвет = ПопыткаПолзучиеHTTPОтвет + 1;
				Перейти ~ПерейтиСюда;	
			КонецЕсли;
			//КонецМарк
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ИСМП'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон(
					НСтр("ru = 'Ошибка при выполнении запроса POST %1 в ИС МП %2'"),
					АдресЗапроса, ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.АдресСервера()) + Символы.ПС +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			#КонецЕсли
			
		КонецПопытки;
		
	Иначе
		
		HTTPОтвет = HTTPОтветЭмуляция;
		
	КонецЕсли;
	
	ДанныеЛогирования                               = СтруктураДанныхЛогирования();
	ДанныеЛогирования.HTTPЗапросАдресРесурса        = HTTPЗапрос.АдресРесурса;
	ДанныеЛогирования.HTTPЗапросТело                = HTTPЗапрос.ПолучитьТелоКакСтроку();
	ДанныеЛогирования.HTTPЗапросЗаголовки           = HTTPЗапрос.Заголовки;
	ДанныеЛогирования.HTTPМетод                     = HTTPМетод;
	ДанныеЛогирования.ПараметрыОтправкиHTTPЗапросов = ПараметрыОтправкиHTTPЗапросов;
	ДанныеЛогирования.ТекстОшибки                   = ТекстОшибки;
	ДанныеЛогирования.ЭмуляцияЗапроса               = Не (HTTPОтветЭмуляция = Неопределено);
	
	Если ТипЗнч(HTTPОтвет) = Тип("Структура") Тогда
		
		ДанныеЛогирования.HTTPОтветЗаголовки            = HTTPОтвет.Заголовки;
		ДанныеЛогирования.HTTPОтветКодСостояния         = HTTPОтвет.КодСостояния;
		ДанныеЛогирования.HTTPОтветТело                 = HTTPОтвет.Тело;
		
	ИначеЕсли Не HTTPОтвет = Неопределено Тогда
	
		ДанныеЛогирования.HTTPОтветЗаголовки            = HTTPОтвет.Заголовки;
		ДанныеЛогирования.HTTPОтветКодСостояния         = HTTPОтвет.КодСостояния;
		ДанныеЛогирования.HTTPОтветТело                 = HTTPОтвет.ПолучитьТелоКакСтроку();
		
	КонецЕсли;
	
	ЛогированиеЗапросовИСМПВызовСервера.ЗаписатьДанныеЛогирования(ДанныеЛогирования);
	
	ВозвращаемоеЗначение.Вставить("ПараметрыОтправкиHTTPЗапросов", ПараметрыОтправкиHTTPЗапросов);
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     HTTPМетод);
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    HTTPЗапрос);
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     HTTPОтвет);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   ТекстОшибки);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
