
&НаКлиенте
&Вместо("ВыполнитьОбновлениеТаблицыТокенов")
Процедура EF_00_00835911_ВыполнитьОбновлениеТаблицыТокенов()
	
	Если Элементы.Токены.ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Неопределено;
	Иначе
		ТекущиеДанные = Новый Структура("Организация,ПроизводственныйОбъект,ТипТокенаАвторизации");
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Токены.ТекущиеДанные);
	КонецЕсли;
	
	Токены.Очистить();
	
	ТребуетсяАктуализация = Ложь;
		
		ИмяПараметраНастроек = ИнтерфейсАвторизацииИСМПКлиент.ИмяПараметраНастроекОтветственногоЗаАктуализациюТокеновАвторизации();
		
		НастройкиОтветственного = ПараметрыПриложения[ИмяПараметраНастроек];
		Если НастройкиОтветственного = Неопределено Тогда
			Если Актуализация Тогда
				Возврат;
			Иначе
				ИнтерфейсАвторизацииИСМПКлиент.ВыполнитьОбновлениеНастроекОтветственногоЗаАктуализациюТокеновАвторизации(Истина);
				
				НастройкиОтветственного = ПараметрыПриложения[ИмяПараметраНастроек];
				
				Если НастройкиОтветственного = Неопределено Тогда
					Возврат;
				КонецЕсли;
				
				Если Не НастройкиОтветственного.ОткрытаФормаПросмотра Тогда
					ПараметрыПриложения[ИмяПараметраНастроек].ОткрытаФормаПросмотра = Истина;
				КонецЕсли;
				
				ИнтерфейсАвторизацииИСМПКлиент.ПроверитьНапоминанияОтветственномуЗаАктуализациюТокеновАвторизации();
				
				Если Не НастройкиОтветственного.ТребуетсяПроверкаНапоминаний Тогда
					ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверитьНапоминанияОтветственномуЗаАктуализациюТокеновАвторизации", 60);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ИмяПараметраНапоминаний  = ИнтерфейсАвторизацииИСМПКлиент.ИмяПараметраНапоминанийОтветственногоЗаАктуализациюТокеновАвторизации();
		
		Напоминания = ПараметрыПриложения[ИмяПараметраНапоминаний];
		Если Напоминания = Неопределено Тогда
			Если Актуализация Тогда
				Возврат;
			Иначе
				ИнтерфейсАвторизацииИСМПКлиент.ПроверитьНапоминанияОтветственномуЗаАктуализациюТокеновАвторизации();
				Напоминания = ПараметрыПриложения[ИмяПараметраНапоминаний];
				Если Напоминания = Неопределено Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Напоминание Из Напоминания Цикл
			
			Если Актуализация Тогда
				Если Не Напоминание.ОповещениеИспользуется Тогда
					Продолжить;
				КонецЕсли;
				Если Не Напоминание.ТребуетсяАктуализация Тогда
					Если Напоминание.ОповещатьЗа < 3600 Тогда
						ДобавочноеВремя = 600;
					Иначе
						ДобавочноеВремя = 1800;
					КонецЕсли;
					Если Напоминание.ВремяДействия > Напоминание.ОповещатьЗа + ДобавочноеВремя Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Напоминание.Отсутствует Тогда
				Продолжить;
			КонецЕсли;
			
			Строка = Токены.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Напоминание);
			
			Если Строка.Отсутствует Тогда
				Строка.ВремяДействияСтрокой = НСтр("ru = '<не найден>'");
			ИначеЕсли Строка.ТипТокенаАвторизации = ПредопределенноеЗначение("Перечисление.ТипыТокеновАвторизации.ИСМПРозница") Тогда
				Строка.ВремяДействияСтрокой = НСтр("ru = '<бессрочный>'");
				Строка.Просрочен = Ложь;
			ИначеЕсли Строка.Просрочен Тогда
				Строка.ВремяДействияСтрокой = НСтр("ru = '<просрочен>'");
			Иначе
				Строка.ВремяДействияСтрокой = ПредставлениеВремени(Строка.ВремяДействия);
			КонецЕсли;
			
			Если Строка.ТребуетсяАктуализация Тогда
				ТребуетсяАктуализация = Истина;
			КонецЕсли;
			
		КонецЦикла;
	
	Если ТекущиеДанные <> Неопределено Тогда
		НайденныеСтроки = Токены.НайтиСтроки(ТекущиеДанные);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.Токены.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	НастроитьОтображениеСпискаТокенов();
	
КонецПроцедуры