
Процедура ЗапуститьПроверкуВидовНоменклатуры_И_Измерениеневерных() Экспорт
		
	Выборка = Справочники.ВидыНоменклатуры.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Результат
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		
		Структура = Неопределено;	
		
		Если Выборка.Наименование = "Табак" 
			И Выборка.ОсобенностьУчета <> Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция 
			И Выборка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар
			И Выборка.ПризнакПредметаРасчета <> Справочники.ПризнакиПредметовРасчета.ТоварМаркируемыйСИИмеющийКМ Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция);
			Структура.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар); 
			Структура.Вставить("ПризнакПредметаРасчета", Справочники.ПризнакиПредметовРасчета.ТоварМаркируемыйСИИмеющийКМ); 
			
		ИначеЕсли Выборка.Наименование = "Товар (пр. ТМЦ)" 
			И Выборка.ОсобенностьУчета <> Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка() 
			И Выборка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар
			И Выборка.ПризнакПредметаРасчета <> Справочники.ПризнакиПредметовРасчета.Товар Тогда
			
			Структура = Новый Структура;
		    Структура.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка());
			Структура.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар); 
			Структура.Вставить("ПризнакПредметаРасчета", Справочники.ПризнакиПредметовРасчета.Товар); 
			
		ИначеЕсли Выборка.Наименование = "Услуга" 
			И Выборка.ОсобенностьУчета <> Ложь 
			И Выборка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга
			И Выборка.ПризнакПредметаРасчета <> Справочники.ПризнакиПредметовРасчета.Услуга Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("ОсобенностьУчета", Ложь);
			Структура.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга); 
			Структура.Вставить("ПризнакПредметаРасчета", Справочники.ПризнакиПредметовРасчета.Услуга);  
			
		ИначеЕсли Выборка.ОсобенностьУчета <> Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка() 
			И Выборка.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар
			И Выборка.ПризнакПредметаРасчета <> Справочники.ПризнакиПредметовРасчета.Товар Тогда
			
			Структура = Новый Структура;
			Структура.Вставить("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка());
			Структура.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар); 
			Структура.Вставить("ПризнакПредметаРасчета", Справочники.ПризнакиПредметовРасчета.Товар);	
		КонецЕсли;
		
		Если Структура <> Неопределено Тогда
		
			ОбъектВидыНоменклатуры = Выборка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ОбъектВидыНоменклатуры, Структура);
			ОбъектВидыНоменклатуры.Записать();
			
			ПараметрыПроцедуры = Новый Структура;
			ПараметрыПроцедуры.Вставить("ВидНоменклатуры", ОбъектВидыНоменклатуры.Ссылка);
			ПараметрыПроцедуры.Вставить("ТипНоменклатуры", ОбъектВидыНоменклатуры.ОсобенностьУчета);
			
			Справочники.Номенклатура.ИзменитьТипНоменклатурыПоВиду(ПараметрыПроцедуры, ОбъектВидыНоменклатуры.Ссылка.УникальныйИдентификатор());
			
		КонецЕсли;		
	
	КонецЦикла;
	
	
КонецПроцедуры