
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.НайтиПоКоду("000000103");
	Объект.Контрагент  = Справочники.Контрагенты.НайтиПоКоду("АВ0000254");
	ДатаНач	=	НачалоМесяца(ТекущаяДата());
	ДатаКон	=	КонецМесяца(ТекущаяДата());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	РеализацияТоваровУслуг.Ссылка
	      	 	             |ПОМЕСТИТЬ Реализации
	      	 	             |ИЗ
	      	 	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	      	 	             |ГДЕ
	      	 	             |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И РеализацияТоваровУслуг.Организация = &Организация
	      	 	             |	И РеализацияТоваровУслуг.Проведен
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СчетФактураВыданный.Ссылка КАК ДокСф
	      	 	             |ПОМЕСТИТЬ СФ
	      	 	             |ИЗ
	      	 	             |	Документ.СчетФактураВыданный КАК СчетФактураВыданный,
	      	 	             |	Реализации КАК Реализации
	      	 	             |ГДЕ
	      	 	             |	СчетФактураВыданный.Проведен
	      	 	             |	И СчетФактураВыданный.ДокументОснование В (Реализации.Ссылка)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Реализации.Ссылка КАК Реализация,
	      	 	             |	СФ.ДокСф КАК СчетФактура
	      	 	             |ИЗ
	      	 	             |	Реализации КАК Реализации
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ СФ КАК СФ
	      	 	             |		ПО Реализации.Ссылка = СФ.ДокСф.ДокументОснование");
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
	
	Объект.Реализации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПоступлениеТоваровУслуг.Ссылка
	      	 	             |ПОМЕСТИТЬ Поступления
	      	 	             |ИЗ
	      	 	             |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	      	 	             |ГДЕ
	      	 	             |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ПоступлениеТоваровУслуг.Проведен
	      	 	             |	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СчетФактураПолученный.Ссылка КАК ДокСф
	      	 	             |ПОМЕСТИТЬ СФ
	      	 	             |ИЗ
	      	 	             |	Документ.СчетФактураПолученный КАК СчетФактураПолученный,
	      	 	             |	Поступления КАК Поступления
	      	 	             |ГДЕ
	      	 	             |	СчетФактураПолученный.Проведен
	      	 	             |	И СчетФактураПолученный.ДокументОснование В (Поступления.Ссылка)
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Поступления.Ссылка КАК Поступление,
	      	 	             |	СФ.ДокСф КАК СчетФактура
	      	 	             |ИЗ
	      	 	             |	Поступления КАК Поступления
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ СФ КАК СФ
	      	 	             |		ПО Поступления.Ссылка = СФ.ДокСф.ДокументОснование");
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
	
	Объект.Поступления.Загрузить(Запрос.Выполнить().Выгрузить());

	

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция  СоздатьСФВыданныйНаСервере(Реализация)
	
	НоваяСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
	НоваяСФ.Заполнить(Реализация);
	НоваяСФ.ДокументОснование	=	Реализация;
	
	Префикс = ПолучиьПрефикс(Реализация.Дата);
	
	НоваяСФ.УстановитьНовыйНомер(Префикс);
	
	Попытка
		НоваяСФ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
	Возврат НоваяСФ;	
КонецФункции

&НаСервере
Функция  СоздатьСФПолученныйНаСервере(Поступление)
	
	НоваяСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	НоваяСФ.Заполнить(Поступление);
	НоваяСФ.ДокументОснование		=	Поступление;
	НоваяСФ.ДатаВходящегоДокумента  = Поступление.ДатаВходящегоДокумента;
	НоваяСФ.НомерВходящегоДокумента = Поступление.НомерВходящегоДокумента;
	
	Префикс = ПолучиьПрефикс(Поступление.Дата);
	НоваяСФ.УстановитьНовыйНомер(Префикс);
	
	Попытка
		НоваяСФ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
	Возврат НоваяСФ;	
КонецФункции


&НаКлиенте
Процедура СоздатьСФ(Команда)
	ФормаПрогрессора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
	Если ФормаПрогрессора.Открыта() Тогда
		
		ФормаПрогрессора.Закрыть();
	КонецЕсли; 
	
	ФормаПрогрессора.Значение = 0;
	ФормаПрогрессора.КомментарийОбработкиДанных	=	"Создание счет-фактур...";	
	
	ФормаПрогрессора.МаксимальноеЗначение = Объект.Реализации.Количество() + Объект.Поступления.Количество();
	ФормаПрогрессора.Открыть(); 
	
	Для каждого Строка из Объект.Реализации цикл
		Если ЗначениеЗаполнено(Строка.СчетФактура) тогда 
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			Продолжить;
		КонецЕсли;  		
		НоваяСФ 			= СоздатьСФВыданныйНаСервере(Строка.Реализация);		
		Строка.СчетФактура  = НоваяСФ.Ссылка;                    		
		ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
	КонецЦикла;
	
	Для каждого Строка из Объект.Поступления цикл
		Если ЗначениеЗаполнено(Строка.СчетФактура) тогда 
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			Продолжить;
		КонецЕсли;  		
		НоваяСФ 			= СоздатьСФПолученныйНаСервере(Строка.Поступление);		
		Строка.СчетФактура  = НоваяСФ.Ссылка;                    		
		ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
	КонецЦикла;
	
	
	Если ФормаПрогрессора.Открыта() Тогда  		
		ФормаПрогрессора.Закрыть();
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПолучиьПрефикс(Дата)
	СтрокаМесяц = Строка(Месяц(Дата));
	Если СтрДлина(СтрокаМесяц) = 1 тогда СтрокаМесяц = "0"+СтрокаМесяц; КонецЕсли; 
	
	СтрокаДень = Строка(День(Дата));
	Если СтрДлина(СтрокаДень) = 1 тогда СтрокаДень = "0"+СтрокаДень; КонецЕсли; 
	
	Префикс = СтрокаМесяц + СтрокаДень;
	
	Возврат Префикс;	
КонецФункции