
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ФокусГруппа") Тогда
		Возврат;	
	КонецЕсли; 
	
	НоменклатураМассив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпрНом.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ТБКФокуснаяМотивация КАК ТБКФокуснаяМотивацияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|		ПО ТБКФокуснаяМотивацияСрезПоследних.Номенклатура = СпрНом.Ссылка
	|ГДЕ
	|	ТБКФокуснаяМотивацияСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ТБКФокуснаяМотивацияСрезПоследних.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Тип", Параметры.ФокусГруппа);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Параметры.Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Параметры.Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоменклатураМассив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	НоменклатураМассивНовый	= Обработки.РМКУправляемыйРежим.ПолучитьСписокНоменклатуры(НоменклатураМассив);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНоменклатуры", НоменклатураМассивНовый);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В (&МассивНоменклатуры)) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Остатки.Номенклатура КАК Номенклатура,
	|	вт_Остатки.Количество КАК Количество,
	|	ЕСТЬNULL(ДействующиеЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	вт_Остатки КАК вт_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(, Номенклатура В (&МассивНоменклатуры)) КАК ДействующиеЦеныНоменклатурыСрезПоследних
	|		ПО вт_Остатки.Номенклатура = ДействующиеЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И вт_Остатки.Характеристика = ДействующиеЦеныНоменклатурыСрезПоследних.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ ПО
	|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
	
	Данные = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Данные, "ДеревоНоменклатуры");
	
	Элементы.ДеревоНоменклатуры.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры
