
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ФокусГруппа") Тогда
		Возврат;	
	КонецЕсли;  
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("Тип", Параметры.ФокусГруппа);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Параметры.Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Параметры.Период));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрНом.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ вт_
	               |ИЗ
	               |	РегистрСведений.ТБКФокуснаяМотивация КАК ТБКФокуснаяМотивацияСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	               |		ПО ТБКФокуснаяМотивацияСрезПоследних.Номенклатура = СпрНом.Ссылка
	               |ГДЕ
	               |	ТБКФокуснаяМотивацияСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ТБКФокуснаяМотивацияСрезПоследних.Тип = &Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпрНомен.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ вт__
	               |ИЗ
	               |	Справочник.Номенклатура КАК СпрНомен
	               |ГДЕ
	               |	СпрНомен.Родитель В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				Спр.Ссылка
	               |			ИЗ
	               |				вт_ КАК Спр)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вт_.Ссылка
	               |ИЗ
	               |	вт_ КАК вт_
	               |ГДЕ
	               |	вт_.Ссылка.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт__.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ вт_Группа
	               |ИЗ
	               |	вт__ КАК вт__
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт__.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Группа.Ссылка КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	               |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ вт_Остатки
	               |ИЗ
	               |	вт_Группа КАК вт_Группа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |				,
	               |				Номенклатура В
	               |					(ВЫБРАТЬ
	               |						Ном.Ссылка КАК Ссылка
	               |					ИЗ
	               |						вт_Группа КАК Ном)) КАК ТоварыНаСкладахОстатки
	               |		ПО вт_Группа.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Остатки.Номенклатура КАК Номенклатура,
	               |	вт_Остатки.Количество КАК Количество,
	               |	ЕСТЬNULL(ДействующиеЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ИЗ
	               |	вт_Остатки КАК вт_Остатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
	               |				,
	               |				Номенклатура В
	               |					(ВЫБРАТЬ
	               |						вт_Остатки.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						вт_Остатки КАК вт_Остатки)) КАК ДействующиеЦеныНоменклатурыСрезПоследних
	               |		ПО вт_Остатки.Номенклатура = ДействующиеЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И вт_Остатки.Характеристика = ДействующиеЦеныНоменклатурыСрезПоследних.Характеристика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |ИТОГИ ПО
	               |	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
	
	Данные = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Данные, "ДеревоНоменклатуры");
	
	Элементы.ДеревоНоменклатуры.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры
