Функция ПолучитьХарактеристику(номен, мрц) ЭКСПОРТ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Владелец = &владелец
	               |	И ХарактеристикиНоменклатуры.Наименование = &мрц ";
	Запрос.УстановитьПараметр("владелец",номен);
	Запрос.УстановитьПараметр("мрц",СтрЗаменить(Строка(мрц),Символы.НПП,""));
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		возврат рез.Ссылка;
	Иначе
		возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьМРЦ(марка) ЭКСПОРТ
	МРЦПачки = ШтрихкодированиеМОТПКлиентСервер.МРЦКодаМаркировкиТабачнойПачки(марка);
	Если МРЦПачки = Неопределено Тогда
		МРЦБлока = ШтрихкодированиеМОТПКлиентСервер.МРЦКодаМаркировкиБлока(марка);
		Если МРЦБлока <> Неопределено Тогда
			мрц = МРЦБлока/10;
		КонецЕсли
	Иначе
		мрц = МРЦПачки;
	Конецесли;

	Возврат мрц;
КонецФункции