
&НаКлиенте
Процедура ТБКУстановить_ОсобенностьУчетаДля_ТабачнаяПродукцияПосле(Команда)
	колвоИспр = ТБКУстановить_ОсобенностьУчетаДля_ТабачнаяПродукцияПослеНаСервере();
	Сообщить("Исправлено "+колвоИспр+" поз.");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТБКУстановить_ОсобенностьУчетаДля_ТабачнаяПродукцияПослеНаСервере()
	
	возврат ТБК_Номенклатура.Установить_ОсобенностьУчетаДля_ТабачнаяПродукция();
КонецФункции

&НаКлиенте
Процедура ТБКУдалитьХарактеристики_НеЗаполненоПосле(Команда)
	ТБКУдалитьХарактеристики_НеЗаполненоПослеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТБКУдалитьХарактеристики_НеЗаполненоПослеНаСервере()
	// Вставить содержимое обработчика.
	ТБК_Номенклатура.УдалитьХарактеристики_НеЗаполнено();
КонецПроцедуры
