Функция ЗашифроватьТекст(МассивСимволов, МассивХеша) 
	ЗашифрованнаяСтрока = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел(1);

	ПозицияСимволаХэша = 0;
	ДлинаХэша = МассивХеша.количество();
	для каждого ном из МассивСимволов Цикл
		//Извлекаем номр шифруемого символа  UTF-8
		НомерСимвола = КодСимвола(ном);
		Если  ПозицияСимволаХэша >= ДлинаХэша-1 тогда
			ПозицияСимволаХэша = 0;
		КонецЕсли;
		//Позиция суммируемого хеша
		ПозицияСимволаХэша = ПозицияСимволаХэша+1;
		//Извлекаем номр символа хеша UTF-8
		СимволаХэша = КодСимвола(МассивХеша[ПозицияСимволаХэша]); 
		
		//Суммируем СуммыПозиций кодов 
		Код_Зашифрованный_символ =  НомерСимвола+СимволаХэша;
		Зашифрованный_символ = Символ(Код_Зашифрованный_символ);
		ЗашифрованнаяСтрока= ЗашифрованнаяСтрока+Зашифрованный_символ;
		
		//Усложним шифр добавляя тенического мусора при условие что КодСимвола хеша четный;
		Если Цел(СимволаХэша/2) = СимволаХэша/2 тогда
			
			СлучайноеЧисло = ГСЧ.СлучайноеЧисло(100, 1000); 
			ЗашифрованнаяСтрока= ЗашифрованнаяСтрока+Символ(СлучайноеЧисло);
		КонецЕсли;	
	КонецЦикла;
	возврат ЗашифрованнаяСтрока; 
	
	
КонецФункции


Функция РазложитьСтрокуВМассивзнаков(Знач Стр,МассивСтрок) Экспорт
	
	//МассивСтрок = Новый Массив();
	Длинастроки = СтрДлина(Стр);
	Поз=0;
	Пока 1=1 Цикл
		Поз = Поз+1;
		Если Длинастроки=0 Тогда
			Если Стр <> "" тогда
				МассивСтрок.Добавить(Лев(Стр,1));
			КонецЕсли;
			Возврат МассивСтрок;
		КонецЕсли;
		Если Стр <> "" тогда
			МассивСтрок.Добавить(Лев(Стр,1));
		КонецЕсли;
		
		Стр = Прав(Стр,Длинастроки-1);
		Длинастроки= Длинастроки-1;
	КонецЦикла;
	
	
КонецФункции 


Функция РазложитьТекстВМассивПодстрок(Знач Стр, Разделитель = "") Экспорт
	
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	Пока 1=1 Цикл
		Поз = Найти(Стр,Разделитель);
		Если Поз=0 Тогда
			МассивСтрок.Добавить(Стр);
			прервать;
		КонецЕсли;
		МассивСтрок.Добавить(Лев(Стр,Поз-1));
		Стр = Сред(Стр,Поз+ДлинаРазделителя);
	КонецЦикла;
	//Возврат МассивСтрок;
	МассивТекста = новый массив;
	для каждого ном из МассивСтрок Цикл
		Если  ном <> "" тогда
			МассивТекста = РазложитьСтрокуВМассивзнаков(ном,МассивТекста);
		КонецЕсли;
		МассивТекста.добавить(символы.ПС);
	КонецЦикла;	 
	
	возврат  МассивТекста;
	
КонецФункции

Функция РасшифроватьТекст(МассивСимволов,МассивХеша)
	РасшифроватьТекст = "";
	ПозицияСимволаХэша = 0;
	ДлинаХэша = МассивХеша.количество();
	пропуск = ложь;
	для каждого ном из МассивСимволов Цикл
		
		Если пропуск тогда
			пропуск=ложь;
			продолжить;
		КонецЕсли;	

		
		НомерСимвола = КодСимвола(ном);
		Если  ПозицияСимволаХэша >= ДлинаХэша-1 тогда
			ПозицияСимволаХэша = 0;
		КонецЕсли;
		ПозицияСимволаХэша = ПозицияСимволаХэша+1;
		СимволаХэша = КодСимвола(МассивХеша[ПозицияСимволаХэша]); 

		Код_Зашифрованный_символ =  НомерСимвола-СимволаХэша;
		Зашифрованный_символ = Символ(Код_Зашифрованный_символ);
		
		
		РасшифроватьТекст= РасшифроватьТекст+Зашифрованный_символ;
		
		//Отсекаем мусор
		Если Цел(СимволаХэша/2) = СимволаХэша/2 тогда
			//пропускаем следующий символ;
			пропуск = истина;
		КонецЕсли;	

	КонецЦикла;
	возврат РасшифроватьТекст; 
	
	
КонецФункции

Функция ПолучитьЗашифрованныйТекст(ИсходныйТест, КодШифра, Разделитель)Экспорт
	

	
	массивТекста = РазложитьТекстВМассивПодстрок(СокрЛП(ИсходныйТест),символы.ПС);	
	
	Хеш=Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(КодШифра); //Код Шифра - это наш пароль
	КлючШифра = Хеш.ХешСумма;
    //КлючШифра	 - это хеш от пароля в формате (SHA256) На котором работает Биткоин 
	МассивХеша = новый Массив;
	КлючШифра = СтрЗаменить(КлючШифра," ","");
	МассивХеша = РазложитьСтрокуВМассивзнаков(КлючШифра,МассивХеша);
	
	ЗашифрованныйТекст = ЗашифроватьТекст(массивТекста, МассивХеша); 
	
	КодДляВозврата	=	"";
	Для Поз = 1 по СтрДлина(ЗашифрованныйТекст) цикл 		
		КодДляВозврата	= КодДляВозврата + КодСимвола(Сред(ЗашифрованныйТекст,Поз,1)) + Разделитель; 
	КонецЦикла; 
	
	Возврат КодДляВозврата;
	
	
КонецФункции

Функция ПолучитьРасшифрованныйТекст(ЗашифрованныйТекст, КодШифра, Разделитель) экспорт

	ЗашифрованныйТекст_Обработанный	=	"";
	
	Пока Найти(ЗашифрованныйТекст, Разделитель) цикл 
		Поз	=	Найти(ЗашифрованныйТекст, Разделитель);
		НужКодСимвола	=	Сред(ЗашифрованныйТекст,1,Поз-1);	
		
		
		ЗашифрованныйТекст_Обработанный		=	ЗашифрованныйТекст_Обработанный + Символ(НужКодСимвола);
		
		ЗашифрованныйТекст	=	Сред(ЗашифрованныйТекст,Поз + 3);
	КонецЦикла;
	
	

	
	Хеш=Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(КодШифра); //Код Шифра - это наш пароль
	КлючШифра = Хеш.ХешСумма;
    //КлючШифра	 - это хеш от пароля в формате (SHA256) На котором работает Биткоин 
	МассивХеша = новый Массив;
	КлючШифра = СтрЗаменить(КлючШифра," ","");
	МассивХеша = РазложитьСтрокуВМассивзнаков(КлючШифра,МассивХеша);

	
	
	массивТекста = РазложитьТекстВМассивПодстрок(СокрЛП(ЗашифрованныйТекст_Обработанный),символы.ПС);
	МойТекст	 = РасшифроватьТекст(массивТекста,МассивХеша);  
	МойТекст	 = СтрЗаменить(МойТекст,Символы.ПС,"");	
	
	Возврат МойТекст;
КонецФункции
