Функция POST(host, port, url, body) ЭКСПОРТ
	
	
	хттпЗапрос = Новый HTTPЗапрос(
		СтрЗаменить("/"+url,"//","/"), 
		ПолучитьЗаголовкиПоУмолчанию()
	);
	
	тело = ТБК_WS.СтруктураВjson(body);
	хттпЗапрос.УстановитьТелоИзСтроки(тело);
	
	хттп = Новый HTTPСоединение(
		host,
		port
	,,,,20);
	хттпОтвет = хттп.ОтправитьДляОбработки(хттпЗапрос);
	
	ответ = хттпОтвет.ПолучитьТелоКакСтроку();
	
	Возврат ТБК_WS.jsonВСтруктура(ответ);
КонецФункции


Функция ПолучитьЗаголовкиПоУмолчанию()
	ЗаголовкиHTTP = Новый Соответствие;
    ЗаголовкиHTTP.Вставить("Content-Type", "application/json"); 	
	Возврат ЗаголовкиHTTP;
КонецФункции