
&НаСервере
&После("ЗаполнитьНастройкиПодключенияИзXMLНаСервере")
Процедура ТБКЗаполнитьНастройкиПодключенияИзXMLНаСервере(АдресВХранилище, Отказ, СообщениеОбОшибке)
		//Вик 2022-12-12
	ОбычныеКаналыСвязиFILEИспользование	= Ложь;
	ОбычныеКаналыСвязиFTPИспользование  = Истина;
	ИспользоватьПараметрыТранспортаFILE	= Ложь;
	ИспользоватьПараметрыТранспортаFTP	= Истина;
	ВидТранспортаСообщенийОбмена		= Перечисления.ВидыТранспортаСообщенийОбмена.FTP;
	ОбычныеКаналыСвязиВидТранспортаПоУмолчанию	=	"FTP";

	
	Поз	=	Найти(ОбычныеКаналыСвязиFILEКаталог,"exchange2");
	Доп = Сред(ОбычныеКаналыСвязиFILEКаталог, Поз + 10);
	
	ОбычныеКаналыСвязиFTPПуть								=	"ftp://mx.tbkon.ru/exchange/"+СтрЗаменить(Доп, "rver\Obmen\exchange\\", "");
	ОбычныеКаналыСвязиFTPПароль								=	"office";
	ОбычныеКаналыСвязиFTPИспользоватьОграничениеРазмераФайла= Истина;
	ОбычныеКаналыСвязиFTPМаксимальныйДопустимыйРазмерФайла 	= 30000;
	ОбычныеКаналыСвязиFTPПассивныйРежим						= истина;
	ОбычныеКаналыСвязиFTPПользователь						=	"manager";
	ОбычныеКаналыСвязиFTPПорт								=	21;
	
	//конецВИк

КонецПроцедуры
