
&Вместо("ДополнитьТоварамиПараметрыПриПробитииЧека")
Процедура ТБКДополнитьТоварамиПараметрыПриПробитииЧека(РеквизитыДокумента, ОбщиеПараметры, ТаблицаТоваровЧека, ТаблицаТоваровГосИС, ТаблицаСоответствияТоваровСекциям, ПризнакСпособаРасчета, ИспользуетсяКомиссионнаяТорговля, ИспользуетсяУчетИмпортныхТоваров)
	// Вставить содержимое метода.
	Если ТекущаяДата()<ИнтеграцияМОТПВызовСервера.ДатаОбязательнойМаркировкиТабачнойПродукции() Тогда
		
		этоВозврат = (Ложь) ИЛИ (РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат);
		
		Для  Каждого СтрокаТЧ из ТаблицаТоваровЧека Цикл
			Если (этоВозврат) ИЛИ (СтрДлина(СтрокаТЧ.Штрихкод) <= 13) Тогда
				СтрокаТЧ.ПродукцияГИСМ = ЛОЖЬ;
			КонецЕсли;
		КонецЦикла;
		
		мУдалить = новый Массив;
		Для Каждого СтрокаТЧ из ТаблицаТоваровГосИС Цикл
			Если (этоВозврат) ИЛИ (СтрДлина(СтрокаТЧ.Штрихкод) <= 13) Тогда
				мУдалить.Добавить(СтрокаТЧ);
			КонецЕсли; 	
		КонецЦикла;
		
		Для каждого эл из мУдалить Цикл 
			ТаблицаТоваровГосИС.Удалить(эл);
		КонецЦикла;
	КонецЕсли;
	ПродолжитьВызов(РеквизитыДокумента, ОбщиеПараметры, ТаблицаТоваровЧека, ТаблицаТоваровГосИС, ТаблицаСоответствияТоваровСекциям, ПризнакСпособаРасчета, ИспользуетсяКомиссионнаяТорговля, ИспользуетсяУчетИмпортныхТоваров);
КонецПроцедуры
