
&Вместо("ДополнитьТоварамиПараметрыПриПробитииЧека")
Процедура ТБКДополнитьТоварамиПараметрыПриПробитииЧека(РеквизитыДокумента, ОбщиеПараметры, ТаблицаТоваровЧека, ТаблицаТоваровГосИС, ТаблицаСоответствияТоваровСекциям, ПризнакСпособаРасчета, ИспользуетсяКомиссионнаяТорговля, ИспользуетсяУчетИмпортныхТоваров)
	// Вставить содержимое метода.
	Если ТекущаяДата()<ИнтеграцияМОТПВызовСервера.ДатаОбязательнойМаркировкиТабачнойПродукции() Тогда
		
		этоВозврат = (Ложь) ИЛИ (РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат);
		
		Для  Каждого СтрокаТЧ из ТаблицаТоваровЧека Цикл
			Если (этоВозврат) ИЛИ (СтрДлина(СтрокаТЧ.Штрихкод) <= 13) Тогда
				СтрокаТЧ.ПродукцияГИСМ = ЛОЖЬ;
			КонецЕсли;
		КонецЦикла;
		
		мУдалить = новый Массив;
		Для Каждого СтрокаТЧ из ТаблицаТоваровГосИС Цикл
			Если (этоВозврат) ИЛИ (СтрДлина(СтрокаТЧ.Штрихкод) <= 13) Тогда
				мУдалить.Добавить(СтрокаТЧ);
			КонецЕсли; 	
		КонецЦикла;
		
		Для каждого эл из мУдалить Цикл 
			ТаблицаТоваровГосИС.Удалить(эл);
		КонецЦикла;
	КонецЕсли;
	ПродолжитьВызов(РеквизитыДокумента, ОбщиеПараметры, ТаблицаТоваровЧека, ТаблицаТоваровГосИС, ТаблицаСоответствияТоваровСекциям, ПризнакСпособаРасчета, ИспользуетсяКомиссионнаяТорговля, ИспользуетсяУчетИмпортныхТоваров);
КонецПроцедуры

&Вместо("ОбработатьДанныеШтрихкода")
Функция ТБКОбработатьДанныеШтрихкода(Форма, ДанныеШтрихкода, ПараметрыСканирования, ВложенныеШтрихкоды)
	//// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(Форма, ДанныеШтрихкода, ПараметрыСканирования, ВложенныеШтрихкоды);
	//Возврат Результат;
	
	
	//Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ДанныеШтрихкода.ТипУпаковки) Тогда
	Если ДанныеШтрихкода.ТипУпаковки <> Перечисления.ТипыУпаковок.МаркированныйТовар и ВложенныеШтрихкоды = Неопределено тогда
		ДанныеШтрихкода.ТипУпаковки 	= Перечисления.ТипыУпаковок.МаркированныйТовар;
		ДанныеШтрихкода.КоличествоПачек	= 1;
	КонецЕсли;	
	
	Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(ДанныеШтрихкода.ТипУпаковки)  Тогда
		
		Результат = ОбработатьДанныеШтрихкодаУпаковкиМаркируемойПродукции(Форма, ДанныеШтрихкода, ПараметрыСканирования, ВложенныеШтрихкоды);
		
	Иначе
		
		Результат = ОбработатьДанныеШтрихкодаМаркируемойПродукции(Форма, ДанныеШтрихкода, ПараметрыСканирования);
		
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, "Объект", "АкцизныеМарки", "АкцизнаяМарка");
	ПроверкаИПодборПродукцииИС.ПрименитьКешШтрихкодовУпаковок(Форма, ПроверкаИПодборПродукцииИСМПРТ.НастройкиИсточникаКешаЧека());
	ШтрихкодированиеИС.ОбновитьКэшМаркируемойПродукции(Форма);
	
	Возврат Результат;
КонецФункции
