
&После("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
 	Если отказ ТОгда
		Если (СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Архивный
		 И  мЗакрытиеСмены) Тогда
		   	Отказ = Ложь;			
		КонецЕсли;  
	КонецЕсли;
	
	
	
	//костыль
	Если не отказ тогда
		Для каждого Строка из Товары цикл
			Если Не ЗначениеЗаполнено(Строка.Продавец) тогда
				Строка.Продавец	=	Пользователи.ТекущийПользователь().ФизическоеЛицо;
			КонецЕсли;
		КонецЦикла;
		
		//2024-05-24 Проставляем продавцов
		Если КоличествоОсновныхПродавцов = 0 Тогда
			//1 находим смену
			Запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			      	 	             |	ТБКСменыСотрудников.КассоваяСмена КАК КассоваяСмена
			      	 	             |ИЗ
			      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
			      	 	             |ГДЕ
			      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Статус = &Статус
			      	 	             |	И ТБКСменыСотрудников.КассоваяСмена.КассаККМ = &КассаККМ
			      	 	             |
			      	 	             |УПОРЯДОЧИТЬ ПО
			      	 	             |	ТБКСменыСотрудников.КассоваяСмена.Дата УБЫВ");
			Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКассовойСмены.Открыта);
			Запрос.УстановитьПараметр("КассаККМ",	КассаККМ);
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий()  тогда	
				//2 находим продавцов по смене
				Запрос	=	Новый Запрос("ВЫБРАТЬ
				      	 	             |	ТБКСменыСотрудников.Продавец КАК Продавец,
				      	 	             |	ТБКСменыСотрудников.ТипПродавца КАК ТипПродавца
				      	 	             |ИЗ
				      	 	             |	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
				      	 	             |ГДЕ
				      	 	             |	ТБКСменыСотрудников.КассоваяСмена = &КассоваяСмена");
				Запрос.УстановитьПараметр("КассоваяСмена", Рез.КассоваяСмена);
				Рез1 = запрос.Выполнить().Выбрать();
				КоличествоОсновныхПродавцов	=	0;
				
				//3 получаем двух продавцов если есть и считаем количетсво основных
				Продавец1	=	Неопределено;
				Продавец2	=	Неопределено;
				
				Пока рез1.Следующий()  Цикл
					 
					Если Продавец <> Рез1.Продавец Тогда
						
						Если Продавец1 = Неопределено и Продавец1<>Рез1.Продавец Тогда
							Продавец1	=	Рез1.Продавец; 
						иначе
						    Продавец2	=	Рез1.Продавец;
						КонецЕсли;
						
					КонецЕсли; 
					
					
					Если Рез1.ТипПродавца = Перечисления.ТБКТипыПродавцов.ОсновнойПродавец Тогда
						КоличествоОсновныхПродавцов	=	КоличествоОсновныхПродавцов + 1;					
					КонецЕсли; 
					
				КонецЦикла; 
				
				//проставляем в товары продавцов
				Для каждого Строка Из Товары Цикл
					Строка.Продавец1 = Продавец1;
					Строка.Продавец2 = Продавец2;
				КонецЦикла; 
				
			КонецЕсли;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Комментарий	=	"Перепроведен автоматически2" тогда отказ = ложь; КонецЕсли; // удалить после проведения чеков за май
КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	Если не Отказ тогда
		//Вик 2024-04-25 //вернуть уценку при возврате
		Если ВидОперации	=	Перечисления.ВидыОперацийЧекККМ.Возврат тогда
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ТБКУценка_Новая.Чек КАК Чек,
			      	 	             |	ТБКУценка_Новая.Номенклатура КАК Номенклатура,
			      	 	             |	ТБКУценка_Новая.Код КАК Код,
			      	 	             |	ТБКУценка_Новая.ПроцентСкидки КАК ПроцентСкидки,
			      	 	             |	ТБКУценка_Новая.ПричинаУценки КАК ПричинаУценки,
			      	 	             |	ТБКУценка_Новая.флОтправленВУт КАК флОтправленВУт,
			      	 	             |	ТБКУценка_Новая.СуммаСкидки КАК СуммаСкидки
			      	 	             |ИЗ
			      	 	             |	РегистрСведений.ТБКУценка_Новая КАК ТБКУценка_Новая
			      	 	             |ГДЕ
			      	 	             |	ТБКУценка_Новая.Чек = &Чек");
			Запрос.УстановитьПараметр("Чек", ЧекККМПродажа);
			Рез = Запрос.Выполнить().Выбрать();
			Пока Рез.Следующий() цикл
				Рег = РегистрыСведений.ТБКУценка_Новая.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Рег, Рез);
				рег.Чек = Ссылка;
				Рег.Записать();
			КонецЦикла;				
		КонецЕсли;
		//		  
		
		//Вик 2024-09-11
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ТБКМаркиДляСписания.Чек КАК Чек
		      	 	             |ИЗ
		      	 	             |	РегистрСведений.ТБКМаркиДляСписания КАК ТБКМаркиДляСписания
		      	 	             |ГДЕ
		      	 	             |	ТБКМаркиДляСписания.Чек = &Чек
		      	 	             |
		      	 	             |СГРУППИРОВАТЬ ПО
		      	 	             |	ТБКМаркиДляСписания.Чек");
		Запрос.УстановитьПараметр("Чек", ЧекККМПродажа);
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() тогда
			Рег = РегистрыСведений.ТБКМаркиДляСписания.СоздатьНаборЗаписей();
			Рег.Отбор.Чек.Установить(Рез.Чек);
			Рег.Записать();
		КонецЕсли;
		//

	КонецЕсли;
	
КонецПроцедуры
  