
&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	Если не Отказ тогда
		//Вик 2024-09-11
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ТБКМаркиДляСписания.Чек КАК Чек
			      	 	             |ИЗ
			      	 	             |	РегистрСведений.ТБКМаркиДляСписания КАК ТБКМаркиДляСписания
			      	 	             |ГДЕ
			      	 	             |	ТБКМаркиДляСписания.Чек = &Чек
			      	 	             |
			      	 	             |СГРУППИРОВАТЬ ПО
			      	 	             |	ТБКМаркиДляСписания.Чек");
			Запрос.УстановитьПараметр("Чек", ЧекККМПродажа);
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Рег = РегистрыСведений.ТБКМаркиДляСписания.СоздатьНаборЗаписей();
				Рег.Отбор.Чек.Установить(Рез.Чек);
				Рег.Записать();
			КонецЕсли;
			//
	КонецЕсли;
КонецПроцедуры
