
&Вместо("ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента")
Процедура ТБКПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения)
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Вик 2021_09_07 
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") и РежимЗаписи	=	РежимЗаписиДокумента.Запись тогда
		Возврат;
	КонецЕсли;
	//КонецВик
	
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ПроверитьДатыЗапретаИзмененияДанных(Источник, Отказ);

КонецПроцедуры
