
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗапроса = ИнтеграцияЕГАИСКлиентСервер.ПараметрыЗапросаКлассификатора();
	
	РезультатОперации = ИнтеграцияЕГАИСКлиент.СформироватьЗапросАлкогольнойПродукции(ПараметрыЗапроса);
	
	Если НЕ РезультатОперации.Результат Тогда
		Возврат;
	Иначе
		Предупреждение(НСтр("ru = 'Запрос на загрузку классификатора сформирован.'"), 10);
	КонецЕсли;
	
КонецПроцедуры