
&Вместо("АнализТекстаОшибкиОборудования")
Функция ТБКАнализТекстаОшибкиОборудования(ИдентификаторУстройства, Знач ПараметрыПодключения, Знач ТекстОшибки)
	
	Результат = Новый Структура;
	Результат.Вставить("ЛокальнаяОбработкаОшибки", Ложь);
	Результат.Вставить("КраткоеОписание", "");
	Результат.Вставить("ОписаниеОшибки", "");
	
	ДрайверПоставляетсяВКонфигурации = ДрайверПоставляетсяВКонфигурации(ИдентификаторУстройства);

	ТекущаяВерсияДрайвера = "";
	АктуальнаяВерсияДрайвера = "";
	УстановленаАктуальнаяВерсияДрайвера = Истина;
	Если ПараметрыПодключения <> Неопределено Тогда
		ТекущаяВерсияДрайвера = ПараметрыПодключения.ВерсияДрайвера;
		АктуальнаяВерсияДрайвера = АктуальнаяВерсияДрайвера(ПараметрыПодключения.ИДУстройства);
		Если ЗначениеЗаполнено(АктуальнаяВерсияДрайвера) И АктуальнаяВерсияДрайвера <> ТекущаяВерсияДрайвера Тогда
			УстановленаАктуальнаяВерсияДрайвера = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ДрайверПоставляетсяВКонфигурации И УстановленаАктуальнаяВерсияДрайвера Тогда
		
		КлассОшибки = КлассОшибки(ТекстОшибки);
		Результат.ЛокальнаяОбработкаОшибки = КлассОшибки.ЛокальнаяОбработкаОшибки;
		Результат.ОписаниеОшибки = ТекстОшибки + Символы.ПС + КлассОшибки.ПодробноеОписание;
		Результат.КраткоеОписание = КлассОшибки.КраткоеОписание;
		
	ИначеЕсли Не ДрайверПоставляетсяВКонфигурации Тогда
		Результат.ЛокальнаяОбработкаОшибки = Истина;
		ПодробноеОписание = 
			НСтр("ru = 'Используемый драйвер оборудования не сертифицирован или снят с поддержки.'") + Символы.ПС +  
			НСтр("ru = 'Обратитесь, пожалуйста, за помощью к поставщику драйвера.'");
			
		//Марк 2026-09-25
		ПодробноеОписание = "Проверьте ККТ";
		//КоенцМарк
		Результат.ОписаниеОшибки = ТекстОшибки + Символы.ПС + ПодробноеОписание;
		Результат.КраткоеОписание = НСтр("ru = 'Драйвер не сертифицирован'");
	ИначеЕсли Не УстановленаАктуальнаяВерсияДрайвера Тогда
		Результат.ЛокальнаяОбработкаОшибки = Истина;
		ПодробноеОписание = 
			СтрШаблон(НСтр("ru = 'Версия этого драйвера устарела, текущая версия драйвера %1, актуальная версия драйвера %2.'"), 
				ТекущаяВерсияДрайвера, 
				АктуальнаяВерсияДрайвера) + 
			Символы.ПС +  
			НСтр("ru = 'Обновите драйвер для корректной работы.'");
		Результат.КраткоеОписание = НСтр("ru = 'Устаревшая версия драйвера'");
		Результат.ОписаниеОшибки = ТекстОшибки + Символы.ПС + ПодробноеОписание;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
