Функция НоменклатураУникальна(НоменклатураСсылка) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    СоставГруппДляПроцентов.Номенклатура
                   |ИЗ
                   |    РегистрСведений.СоставГруппДляПроцентов КАК СоставГруппДляПроцентов
                   |ГДЕ
                   |    СоставГруппДляПроцентов.Номенклатура = &НоменклатураСсылка
                   |";
    Запрос.УстановитьПараметр("НоменклатураСсылка", НоменклатураСсылка);
                                           
    Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
КонецФункции