Процедура ПередЗаписью(Отказ, Замещение)
	
	// Проверка на уникальность значений измерения номенклатуры.
	// Значение номенклатуры должно быть уникальным во всем регистре,
	// т.к. одна и та же номенклатура не может входить в разные группы для %.
	// (Отмена записи работает при повторении номенклатуры более 2 раз).
    МассивНоменклатуры = Новый Массив;
	
    Для Каждого Запись ИЗ ЭтотОбъект Цикл       
        МассивНоменклатуры.Добавить(Запись.Номенклатура); 
    КонецЦикла;
		
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    СУММА(1) КАК Счетчик,
                   |    ПРЕДСТАВЛЕНИЕ(СоставГруппДляПроцентов.Номенклатура) КАК ПредставлениеНоменклатуры
                   |ИЗ
                   |    РегистрСведений.СоставГруппДляПроцентов КАК СоставГруппДляПроцентов
                   |ГДЕ
                   |    СоставГруппДляПроцентов.Номенклатура В(&МассивНоменклатуры)
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    СоставГруппДляПроцентов.Номенклатура
                   |
                   |ИМЕЮЩИЕ
                   |    СУММА(1) > 1";
				   
    Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
                                           
    Результат = Запрос.Выполнить().Выбрать();
    Пока Результат.Следующий() Цикл
		Отказ = Истина;
        Сообщить("Обнаружено повторение номенклатуры [" + Результат.ПредставлениеНоменклатуры + "] в составе другой группы для %. Данные не записаны!", СтатусСообщения.ОченьВажное);
    КонецЦикла;
КонецПроцедуры