//Перем МожноЗакрытьФорму;
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
		
	Если (Событие = "Штрихкод" Или Событие = "ПолученШтрихкод")  Тогда
		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
		ЭтотОбъект, 
		Источник, 
		Событие, 
		Данные);
		
		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСоСканераСтруктура.Штрихкод);
		
		НужнаяНоменклатура = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоКуару(Штрихкод);
		
		Если НужнаяНоменклатура <> Неопределено Тогда
		
			НужнаяХарактеристика = ВладелецФормы.ПолучитьХарактеристикуНоменклатуры(НужнаяНоменклатура, Штрихкод); 	
		
		КонецЕсли;
				
		Отбор	=	новый Структура;
		Отбор.Вставить("Номенклатура",НужнаяНоменклатура);
		Если ИспользоватьХарактеристики(НужнаяНоменклатура) Тогда
			Отбор.Вставить("Характеристика",НужнаяХарактеристика);
		КонецЕсли;
		
		Строки	=	ВладелецФормы.Объект.Товары.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Товара со штрихкодам " + Штрихкод + " нет в табличной части");
			Возврат;  
			
		иначе        
								
			НужнаяСтрока	=	Строки[0];
			Если НужнаяСтрока.Количество <> НужнаяСтрока.КоличествоФакт Тогда
				НужнаяСтрока.КоличествоФакт	=	НужнаяСтрока.КоличествоФакт + 1;
			Иначе
				Сообщить("Нельзя проставить Количество факт больше чем количество"); 
				Возврат;
			КонецЕсли;
			
			Закрыть();
		КонецЕсли;
		
	Иначе
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользоватьХарактеристики(Номенклатура); 
	Возврат Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИспользоватьПодключаемоеОборудование	= Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры
