
&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ТБКПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если  Объект.Номенклатура		=	ПолучитьНомПроизв() тогда
		Если не ЗначениеЗаполнено(Объект.Цена) тогда
			Сообщить("Не заполнена цена!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если не Отказ тогда
		Если Не ЗначениеЗаполнено(Объект.НомерБукета) тогда
			Объект.НомерБукета	=	ПолучитьНомерБукета();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомПроизв()
	Возврат Справочники.Номенклатура.НайтиПоНаименованию("Произвольный букет")	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьНомерБукета()
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЕстьNULL(МАКСИМУМ(ТБК_ДанныеПоПроизвольнымБукетам.НомерБукета),0) КАК НомерБукета
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ДанныеПоПроизвольнымБукетам КАК ТБК_ДанныеПоПроизвольнымБукетам");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Рез.Количество() = 0 тогда
		Возврат Рез[0].НомерБукета + 1;
	иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Номенклатура		=	ПолучитьНомПроизв();
		Объект.КоличествоУпаковок	=	1;   
		Объект.Количество			=	1;
		Объект.НомерБукета			=	0;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ТБКПолучитьРозничныеЦеныПослеНаСервере()
	Для каждого Строка из Объект.Товары Цикл
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ДействующиеЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		      	 	             |ИЗ
		      	 	             |	РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
		      	 	             |			,
		      	 	             |			Номенклатура = &Номенклатура
		      	 	             |				И Характеристика = &Характеристика) КАК ДействующиеЦеныНоменклатурыСрезПоследних");
		Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",Строка.Характеристика);

		Рез = Запрос.Выполнить().Выгрузить();
		Если рез.Количество() >0 тогда		
			Строка.Цена		=	 рез[0].Цена;
			Если Строка.КоличествоУпаковок >0 тогда
				Строка.Сумма	=	 рез[0].Цена * Строка.КоличествоУпаковок;
			иначе
				Строка.Сумма	=	 рез[0].Цена * Строка.Количество;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ТБКПолучитьРозничныеЦеныПосле(Команда)
	ТБКПолучитьРозничныеЦеныПослеНаСервере();
КонецПроцедуры

