
&Вместо("ИспользуютсяПодарочныеСертификаты")
Функция ТБКИспользуютсяПодарочныеСертификаты()
	Возврат Ложь;
	//// Вставить содержимое метода.
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
КонецФункции

Функция УдалитьПустую() экспорт
	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 100
	      	 	             |	Номенклатура.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.Номенклатура КАК Номенклатура
	      	 	             |ГДЕ
	      	 	             |	(Номенклатура.Наименование = """"
	      	 	             |			ИЛИ Номенклатура.ПометкаУдаления)
	      	 	             |	И НЕ Номенклатура.ЭтоГруппа");
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() цикл
		Запрос	=	новый Запрос("ВЫБРАТЬ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		      	 	             |ИЗ
		      	 	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		      	 	             |ГДЕ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0");
		Остатки = Запрос.Выполнить().Выбрать();
		Запрос.УстановитьПараметр("Номенклатура",Рез.Ссылка);

		Если Остатки.Следующий() тогда Продолжить; КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Удалена номенклатура: "+Рез.Ссылка);
		Об = Рез.Ссылка.ПолучитьОбъект();
		Об.Удалить();
		
	КонецЦикла;
КонецФункции