
&Вместо("ИспользуютсяПодарочныеСертификаты")
Функция ТБКИспользуютсяПодарочныеСертификаты()
	Возврат Ложь;
	//// Вставить содержимое метода.
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
КонецФункции

Функция УдалитьПустую() экспорт
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Зашли");

	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 300
	      	 	             |	Номенклатура.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.Номенклатура КАК Номенклатура
	      	 	             |ГДЕ
	      	 	             |	(Номенклатура.Наименование = """"
	      	 	             |			ИЛИ Номенклатура.ПометкаУдаления)
	      	 	             |	И НЕ Номенклатура.ЭтоГруппа");
	Рез = Запрос.Выполнить().Выбрать();
	
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Количество: "+Рез.Количество());

	Ном = 0;
	Пока Рез.Следующий() цикл
		Ном = Ном+1;
		Запрос	=	новый Запрос("ВЫБРАТЬ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		      	 	             |ИЗ
		      	 	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		      	 	             |ГДЕ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0");
		Запрос.УстановитьПараметр("Номенклатура",Рез.Ссылка);
		Остатки = Запрос.Выполнить().Выбрать();

		Если Остатки.Следующий() тогда 
			ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Есть остаток: "+Рез.Ссылка);
			Продолжить; 
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Удалена номенклатура: "+Рез.Ссылка);
		Об = Рез.Ссылка.ПолучитьОбъект();
		Об.Удалить();
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Обработано: "+Ном);

КонецФункции

&Вместо("ПроверитьПринадлежностьХарактеристикиИУпаковкиВладельцу")
Функция ТБКПроверитьПринадлежностьХарактеристикиИУпаковкиВладельцу(Номенклатура, Характеристика, Упаковка)
	
	СтруктураВозврата = Новый Структура("Характеристика, Упаковка, ХарактеристикиИспользуются");
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		СтруктураВозврата.Характеристика             = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		СтруктураВозврата.Упаковка                   = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		СтруктураВозврата.ХарактеристикиИспользуются = Ложь;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
		Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(СпрУпаковки.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)) КАК Упаковка,
	|	ЕСТЬNULL(СпрХарактеристики.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры)
	|			ИЛИ СпрНоменклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХарактеристикиИспользуются
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристики
	|		ПО (ВЫБОР
	|				КОГДА СпрНоменклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры)
	|					ТОГДА СпрНоменклатура.ВидНоменклатуры
	|				КОГДА СпрНоменклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ = СпрХарактеристики.Владелец)
	|			И (СпрХарактеристики.Ссылка = &Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК СпрУпаковки
	|		ПО (ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ СпрНоменклатура.НаборУпаковок
	|			КОНЕЦ = СпрУпаковки.Владелец)
	|			И (СпрУпаковки.Ссылка = &Упаковка)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура";
	
	//Марк-2025-11-19 https://jira.tabkn.ru/browse/KRO-83 в этой заявке выяснилась проблема
	//Упаковка заполняется из штрихкода, а это условие перезаполняет на пустую упаковку, из за этого цена встает не верной
	//Вырезал условие, так как в номенклатуре НаборУпаковок никто не смотрит
	УсловиеДляУдалени = "(ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ СпрНоменклатура.НаборУпаковок
	|			КОНЕЦ = СпрУпаковки.Владелец)
	|			И ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеДляУдалени, ""); 
	//КонецМарк
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
    Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
	
	Возврат СтруктураВозврата;
	
КонецФункции
