
&Вместо("ИспользуютсяПодарочныеСертификаты")
Функция ТБКИспользуютсяПодарочныеСертификаты()
	Возврат Ложь;
	//// Вставить содержимое метода.
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
КонецФункции

Функция УдалитьПустую() экспорт
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Зашли");

	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 300
	      	 	             |	Номенклатура.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.Номенклатура КАК Номенклатура
	      	 	             |ГДЕ
	      	 	             |	(Номенклатура.Наименование = """"
	      	 	             |			ИЛИ Номенклатура.ПометкаУдаления)
	      	 	             |	И НЕ Номенклатура.ЭтоГруппа");
	Рез = Запрос.Выполнить().Выбрать();
	
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Количество: "+Рез.Количество());

	Ном = 0;
	Пока Рез.Следующий() цикл
		Ном = Ном+1;
		Запрос	=	новый Запрос("ВЫБРАТЬ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		      	 	             |ИЗ
		      	 	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		      	 	             |ГДЕ
		      	 	             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0");
		Запрос.УстановитьПараметр("Номенклатура",Рез.Ссылка);
		Остатки = Запрос.Выполнить().Выбрать();

		Если Остатки.Следующий() тогда 
			ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Есть остаток: "+Рез.Ссылка);
			Продолжить; 
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Удалена номенклатура: "+Рез.Ссылка);
		Об = Рез.Ссылка.ПолучитьОбъект();
		Об.Удалить();
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Информация", УровеньЖурналаРегистрации.Примечание,,,"Обработано: "+Ном);

КонецФункции