
&После("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) И ЭтоГруппа = Ложь Тогда
		Если ВидНоменклатуры.Наименование =	"Товар (пр. ТМЦ)" Тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();		
		ИначеЕсли ВидНоменклатуры.Наименование =	"Табак (х)" Тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		//Марк 2026-01-20 https://jira.tabkn.ru/browse/KRO-92
		ИначеЕсли ВидНоменклатуры.Наименование =	"Табак" Тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		ИначеЕсли ВидНоменклатуры.Наименование =	"Одежда" Тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		КонецЕсли;
		//КонецМарк
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	
	//Вик 2026-03-26
	Если Найти(Описание, "Доступна поштучная продажа") Тогда  
		ОбщегоНазначенияВызовСервера.УстановитьНастройки_ПоштучнаяПродажа(Ссылка);
	КонецЕсли;
	//
	
	Если ЭтоГруппа = Ложь Тогда
		Если Ссылка.ВидНоменклатуры.ОсобенностьУчета  = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция Тогда 
			ОбщегоНазначенияВызовСервера.ЗаполнитьВидПродукцииГИСМТ(Ссылка, "Табачная продукция");
		КонецЕсли; 
		
		Если ВидНоменклатуры.Наименование = "Напитки" Тогда
			ОбщегоНазначенияВызовСервера.ЗаполнитьВидПродукцииГИСМТ(Ссылка, "Безалкогольные напитки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
