
&После("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) тогда
		Если ВидНоменклатуры.Наименование =	"Товар (пр. ТМЦ)" тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();		
		ИначеЕсли ВидНоменклатуры.Наименование =	"Табак (х)" тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		//Марк 2026-01-20 https://jira.tabkn.ru/browse/KRO-92
		ИначеЕсли ВидНоменклатуры.Наименование =	"Табак" тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		ИначеЕсли ВидНоменклатуры.Наименование =	"Одежда" тогда
			ОсобенностьУчета	=	Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;
		КонецЕсли;
		//КонецМарк
	КонецЕсли;
	
КонецПроцедуры
