
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СвойстваЭД = РеквизитыЭД(ПараметрКоманды);

	//ЭДВладелец = ВладелецЭД(ПараметрКоманды);
	
	Если СвойстваЭД.ВидЭД = ПредопределенноеЗначение("Перечисление.ВидыЭД.ПроизвольныйЭД") Тогда
		ОткрытьСтруктуруПодчиненности(ПараметрКоманды, ПараметрыВыполненияКоманды);
		
	Иначе
		ЭлектронныеДокументыКлиент.ОткрытьДеревоЭД(СвойстваЭД.ВладелецФайла, ПараметрыВыполненияКоманды, ПараметрКоманды);

	КонецЕсли;
	
КонецПроцедуры


// Служебные процедуры и функции
//
&НаСервере
Функция РеквизитыЭД(СсылкаЭД)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаЭД, "ВидЭД, ВладелецФайла");
	
КонецФункции
 
&НаКлиенте
Процедура ОткрытьСтруктуруПодчиненности(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СвойстваЭД = РеквизитыЭД(ПараметрКоманды);

	ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", СвойстваЭД.ВладелецФайла),
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
				ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры




