
&Вместо("ПрименитьРезультатРасчетаСкидокКОбъекту")
Процедура ТБКПрименитьРезультатРасчетаСкидокКОбъекту(Объект, ИмяТЧ, РезультатРасчетаСкидокНаценок, ЕстьБонусы)
	Если ТипЗнч(Объект.СкидкиНаценки) = Тип("ТаблицаЗначений") Тогда
		Объект.СкидкиНаценки = РезультатРасчетаСкидокНаценок.Скопировать();
	Иначе
		Объект.СкидкиНаценки.Загрузить(РезультатРасчетаСкидокНаценок);
	КонецЕсли;
	АвтоматическиеСкидкиНаценки = РезультатРасчетаСкидокНаценок.Скопировать();
	
	// Заполнение скидок в табличной части "Товары".
	АвтоматическиеСкидкиНаценки.Свернуть("КлючСвязи", "Сумма");
	АвтоматическиеСкидкиНаценки.Индексы.Добавить("КлючСвязи");
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		
		СтрокаТаблицы = АвтоматическиеСкидкиНаценки.Найти(СтрокаТЧ.КлючСвязи, "КлючСвязи");
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТЧ.СуммаАвтоматическойСкидки = 0;
			СуммаАвтоматическойСкидки          = 0; // Для точного расчета процента автоматической скидки.
		Иначе
			СтрокаТЧ.СуммаАвтоматическойСкидки = СтрокаТаблицы.Сумма;
			СуммаАвтоматическойСкидки          = СтрокаТаблицы.Сумма; // Для точного расчета процента автоматической скидки.
		КонецЕсли;
		
		// Применение автоматической скидки.
		СуммаБезСкидки = СтрокаТЧ.КоличествоУпаковок * СтрокаТЧ.Цена;
		
		//Если СуммаБезСкидки <> 0 Тогда 
		Попытка
			Если СуммаБезСкидки <> 0 и не СтрокаТЧ.флПроставленаСкидкаПоАкции Тогда
				СтрокаТЧ.ПроцентРучнойСкидки = 100 * СтрокаТЧ.СуммаРучнойСкидки / СуммаБезСкидки;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		СуммаСкидки = СуммаАвтоматическойСкидки + СтрокаТЧ.СуммаРучнойСкидки + ?(ЕстьБонусы, СтрокаТЧ.СуммаСкидкиОплатыБонусом, 0);
		
		СтрокаТЧ.ПроцентАвтоматическойСкидки = ?(СуммаБезСкидки = 0, 0 , 100 * СуммаАвтоматическойСкидки / СуммаБезСкидки);
		
		СтрокаТЧ.Сумма    = СуммаБезСкидки - ?(СуммаСкидки > СуммаБезСкидки, СуммаБезСкидки, СуммаСкидки);
		СтрокаТЧ.СуммаНДС = РассчитатьСуммуНДС(СтрокаТЧ, Объект.ЦенаВключаетНДС);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = ОбработкаТабличнойЧастиТоварыКлиентСервер.СуммаДокумента(Объект[ИмяТЧ], Объект.ЦенаВключаетНДС);
	Объект.СкидкиРассчитаны = Истина;

КонецПроцедуры
