Процедура ТБКЗаполнитьДанныеПоШтрихкодамEAN(ДанныеПоШтрихкодамEAN, ПараметрыСканирования, МРЦ = Неопределено) экспорт
	
	МассивШтрихкодов = ДанныеПоШтрихкодамEAN.ВыгрузитьКолонку("ШтрихкодEAN");
	
	Если ПараметрыСканирования <> Неопределено И
		ПараметрыСканирования.Свойство("ДополнительныеПараметры") И
		ПараметрыСканирования.ДополнительныеПараметры.Свойство("ПараметрыПоискаРМК") Тогда
		ПараметрыПоискаРМК = ПараметрыСканирования.ДополнительныеПараметры.ПараметрыПоискаРМК;
	Иначе
		ПараметрыПоискаРМК = Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Номенклатура.Ссылка) КАК ПредставлениеНоменклатуры,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодEAN,
	|	&ОпределениеВидаПродукции КАК ВидПродукции,
	|	&ОпределениеПризнакаМаркируемаяПродукция КАК МаркируемаяПродукция,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Количество,
	|	&УсловиеОсобенностьУчета КАК ПродукцияИС
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ШтрихкодыНоменклатуры.Владелец = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ШтрихкодыНоменклатуры.Владелец = ОписаниеНоменклатурыИС.Номенклатура
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)";
	
	ИнтеграцияИСРТ.ОпределитьВидПродукцииТекстаЗапроса(ТекстЗапроса, "Номенклатура");
	ИнтеграцияИСРТ.ОпределитьОсобенностиУчетаТекстаЗапроса(ТекстЗапроса, "Номенклатура",, Истина);
	ОпределениеМаркируемаяПродукция = ИнтеграцияИСРТ.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса("Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОпределениеПризнакаМаркируемаяПродукция", ОпределениеМаркируемаяПродукция);
		
	//Вик 2024-07-02------------------------------------------------------ 
	//Запрос = Новый Запрос(ТекстЗапроса);
	Запрос = Новый запрос();
	Если МРЦ <> Неопределено тогда
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	И ШтрихкодыНоменклатуры.Характеристика.Наименование = &Наименование"; 
		Запрос.УстановитьПараметр("Наименование", МРЦ);
		
	КонецЕсли; 
	Запрос.Текст = ТекстЗапроса;
	//--------------------------------------------------------------------
	
	Запрос.УстановитьПараметр("Штрихкоды", ДанныеПоШтрихкодамEAN.ВыгрузитьКолонку("ШтрихкодEAN"));	
	
	//--------------------------------------------------------------------
	
	флВозможноЭтоБлок	=	Ложь;
	Если Запрос.Выполнить().Пустой() тогда // дополнительно для блока
		флВозможноЭтоБлок = Истина;
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст, "И ШтрихкодыНоменклатуры.Характеристика.Наименование = &Наименование", "");
	КонецЕсли;
	//--------------------------------------------------------------------
	
	ДанныеПоШтрихкодам = Запрос.Выполнить().Выгрузить();    
	
	//Вик 2024-09-24//----------------------------------------------------     
	//ищем в дублируещем регистре ТБК_Штрихкоды (регистр делал Илья Б.)	
	Если ДанныеПоШтрихкодам.Количество() = 0 тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.Штрихкоды", "РегистрСведений.ТБК_Штрихкоды"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,", ""); 
		
		ДанныеПоШтрихкодам = Запрос.Выполнить().Выгрузить();    
		ДанныеПоШтрихкодам.Колонки.Добавить("Характеристика");
		
		Если МРЦ <> Неопределено тогда
			Для каждого Строка Из ДанныеПоШтрихкодам цикл
				Запрос	=	Новый Запрос("ВЫБРАТЬ
				      	 	             |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
				      	 	             |ИЗ
				      	 	             |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				      	 	             |ГДЕ
				      	 	             |	ХарактеристикиНоменклатуры.Наименование = &Наименование
				      	 	             |	И ХарактеристикиНоменклатуры.Владелец = &Владелец");
				Запрос.УстановитьПараметр("Наименование", МРЦ);	
				Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура);	
				Рез = Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() тогда
					Строка.Характеристика	=	рез.Ссылка;
				КонецЕсли;

			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если флВозможноЭтоБлок тогда
		Для каждого Строка Из ДанныеПоШтрихкодам цикл
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			      	 	             |ГДЕ
			      	 	             |	ХарактеристикиНоменклатуры.Наименование = &Наименование
			      	 	             |	И ХарактеристикиНоменклатуры.Владелец = &Владелец");
			Запрос.УстановитьПараметр("Наименование", МРЦ);	
			Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура);	
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Строка.Характеристика	=	рез.Ссылка;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	//--------------------------------------------------------------------
	
	ТребуетсяОбработкаШтрихкодаНовымСтрокам = Истина;
	// Заполним таблицу.
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ШтрихкодEAN");
	ДанныеПоШтрихкодамРезультат = ДанныеПоШтрихкодамEAN.СкопироватьКолонки(); 
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодамEAN Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы);
		
		// Определим, требуется ли обработка штрихкода средствами РТ.
		НайденаПродукцияИС = Ложь;
		
		СтрокиШтрихкодов = ДанныеПоШтрихкодам.НайтиСтроки(ПараметрыПоиска);
		Для Каждого СтрокаШтрихкод Из СтрокиШтрихкодов Цикл
			Если СтрокаШтрихкод.ПродукцияИС И СтрокаШтрихкод.МаркируемаяПродукция Тогда
				НайденаПродукцияИС = Истина;
				ТребуетсяОбработкаШтрихкодаНовымСтрокам = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТребуетсяОбработкаШтрихкода = НЕ НайденаПродукцияИС;
		
		// Добавим найденные штрихкоды в результирующую таблицу.
		Для Каждого СтрокаШтрихкод Из СтрокиШтрихкодов Цикл
			СтрокаРезультат = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаШтрихкод);
			СтрокаРезультат.ТребуетсяОбработкаШтрихкода = ТребуетсяОбработкаШтрихкода;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодамEAN Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы);
		СтрокиШтрихкодов = ДанныеПоШтрихкодам.НайтиСтроки(ПараметрыПоиска);
		
		// Добавим ненайденные штрихкоды, если сканирование выполняется не в форме проверки и подбора.
		Если СтрокиШтрихкодов.Количество() = 0 Тогда
			// Не нашли штрихкод.
			СтрокаРезультат = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаТаблицы);
			СтрокаРезультат.ТребуетсяОбработкаШтрихкода = ТребуетсяОбработкаШтрихкодаНовымСтрокам;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПараметрыПоискаРМК = Неопределено Тогда
		
		Штрихкод = ПараметрыПоискаРМК.ШтрихкодОригинальный;
		ЭтоШтрихкодНоменклатуры = Ложь;
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодамРезультат Цикл
			Если Штрихкод = СтрокаДанных.ШтрихкодEAN Тогда
				ЭтоШтрихкодНоменклатуры = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоШтрихкодНоменклатуры Тогда
			ДанныеПоШтрихкодамРезультат.Очистить();
		КонецЕсли;
		
		Если ПараметрыПоискаРМК.Свойство("ДанныеРучногоСопоставления") Тогда
			ДанныеРучногоСопоставления = ПараметрыПоискаРМК.ДанныеРучногоСопоставления;
			ДанныеПоШтрихкодамРезультат.Очистить();
			
			НоваяСтрока = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеРучногоСопоставления, , "Упаковка");
			Если ТипЗнч(ДанныеРучногоСопоставления.Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
				НоваяСтрока.Упаковка = ДанныеРучногоСопоставления.Упаковка;
			КонецЕсли;
			НоваяСтрока.ШтрихкодEAN = ДанныеРучногоСопоставления.Штрихкод;
			Если Не ЗначениеЗаполнено(НоваяСтрока.ШтрихкодEAN) И МассивШтрихкодов.Количество() > 0 Тогда
				НоваяСтрока.ШтрихкодEAN = МассивШтрихкодов[0];
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Количество) Тогда
				НоваяСтрока.Количество = 1;
			КонецЕсли;
			
			ДанныеПродукции = ОбщегоНазначенияИС.СвойстваМаркируемойПродукции(НоваяСтрока.Номенклатура);
			НоваяСтрока.ВидПродукции = ДанныеПродукции.ВидПродукции;
			НоваяСтрока.МаркируемаяПродукция = ДанныеПродукции.МаркируемаяПродукция;
			НоваяСтрока.ПредставлениеНоменклатуры = НоваяСтрока.Номенклатура;
		КонецЕсли;
		
		ЭтоМаркаОстатков = Ложь;
		Если Не ЭтоШтрихкодНоменклатуры Тогда
			Для Каждого ШтрихкодМассива Из ДанныеПоШтрихкодамEAN Цикл
				Если Лев(ШтрихкодМассива.ШтрихкодEAN, 2) = "29" Или Лев(ШтрихкодМассива.ШтрихкодEAN, 3) = "029" Тогда
					ЭтоМаркаОстатков = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ЭтоМаркаКТекущейСтроке = ПараметрыПоискаРМК.ПараметрыДляОбработкиШтрихкода.Свойство("ТекущаяНоменклатура");
		Если ЭтоМаркаОстатков И ЭтоМаркаКТекущейСтроке Тогда
			ДанныеПоШтрихкодамРезультат.Очистить();
			НоваяСтрока = ДанныеПоШтрихкодамРезультат.Добавить();
			НоваяСтрока.Номенклатура = ПараметрыПоискаРМК.ПараметрыДляОбработкиШтрихкода.ТекущаяНоменклатура;
			НоваяСтрока.Характеристика = ПараметрыПоискаРМК.ПараметрыДляОбработкиШтрихкода.ТекущаяХарактеристика;
			Если Не ЗначениеЗаполнено(НоваяСтрока.ШтрихкодEAN) И МассивШтрихкодов.Количество() > 0 Тогда
				НоваяСтрока.ШтрихкодEAN = МассивШтрихкодов[0];
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Количество) Тогда
				НоваяСтрока.Количество = 1;
			КонецЕсли;
			
			ДанныеПродукции = ОбщегоНазначенияИС.СвойстваМаркируемойПродукции(НоваяСтрока.Номенклатура);
			НоваяСтрока.ВидПродукции = ДанныеПродукции.ВидПродукции;
			НоваяСтрока.МаркируемаяПродукция = ДанныеПродукции.МаркируемаяПродукция;
			НоваяСтрока.ПредставлениеНоменклатуры = НоваяСтрока.Номенклатура;
		КонецЕсли;
		
		НайденаНоменклатура = Ложь;
		Для Каждого СтрокаРезультата Из ДанныеПоШтрихкодамРезультат Цикл
			Если ЗначениеЗаполнено(СтрокаРезультата.Номенклатура) Тогда
				НайденаНоменклатура = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденаНоменклатура Тогда
			ПараметрыПоискаРМК.ФильтрПоискаПоШтрихкоду.Вставить("ЗаданнаяТаблицаНоменклатуры", ДанныеПоШтрихкодамРезультат);
		КонецЕсли;
		ДанныеШтрихкодаРМК = Новый Структура;
		РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, ПараметрыПоискаРМК, ДанныеШтрихкодаРМК);
		Если НайденаНоменклатура Тогда
			ПараметрыПоискаРМК.ФильтрПоискаПоШтрихкоду.Удалить("ЗаданнаяТаблицаНоменклатуры");
		КонецЕсли;
		ДанныеШтрихкодаРМК.Вставить("ПараметрыДляОбработкиШтрихкода", ПараметрыПоискаРМК.ПараметрыДляОбработкиШтрихкода);
		
		Если Не НайденаНоменклатура И Не ЭтоШтрихкодНоменклатуры И ДанныеПоШтрихкодамРезультат.Количество() > 0 Тогда
			Если ДанныеШтрихкодаРМК.ЗначенияПоиска.Количество() > 0 Тогда
				Для Каждого ЗначениеПоиска Из ДанныеШтрихкодаРМК.ЗначенияПоиска Цикл
					Если ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров")
						И ЗначениеЗаполнено(ЗначениеПоиска.Владелец.Номенклатура) Тогда
						СтрокаДанных = ДанныеПоШтрихкодамРезультат[0];
						
						ДанныеПродукции = ОбщегоНазначенияИС.СвойстваМаркируемойПродукции(ЗначениеПоиска.Номенклатура);
						СтрокаДанных.ВидПродукции = ДанныеПродукции.ВидПродукции;
						СтрокаДанных.МаркируемаяПродукция = ДанныеПродукции.МаркируемаяПродукция;
						СтрокаДанных.Номенклатура              = ЗначениеПоиска.Номенклатура;
						СтрокаДанных.ПредставлениеНоменклатуры = ЗначениеПоиска.Номенклатура;
						НайденаНоменклатура = Истина;
						ДанныеПоШтрихкодамРезультат.ЗаполнитьЗначения(Ложь, "ТребуетсяОбработкаШтрихкода");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		НайденоНесколькоПозиций = Ложь;
		Если НайденаНоменклатура Тогда
			СтруктураПозиции = Новый Структура("Номенклатура, Характеристика, Серия, Упаковка");
			Для Каждого СтрокаТовара Из ДанныеПоШтрихкодамРезультат Цикл
				Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
					Если Не ЗначениеЗаполнено(СтруктураПозиции.Номенклатура) Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПозиции, СтрокаТовара);
					Иначе
						Если Не СтрокаТовара.Номенклатура = СтруктураПозиции.Номенклатура
							Или Не СтрокаТовара.Характеристика = СтруктураПозиции.Характеристика
							Или Не СтрокаТовара.Серия = СтруктураПозиции.Серия
							Или Не СтрокаТовара.Упаковка = СтруктураПозиции.Упаковка Тогда
								НайденоНесколькоПозиций = Истина;
								Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЭтоШтрихкодНоменклатуры И НайденоНесколькоПозиций Тогда
			ДанныеШтрихкодаРМК.ПараметрыДляОбработкиШтрихкода.Вставить("ПроверитьМаркуПослеВыбораНоменклатуры", Истина);
		КонецЕсли;
		
		Если ДанныеПоШтрихкодамРезультат.Количество() = 0 Тогда
			ШтрихкодПоискаДляСопоставления = ?(ЭтоШтрихкодНоменклатуры, Штрихкод, ДанныеШтрихкодаРМК.ПараметрыШтрихкода.ШтрихкодПоиска);
			
			НоваяСтрока = ДанныеПоШтрихкодамРезультат.Добавить();
			НоваяСтрока.ТребуетсяОбработкаШтрихкода = Истина;
			НоваяСтрока.ШтрихкодEAN = ШтрихкодПоискаДляСопоставления;
			НоваяСтрока.ДанныеШтрихкода = ДанныеШтрихкодаРМК;
		Иначе
			Если Не НайденаНоменклатура Или НайденоНесколькоПозиций Тогда
				ДанныеПоШтрихкодамРезультат.ЗаполнитьЗначения(Истина, "ТребуетсяОбработкаШтрихкода");
			КонецЕсли;
			Если НайденоНесколькоПозиций И ДанныеПоШтрихкодамРезультат.Количество() > 30 Тогда
				ДанныеПоШтрихкодамРезультат[0].ДанныеШтрихкода = ДанныеШтрихкодаРМК;
			Иначе
				ДанныеПоШтрихкодамРезультат.ЗаполнитьЗначения(ДанныеШтрихкодаРМК, "ДанныеШтрихкода");
			КонецЕсли;
		КонецЕсли;
		
		// Организация и ККТ товара
		Если НайденаНоменклатура И Не НайденоНесколькоПозиций И Не ПараметрыСканирования = Неопределено Тогда
			ЗначенияПоискаПоШК = ДанныеШтрихкодаРМК.ЗначенияПоиска;
			Если ЗначенияПоискаПоШК.Количество() = 1 Тогда
				ЗначениеПоискаПоШК = ЗначенияПоискаПоШК[0];
				Если ЗначениеПоискаПоШК.Свойство("СтруктураНайденнойНоменклатуры") Тогда
					ОрганизацияПродажи = ЗначениеПоискаПоШК.СтруктураНайденнойНоменклатуры.Организация;
					ПараметрыСканирования.Организация = ОрганизацияПродажи;
					ПараметрыСканирования.Владелец = ОрганизацияПродажи;
					
					Если ПараметрыПоискаРМК.Свойство("СоответствияККТОрганизаций") Тогда
						ПараметрыКассы = ПараметрыПоискаРМК.СоответствияККТОрганизаций.Получить(ОрганизацияПродажи);
						
						ККТОрганизации = ПараметрыКассы.ИдентификаторУстройства;
						Если ЗначениеЗаполнено(ККТОрганизации) Тогда
							ПараметрыСканирования.ККТФФД12ИСМП = ККТОрганизации;
							ПараметрыСканирования.ПодключенноеККТИСМП = ККТОрганизации;
							ПараметрыСканирования.НомерФискальногоНакопителя = ПараметрыКассы.НомерФискальногоНакопителя;
							ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ = ПараметрыКассы.ПоддерживаетПроверкуКодовМаркировки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из ДанныеПоШтрихкодамРезультат.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	ДанныеПоШтрихкодамРезультат.Свернуть(СтрСоединить(ИменаКолонок, ","));
	
	ДанныеПоШтрихкодамEAN = ДанныеПоШтрихкодамРезультат;

КонецПроцедуры

&Вместо("ОбработатьДанныеШтрихкодаПотребительскойУпаковки")
Процедура ТБКОбработатьДанныеШтрихкодаПотребительскойУпаковки(ДанныеШтрихкодаДляОбработки, ПараметрыШтрихкодаДляОбработки, Форма)
	
	//Вик 2024-10-04 Костыль на возвраты, если на складе изначально штрихкод упаковки привязали к штукам
	Попытка
		Если СтрДлина(ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки.ЗначениеШтрихкода) >40 тогда
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
			      	 	             |	ШтрихкодыУпаковокТоваров.Количество КАК Количество
			      	 	             |ИЗ
			      	 	             |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			      	 	             |ГДЕ
			      	 	             |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода");
			Запрос.УстановитьПараметр("ЗначениеШтрихкода", "ч"+ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки.ЗначениеШтрихкода); 
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				ДанныеШтрихкодаДляОбработки.Упаковка	=	Рез.Упаковка;
				ДанныеШтрихкодаДляОбработки.Количество	=	Рез.Количество;	
			КонецЕсли;			
		КонецЕсли;
	Исключение
	КонецПопытки;
	// 
	
	
	Объект                = ПараметрыШтрихкодаДляОбработки.Объект;
	РезультатОбработки    = ПараметрыШтрихкодаДляОбработки.РезультатОбработки;
	ПараметрыЗаполнения   = ПараметрыШтрихкодаДляОбработки.ПараметрыЗаполнения;
	НастройкиКэша         = ПараметрыШтрихкодаДляОбработки.НастройкиКэша;
	ПараметрыСканирования = ПараметрыШтрихкодаДляОбработки.ПараметрыСканирования;
	
	Если НЕ ДанныеШтрихкодаДляОбработки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
		И ДанныеШтрихкодаДляОбработки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.DataMatrix Тогда
		РезультатОбработки.ТекстОшибки = НСтр("ru = 'Обработка кодов DataMatrix не поддерживается. Считайте код акцизной марки.'");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.Количество) Тогда
		ДанныеШтрихкодаДляОбработки.Количество = 1;
	КонецЕсли;
	
	Если ДанныеШтрихкодаДляОбработки.Количество > 1
		И ПараметрыШтрихкодаДляОбработки.ИспользоватьУпаковкиНоменклатуры Тогда
		ДанныеШтрихкодаДляОбработки.Упаковка = Справочники.УпаковкиНоменклатуры.Упаковка(
			ДанныеШтрихкодаДляОбработки.Номенклатура, ДанныеШтрихкодаДляОбработки.Количество);
	ИначеЕсли ДанныеШтрихкодаДляОбработки.Упаковка = Неопределено Тогда
		ДанныеШтрихкодаДляОбработки.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыШтрихкодаДляОбработки.УчитыватьМРЦ
		И ДанныеШтрихкодаДляОбработки.Количество > 1
		И НЕ ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.Упаковка) Тогда
		ДанныеШтрихкодаДляОбработки.МРЦ = ДанныеШтрихкодаДляОбработки.МРЦ / ДанныеШтрихкодаДляОбработки.Количество;
	КонецЕсли;
	
	ВсегоПоПараметрамПоиска = 0;
	СтрокаДляОбработки = Неопределено;
	КонтролироватьМРЦ  = Неопределено;
	
	РазрешеноЗапрашиватьКодМаркировки = Истина;
	Если ЗначениеЗаполнено(ПараметрыСканирования)
		И ПараметрыСканирования.Свойство("РазрешеноЗапрашиватьКодМаркировки") Тогда
		РазрешеноЗапрашиватьКодМаркировки = ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки;
	КонецЕсли;
	
	ПараметрыПоиска = ИнтеграцияИСРТКлиентСервер.ПоляДляПоискаМаркированнойПродукции();
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ДанныеШтрихкодаДляОбработки);
	НайденныеСтрокиТовары = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
	Для Каждого НайденннаяСтрока Из НайденныеСтрокиТовары Цикл
		ВсегоПоПараметрамПоиска = ВсегоПоПараметрамПоиска + НайденннаяСтрока.Количество;
		
		КоэффициентУпаковки = 1;
		Если ЗначениеЗаполнено(НайденннаяСтрока.Упаковка) Тогда
			КоэффициентУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденннаяСтрока.Упаковка, "Коэффициент");
			КоэффициентУпаковки = ?(КоэффициентУпаковки = 0, 1, КоэффициентУпаковки);
		КонецЕсли;
		
		// Проверка соответствия МРЦ.
		Если КонтролироватьМРЦ = Неопределено Тогда
			КонтролироватьМРЦ = ПараметрыШтрихкодаДляОбработки.УчитыватьМРЦ
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НайденннаяСтрока, "МРЦ");
		КонецЕсли;
		Если КонтролироватьМРЦ И НЕ НайденннаяСтрока.МРЦ = ДанныеШтрихкодаДляОбработки.МРЦ  Тогда
			Продолжить;
		КонецЕсли; 
		
		//Марк 03-12-2025 https://jira.tabkn.ru/browse/ROZ-14     
		Если НайденннаяСтрока.Штрихкод = ДанныеШтрихкодаДляОбработки.Штрихкод Тогда
			СтрокаДляОбработки = НайденннаяСтрока;	
		КонецЕсли; 
		//КонецМарк
		
		// Проверка соответствия Упаковки.
		Если НайденннаяСтрока.Упаковка = ДанныеШтрихкодаДляОбработки.Упаковка И СтрокаДляОбработки = Неопределено Тогда
			СтрокаДляОбработки = НайденннаяСтрока;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ СтрокаДляОбработки = Неопределено Тогда
		КоличествоМаркируемойПродукции = ДанныеШтрихкодаДляОбработки.Количество;
		
		// Сопоставим количество продукции по данным кэша и товаров.
		Если НЕ Форма = Неопределено И РазрешеноЗапрашиватьКодМаркировки
			И ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.ВидПродукции) Тогда
			ОбновляемаяСтрока = ПроверкаИПодборПродукцииИС.ДанныеШтрихкодаДляДобавленияВКеш(ДанныеШтрихкодаДляОбработки);
			ВсегоВКеше = ПроверкаИПодборПродукцииИС.КоличествоПоДаннымКеша(Форма, ОбновляемаяСтрока);
			Если ВсегоВКеше < ВсегоПоПараметрамПоиска Тогда
				КоличествоМаркируемойПродукции = Макс(0, ДанныеШтрихкодаДляОбработки.Количество + ВсегоВКеше - ВсегоПоПараметрамПоиска);
			КонецЕсли;
		КонецЕсли;
		
		Если КоличествоМаркируемойПродукции > 0 Тогда
			Если КоличествоМаркируемойПродукции = ДанныеШтрихкодаДляОбработки.Количество
				И НЕ СтрокаДляОбработки.Упаковка = ДанныеШтрихкодаДляОбработки.Упаковка Тогда
				СтрокаДляОбработки = Неопределено;
			Иначе
				СтрокаДляОбработки.Количество = СтрокаДляОбработки.Количество + КоличествоМаркируемойПродукции;
				РезультатОбработки.ИзмененныеСтроки.Добавить(СтрокаДляОбработки);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаДляОбработки = Неопределено Тогда
		// Добавим строку.
		СтрокаДляОбработки = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляОбработки, ДанныеШтрихкодаДляОбработки);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДляОбработки, "Штрихкод")
			И ДанныеШтрихкодаДляОбработки.ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная
			И ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.EAN) Тогда
			СтрокаДляОбработки.Штрихкод = ДанныеШтрихкодаДляОбработки.EAN;
		КонецЕсли;
		РезультатОбработки.ДобавленныеСтроки.Добавить(СтрокаДляОбработки);
	Иначе
		// Заполним штрихкод при необходимости.
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДляОбработки, "Штрихкод")
			И НЕ ЗначениеЗаполнено(СтрокаДляОбработки.Штрихкод) Тогда
			Если ДанныеШтрихкодаДляОбработки.ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная
				И ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.EAN) Тогда
				СтрокаДляОбработки.Штрихкод = ДанныеШтрихкодаДляОбработки.EAN;
			Иначе
				СтрокаДляОбработки.Штрихкод = ДанныеШтрихкодаДляОбработки.Штрихкод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Подбор серии для товаров из натурального меха.
	Если ДанныеШтрихкодаДляОбработки.ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха
		И НЕ ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.Серия) Тогда
		ДанныеШтрихкодаДляОбработки.Серия = ИнтеграцияИСРТ.НайтиСоздатьСериюПоДаннымШтрихкода(ДанныеШтрихкодаДляОбработки);
	КонецЕсли;
	
	// Добавим серию в документ.
	Если ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.Серия)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Серии") Тогда
		
		ПараметрыПоиска = Новый Структура("Серия");
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ДанныеШтрихкодаДляОбработки);
		НайденныеСтрокиСерии = Объект.Серии.НайтиСтроки(ПараметрыПоиска);
		Если НайденныеСтрокиСерии.Количество() = 0 Тогда
			СтрокаСерии = Объект.Серии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСерии, ДанныеШтрихкодаДляОбработки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеШтрихкодаДляОбработки.ОбработатьБезМаркировки Тогда
		СтрокаДляОбработки.МаркируемаяПродукция = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДанныеШтрихкодаДляОбработки.ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная
		И НастройкиКэша.Штрихкоды = "ШтрихкодыУпаковок" Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим марку.
	Если ШтрихкодированиеИСРТ.ЭтоМарка(ДанныеШтрихкодаДляОбработки.Штрихкод) Тогда
		НоваяСтрокаУпаковки = Объект[НастройкиКэша.Штрихкоды].Добавить();
		НоваяСтрокаУпаковки[НастройкиКэша.ШтрихкодУпаковки] = ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаУпаковки, "КодАкцизнойМарки") Тогда
			НоваяСтрокаУпаковки.КодАкцизнойМарки = ДанныеШтрихкодаДляОбработки.Штрихкод;
		КонецЕсли;
		
		// Особенности учета алкогольной продукции.
		Если ДанныеШтрихкодаДляОбработки.ВидПродукции = Перечисления.ВидыПродукцииИС.Алкогольная Тогда
			НоваяСтрокаУпаковки.Справка2 = ДанныеШтрихкодаДляОбработки.Справка2;
			Если ДанныеШтрихкодаДляОбработки.Свойство("УпаковкаВерхнегоУровня") Тогда
				НоваяСтрокаУпаковки.ШтрихкодУпаковки = ДанныеШтрихкодаДляОбработки.УпаковкаВерхнегоУровня;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаУпаковки, "ВыбытиеБутылки") Тогда
				НоваяСтрокаУпаковки.ВыбытиеБутылки = ДанныеШтрихкодаДляОбработки.ВыбытиеБутылки;
			КонецЕсли;
		КонецЕсли;
		
		ШтрихкодированиеИСМП.ЗаполнениеСохраняемойСтрокиШтрихкодовУпаковки(
			НоваяСтрокаУпаковки,
			ДанныеШтрихкодаДляОбработки,
			ПараметрыСканирования);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаУпаковки, "КлючСвязи") Тогда
			Если Не ЗначениеЗаполнено(СтрокаДляОбработки.КлючСвязи) Тогда
				ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьКлючСвязи(Объект.Товары, СтрокаДляОбработки, "КлючСвязи");
			КонецЕсли;
			НоваяСтрокаУпаковки.КлючСвязи = СтрокаДляОбработки.КлючСвязи;
		КонецЕсли;
		
		Если НЕ Форма = Неопределено Тогда
			ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, НастройкиКэша);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
