
&НаКлиенте
Процедура НапечататьЧек(Товары, Сдача, СНО, Магазин, Кассир, ВторыеЭлектронки, флНал = Истина) экспорт
	
	//ШиринаЛенты		=	64;
	СуммаИтого		=	0;
	
	СпецСимвол	=	ПолучитьСпецСимвол(СНО); 	
	
	Fptr = ПодключитьВнешнююКомпоненту("AddIn.Fptr10");
	Fptr = Новый COMобъект("AddIn.Fptr10");
	Fptr.open();
	
	
	Если не Fptr.isOpened() тогда
		МенеджерОборудованияКлиент.ПоменятьПараметры(Истина);
		
		Fptr = ПодключитьВнешнююКомпоненту("AddIn.Fptr10");
		Fptr = Новый COMобъект("AddIn.Fptr10");
		Fptr.open();
	КонецЕсли;    
	
	Если не Fptr.isOpened() тогда
		Сообщить("Ошибка печати!");
		Возврат;
	КонецЕсли;
	
	//запрос данных из ККТ
	Fptr.setParam(Fptr.LIBFPTR_PARAM_DATA_TYPE, Fptr.LIBFPTR_DT_STATUS);
	Fptr.queryData();
	serialNumber    = Fptr.getParamString(Fptr.LIBFPTR_PARAM_SERIAL_NUMBER);
	receiptNumber   = Fptr.getParamInt(Fptr.LIBFPTR_PARAM_RECEIPT_NUMBER);
	documentNumber  = Fptr.getParamInt(Fptr.LIBFPTR_PARAM_DOCUMENT_NUMBER);
	shiftNumber     = Fptr.getParamInt(Fptr.LIBFPTR_PARAM_SHIFT_NUMBER);    	
	
	ШиринаЛенты = Fptr.getParamInt(Fptr.LIBFPTR_PARAM_RECEIPT_LINE_LENGTH);
	флЭтоНеСтандартныйФормат = Ложь;
	Если ШиринаЛенты = 48 тогда флЭтоНеСтандартныйФормат = истина; КонецЕсли;
	
	Fptr.setParam(Fptr.LIBFPTR_PARAM_FN_DATA_TYPE, Fptr.LIBFPTR_FNDT_REG_INFO);
	Fptr.fnQueryData();
	registrationNumber        = fptr.getParamString(1037);
	organizationVATIN         = fptr.getParamString(1018);
	paymentsAddress           = fptr.getParamString(1187);
	organizationName          = fptr.getParamString(1048);
	
	Fptr.setParam(Fptr.LIBFPTR_PARAM_FN_DATA_TYPE, Fptr.LIBFPTR_FNDT_FN_INFO);
	Fptr.fnQueryData();

	fnSerial            = Fptr.getParamString(Fptr.LIBFPTR_PARAM_SERIAL_NUMBER);
	fnVersion           = Fptr.getParamString(Fptr.LIBFPTR_PARAM_FN_VERSION);

	//
	
	Fptr.beginNonfiscalDocument();
	//Если флЭтоНеСтандартныйФормат тогда
	//	Стр = "ТАБАКОН";
	//	ПечатьСтроки(Fptr,Стр,2); 
	//
	//	Стр = "_________________________________________________________________";
	//	ПечатьСтроки(Fptr,Стр);    
	//КонецЕсли;
	
	ПечатьСтроки(Fptr,"Кассовый чек",2);
	
	ТоЧтоСлева		=	"Место расчетов";
	ТоЧтоСправа		=	"Магазин";
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
	
	//Товары
	Если ВторыеЭлектронки.количество()>0 тогда
		
		Для каждого Строка из Товары цикл
			ТоЧтоСлева		=	Строка(Строка.Номенклатура);
			ТоЧтоСправа		=	Строка(Окр(Строка.Цена/2,2)) + ".00      *" +Строка(Строка.КоличествоУпаковок)+"   =" + Строка(Окр(Строка.Цена/2,2)*Строка.КоличествоУпаковок)+СпецСимвол;
			Если СтрДлина(ТоЧтоСлева+ТоЧтоСправа) > ШиринаЛенты -1 тогда
				ПечатьСтроки(Fptr,ТоЧтоСлева);
			    ПечатьСтроки_Пробелы(Fptr, "", ТоЧтоСправа,, ШиринаЛенты);
			иначе
				ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
			КонецЕсли;
			
			Если СпецСимвол = "" тогда
				ПечатьСтроки(Fptr,"НДС не облагается");
			КонецЕсли;
			
			СуммаИтого	= Строка.Цена * Строка.КоличествоУпаковок; 
		КонецЦикла;
		
				
		Для каждого Строка из ВторыеЭлектронки цикл
			ТоЧтоСлева		=	Строка(Строка.Номенклатура);
			ТоЧтоСправа		=	Строка(Окр(СуммаИтого/2,2)) + ".00      *" +Строка("1")+"   =" + Строка(Окр(СуммаИтого/2,2))+СпецСимвол;
			Если СтрДлина(ТоЧтоСлева+ТоЧтоСправа) > ШиринаЛенты -1 тогда
				ПечатьСтроки(Fptr,ТоЧтоСлева);
			    ПечатьСтроки_Пробелы(Fptr, "", ТоЧтоСправа,, ШиринаЛенты);
			иначе
				ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
			КонецЕсли;
			
			Если СпецСимвол = "" тогда
				ПечатьСтроки(Fptr,"НДС не облагается");
			КонецЕсли;
			
		КонецЦикла;
	
	иначе
		Для каждого Строка из Товары цикл
			ТоЧтоСлева		=	Строка(Строка.Номенклатура);
			ТоЧтоСправа		=	Строка(Строка.Цена) + ".00      *" +Строка(Строка.КоличествоУпаковок)+"   =" + Строка(Строка.Цена*Строка.КоличествоУпаковок)+СпецСимвол;
			Если СтрДлина(ТоЧтоСлева+ТоЧтоСправа) > ШиринаЛенты -1 тогда
				ПечатьСтроки(Fptr,ТоЧтоСлева);
			    ПечатьСтроки_Пробелы(Fptr, "", ТоЧтоСправа,, ШиринаЛенты);
			иначе
				ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
			КонецЕсли;
			
			Если СпецСимвол = "" тогда
				ПечатьСтроки(Fptr,"НДС не облагается");
			КонецЕсли;

			
			
			СуммаИтого	=	СуммаИтого + Строка.Цена * Строка.КоличествоУпаковок; 
		КонецЦикла;
	КонецЕсли;
	//
	//Итого
	Стр = "_________________________________________________________________";
	ПечатьСтроки(Fptr,Стр);    
	
	ТоЧтоСлева		=	"ИТОГ";
	ТоЧтоСправа		=	"=" +СуммаИтого+".00";
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа, Истина, ШиринаЛенты);

		
	Стр = "_________________________________________________________________";
	ПечатьСтроки(Fptr,Стр);
	//
	
	//Секция С Данными
	Если СпецСимвол	=	" А" тогда
		ТоЧтоСлева	=	"А: СУММА НДС 20%";
		ТоЧтоСправа	=	"="+ Окр((СуммаИтого/1.2 - СуммаИтого)*-1,2);
	иначе
		ТоЧтоСлева	=	"СУММА БЕЗ НДС";
		ТоЧтоСправа	=	"="+ СуммаИтого+".00";   
	КонецЕсли;
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
	
	Если флНал тогда
		ТоЧтоСлева		=	"НАЛИЧНЫМИ";
		ТоЧтоСправа		=	"="+ СуммаИтого+".00";
		ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
		
		Если Сдача >0 тогда
			ТоЧтоСлева		=	"ПОЛУЧЕНО НАЛИЧНЫМИ";
			ТоЧтоСправа		=	"="+ (СуммаИтого+Сдача)+".00";
			ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
			
			ТоЧтоСлева		=	"СДАЧА";
			ТоЧтоСправа		=	"="+ Сдача+".00";
			ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
		КонецЕсли;
	иначе
		ТоЧтоСлева		=	"БЕЗНАЛИЧНЫМИ";
		ТоЧтоСправа		=	"="+ СуммаИтого+".00";
		ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);		
	КонецЕсли;

	ТоЧтоСлева		=	"Кассир";	
	ТоЧтоСправа		=	Кассир;
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
	
	ПечатьСтроки(Fptr,organizationName);
	ПечатьСтроки(Fptr,paymentsAddress);

	ТоЧтоСлева		=	"ОФД";
	ТоЧтоСправа		=	"ООО ""Такском""";
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);
	
	ТоЧтоСлева		=	"Сайт ФНС";
	ТоЧтоСправа		=	"nalog.ru";
	ПечатьСтроки_Пробелы(Fptr, ТоЧтоСлева, ТоЧтоСправа,, ШиринаЛенты);

	Стр = "_________________________________________________________________";
	ПечатьСтроки(Fptr,Стр);  
	
	//фискальные данные
	//Если флЭтоНеСтандартныйФормат тогда
	//	ПечатьСтроки(Fptr,"ЗН ККТ "	+	serialNumber,, Истина);
	//	ПечатьСтроки(Fptr,"РН ККТ "	+	registrationNumber,, Истина);
	//	ПечатьСтроки(Fptr,"ИНН "	+	organizationVATIN,, Истина);
	//	ПечатьСтроки(Fptr,"ФН "		+	fnSerial,, Истина);
	//	ПечатьСтроки(Fptr,"ФД "		+	documentNumber,, Истина);
	//	ПечатьСтроки(Fptr,"ФП 2996364181",, Истина);
	//	ПечатьСтроки(Fptr,"ЧЕК 00"+(receiptNumber+1)+" ПРИХОД",, Истина);
	//	Если Строка(СНО) = "Общая" тогда
	//		ПечатьСтроки(Fptr,"СНО ОСН",, Истина);
	//	иначе
	//		ПечатьСтроки(Fptr,"СНО УСН доход-расход",, Истина);
	//	КонецЕсли;
	//	ПечатьСтроки(Fptr,Лев(Строка(ТекущаяДата()),16),, Истина);
	//	ПечатьСтроки(Fptr,"СМЕНА 000"+shiftNumber,, Истина);    
	//	Fptr.setParam(Fptr.LIBFPTR_PARAM_ALIGNMENT, Fptr.LIBFPTR_ALIGNMENT_center); 	
	//иначе
		ПечатьСтроки(Fptr,"ЗН ККТ "	+	serialNumber);
		ПечатьСтроки(Fptr,"РН ККТ "	+	registrationNumber);
		ПечатьСтроки(Fptr,"ИНН "	+	organizationVATIN);
		ПечатьСтроки(Fptr,"ФН "		+	fnSerial);
		ПечатьСтроки(Fptr,"ФД "		+	documentNumber);
		ПечатьСтроки(Fptr,"ФП 2996364181");
		ПечатьСтроки(Fptr,"ЧЕК 00"+(receiptNumber+1)+" ПРИХОД");
		Если Строка(СНО) = "Общая" тогда
			ПечатьСтроки(Fptr,"СНО ОСН");
		иначе
			ПечатьСтроки(Fptr,"СНО УСН доход-расход");
		КонецЕсли;
		ПечатьСтроки(Fptr,Лев(Строка(ТекущаяДата()),16) + "   СМЕНА 000"+shiftNumber,, Истина); 
		
		Fptr.setParam(Fptr.LIBFPTR_PARAM_ALIGNMENT, Fptr.LIBFPTR_ALIGNMENT_LEFT); 	
	//КонецЕсли;
	
	Fptr.setParam(Fptr.LIBFPTR_PARAM_BARCODE, "tt=20211015T1222&s=2.00&fn=996005591440300344360&i=188&fp=919818984&n=1");
	Fptr.setParam(Fptr.LIBFPTR_PARAM_BARCODE_TYPE, Fptr.LIBFPTR_BT_QR);
	Fptr.setParam(Fptr.LIBFPTR_PARAM_SCALE, 5);
	Fptr.printBarcode();
	
	ПечатьСтроки(Fptr,"");
	
	//Если флЭтоНеСтандартныйФормат тогда  		
	//	Стр = "СПАСИБО ЗА ПОКУПКУ!";
	//	ПечатьСтроки(Fptr,Стр,2);
	//	
	//	Стр = "_________________________________________________________________";
	//	ПечатьСтроки(Fptr,Стр);      
	//КонецЕсли;

	
	Если флЭтоНеСтандартныйФормат тогда
		Для СЧ = 1 по 4 цикл
			ПечатьСтроки(Fptr,""); 			
		КонецЦикла;
		Fptr.printCliche();
	КонецЕсли;
	
	
	//Конец
	Fptr.setParam(Fptr.LIBFPTR_PARAM_PRINT_FOOTER, false);
	Fptr.endNonfiscalDocument();
	Если флЭтоНеСтандартныйФормат тогда
		Fptr.cut();
	КонецЕсли;
	
	Fptr.close();
	//	        
КонецПроцедуры  

Процедура ПечатьСтроки(ДрайверККМ,Стр , Выравнивание = 1, Отложенаня = Ложь)
	
	Если Выравнивание = 1 тогда
		ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_ALIGNMENT, ДрайверККМ.LIBFPTR_ALIGNMENT_LEFT);
		
	ИначеЕсли Выравнивание = 2 тогда
		ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_ALIGNMENT, ДрайверККМ.LIBFPTR_ALIGNMENT_CENTER);
	Иначе
		ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_ALIGNMENT, ДрайверККМ.LIBFPTR_ALIGNMENT_RIGHT);
	КонецЕсли;
	
		
	ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_TEXT, Стр);  
	Если Отложенаня тогда
		ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_DEFER,ДрайверККМ.LIBFPTR_DEFER_OVERLAY);
	КонецЕсли;
	
	ДрайверККМ.printText();  
КонецПроцедуры

Процедура ПечатьСтроки_Пробелы(ДрайверККМ, ТоЧтоСлева, ТоЧтоСправа, НуженЖир = Ложь, ШиринаЛенты)
	НужныяШЛ	=	ШиринаЛенты;
	
	Если НуженЖир тогда
		ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_FONT_DOUBLE_WIDTH, true);	
		НужныяШЛ = НужныяШЛ / 2;
	КонецЕсли;

	КолПробелов		=	НужныяШЛ - СтрДлина(ТоЧтоСправа) -  СтрДлина(ТоЧтоСлева);	
	Стр				=	ТоЧтоСлева + ДобавитьСлева(КолПробелов) + ТоЧтоСправа; 	
		
	ДрайверККМ.setParam(ДрайверККМ.LIBFPTR_PARAM_TEXT, Стр);      	
	ДрайверККМ.printText();  
КонецПроцедуры

Функция  ДобавитьСлева(КолПробелов)
	СтрВ	=	"";
	Для Ном = 1 по КолПробелов цикл
		СтрВ = СтрВ + " ";
	КонецЦикла;
	Возврат СтрВ;
КонецФункции


Функция ПолучитьСпецСимвол(СНО) 
	Если Строка(СНО)	=	"Общая" тогда
		СпецСимвол	=	" А";
	иначе
		СпецСимвол	=	"";
	КонецЕсли;
	
	Возврат СпецСимвол;	
КонецФункции
