
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
&Вместо("ОбновитьИнформациюДрайверОборудования_Завершение")
Процедура ТБКОбновитьИнформациюДрайверОборудования_Завершение(РезультатВыполнения, Параметры)
	
	Если Не ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйЗапуск = ?(Параметры.Свойство("ПервыйЗапуск"), Параметры.ПервыйЗапуск, Истина);
	ОбновитьИнтерфейсФормы(ПервыйЗапуск, РезультатВыполнения);
	
	// Марк 2026-07-22
	ОбновлениеИнформацииДрайверОборудования_Завершение = Неопределено;
	Если Параметры.Свойство("ОбновлениеИнформацииДрайверОборудования_Завершение", ОбновлениеИнформацииДрайверОборудования_Завершение) Тогда
		ВыполнитьОбработкуОповещения(ОбновлениеИнформацииДрайверОборудования_Завершение, ЭтаФорма);
	КонецЕсли;
	// КонецМарк
	
КонецПроцедуры

#КонецОбласти


#Область ТБКСлужебныеПроцедурыИФункции 

&НаКлиенте
Функция ТБК_ОпределитьВремНастройки() Экспорт
	
	ВремНастройки = ПолучитьНастройки();
	
	Если ВремНастройки.ПараметрыОборудования.Свойство("P_DeviceIsmHost") Тогда
		ВремНастройки.ПараметрыОборудования.P_DeviceIsmHost = "f1.taxcom.ru";
	КонецЕсли;
	
	Если ВремНастройки.ПараметрыОборудования.Свойство("P_DeviceIsmPort") Тогда
		ВремНастройки.ПараметрыОборудования.P_DeviceIsmPort = 8777;
	КонецЕсли;
	
	Если ВремНастройки.ПараметрыОборудования.Свойство("P_DeviceOfdHost") Тогда
		ВремНастройки.ПараметрыОборудования.P_DeviceOfdHost = "f1.taxcom.ru";
	КонецЕсли;
	
	Если ВремНастройки.ПараметрыОборудования.Свойство("P_DeviceOfdPort") Тогда
		ВремНастройки.ПараметрыОборудования.P_DeviceOfdPort = 7777;
	КонецЕсли;
	
	Если ВремНастройки.ПараметрыОборудования.Свойство("P_DeviceOfdChannel") Тогда
		ВремНастройки.ПараметрыОборудования.P_DeviceOfdChannel = 5; //EthernetOverTransport (EoT)
	КонецЕсли;
	
	Возврат ВремНастройки;  
	
КонецФункции

#КонецОбласти

