
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока.Пустой() Тогда
		СтандартнаяОбработка = Ложь;
		
		ЗначенияЗаполнения = Новый Структура("ОрганизацияЕГАИС, АдресУТМ, ПортУТМ");
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Элемент.ТекущиеДанные);
		
		ОткрытьФорму("РегистрСведений.НастройкиОбменаЕГАИС.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры
