
&Вместо("ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС")
Процедура ТБКПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС", СтруктураПараметровДействия) Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда 
			
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "МаркируемаяПродукция") Тогда
				Возврат;
			КонецЕсли;
			
			Если ТипЗнч(СтруктураПараметровДействия) = Тип("Структура") 
				И СтруктураПараметровДействия.Свойство("БезМаркировки") Тогда 
				
				ТекущаяСтрока.МаркируемаяПродукция            = Ложь;
				ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.ПустаяСсылка();
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
					ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Ложь;
				КонецЕсли;

				
			Иначе 
				
				ОперацияСДенежнымиСредствами = Ложь;
				
				Если СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС <> Неопределено
					И СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС.Свойство("ОперацияСДенежнымиСредствами") Тогда
					ОперацияСДенежнымиСредствами = СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС.ОперацияСДенежнымиСредствами;
				КонецЕсли;
				
				ДанныеПродукции = ИнтеграцияЕГАИСРТ.ДанныеАлкогольнойПродукции(ТекущаяСтрока.Номенклатура);
				Если НЕ ОперацияСДенежнымиСредствами И ДанныеПродукции.ЭтоТабачнаяПродукция Тогда
					ТекущаяСтрока.МаркируемаяПродукция            = Истина;
					ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.Табачная;
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Истина;
					КонецЕсли;
				ИначеЕсли НЕ ОперацияСДенежнымиСредствами И ДанныеПродукции.ЭтоОбувнаяПродукция Тогда
					ТекущаяСтрока.МаркируемаяПродукция            = Истина;
					ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.Обувная;
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Истина;
					КонецЕсли;
				ИначеЕсли НЕ ОперацияСДенежнымиСредствами И ДанныеПродукции.ЭтоАлкогольнаяПродукция И ДанныеПродукции.Маркируемый
					И Не ДанныеПродукции.ПродаетсяВрозлив Тогда
					ТекущаяСтрока.МаркируемаяПродукция            = Истина;
					ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.Алкогольная;
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Истина;
					КонецЕсли;
					
					Если СтруктураПараметровДействия <> Неопределено
						и СтруктураПараметровДействия.Свойство("ИмяФормы") Тогда
						Если СтруктураПараметровДействия.ИмяФормы = "Документ.ПоступлениеТоваров.Форма.ФормаДокумента" Тогда 
							ТекущаяСтрока.МаркируемаяПродукция            = Ложь;// в поступлении не нужно отображать значек марки
						КонецЕсли;
					КонецЕсли;
					
				Иначе 
					ТекущаяСтрока.МаркируемаяПродукция            = Ложь;
					ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.ПустаяСсылка();
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				//Вик 2022-06-15
				Если Строка(ТекущаяСтрока.Номенклатура.ВидНоменклатуры) = "Табак (х)" тогда
					ТекущаяСтрока.МаркируемаяПродукция            = Истина;	
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
