
&Вместо("ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС")
Процедура ТБКПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС", СтруктураПараметровДействия) Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда 
			
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "МаркируемаяПродукция") Тогда
				Возврат;
			КонецЕсли;
			
			Если ТипЗнч(СтруктураПараметровДействия) = Тип("Структура") 
				И СтруктураПараметровДействия.Свойство("БезМаркировки") Тогда 
				
				ТекущаяСтрока.МаркируемаяПродукция            = Ложь;
				ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.ПустаяСсылка();
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
					ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Ложь;
				КонецЕсли;

				
			Иначе 
				
				ОперацияСДенежнымиСредствами = Ложь;
				
				Если СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС <> Неопределено
					И СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС.Свойство("ОперацияСДенежнымиСредствами") Тогда
					ОперацияСДенежнымиСредствами = СтруктураДействий.ПроверитьНеобходимостьВводаМаркируемойПродукцииГосИС.ОперацияСДенежнымиСредствами;
				КонецЕсли;
				
				ДанныеПродукции = ИнтеграцияИС.СвойстваМаркируемойПродукции(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика);
				
				Если НЕ ОперацияСДенежнымиСредствами Тогда
					ТекущаяСтрока.МаркируемаяПродукция           = ДанныеПродукции.МаркируемаяПродукция;
					ТекущаяСтрока.ВидПродукцииИС                 = ДанныеПродукции.ВидПродукции;
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = ДанныеПродукции.МаркируемаяПродукция;
					КонецЕсли;
				Иначе 
					ТекущаяСтрока.МаркируемаяПродукция            = Ложь;
					ТекущаяСтрока.ВидПродукцииИС                  = Перечисления.ВидыПродукцииИС.ПустаяСсылка();
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НеобходимостьВводаАкцизнойМарки") Тогда
						ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				
				//Вик 2022-06-15
				Если Строка(ТекущаяСтрока.Номенклатура.ВидНоменклатуры) = "Табак (х)" тогда
					ТекущаяСтрока.МаркируемаяПродукция            = Истина;	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ЗаполнитьСтавкуНДСВСтрокеПоПараметрам")
Процедура ТБКЗаполнитьСтавкуНДСВСтрокеПоПараметрам(ТекущаяСтрока, СтруктураПараметровДействия, КэшированныеЗначения)
	
	СтавкаНДС 						= Неопределено;
	СтавкаНДСПоУмолчанию 			= Перечисления.СтавкиНДС.БезНДС;
	ОпределятьПризнакПлательщикаНДС = Истина;
	
	Если СтруктураПараметровДействия.Свойство("ВидНалогаВШапке") Тогда
		
		ВидНалогаВШапке = СтруктураПараметровДействия.ВидНалогаВШапке;
		
		Если ЗначениеЗаполнено(ВидНалогаВШапке) 
			И ВидНалогаВШапке <> Перечисления.ТипыСистемНалогообложенияККТ.ОСН 
			И НЕ (ВидНалогаВШапке = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН
			И СтруктураПараметровДействия.Дата >= УчетНДС.ДатаПереходногоПериода()) Тогда
		
			СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			
		Иначе
			
			Организация = Неопределено;
			СтруктураПараметровДействия.Свойство("Организация", Организация);
			
			Склад = Неопределено;
			СтруктураПараметровДействия.Свойство("Склад", Склад);
			
			Магазин = Неопределено;
			Если НЕ СтруктураПараметровДействия.Свойство("Магазин", Магазин) Тогда
				Магазин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Магазин");
			КонецЕсли;
			
			ПрименяетсяНДС = УчетНДС.ПрименяетсяНДС(СтруктураПараметровДействия.Дата,
												Организация,
												Магазин,
												Склад);
			
			Если ПрименяетсяНДС Тогда
				
				СтавкаНДС = УчетНДС.СкорректироватьСтавкуНДС(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Номенклатура,"СтавкаНДС"), 
					СтруктураПараметровДействия.Дата);
				
			Иначе
				
				СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		ВидНалога = Неопределено;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ВидНалога") Тогда
			ВидНалога = ТекущаяСтрока.ВидНалога;
		ИначеЕсли СтруктураПараметровДействия.Свойство("ВидНалога") Тогда
			ВидНалога = СтруктураПараметровДействия.ВидНалога;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(ВидНалога)
			И ВидНалога <> Перечисления.ТипыСистемНалогообложенияККТ.ОСН 
			И НЕ (ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН
			И СтруктураПараметровДействия.Дата >= УчетНДС.ДатаПереходногоПериода()) Тогда
			
			ОпределятьПризнакПлательщикаНДС = Ложь;
			
		КонецЕсли;
		
		Если ОпределятьПризнакПлательщикаНДС Тогда
			
			Склад = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Склад") Тогда
				Склад = ТекущаяСтрока.Склад;
			Иначе
				СтруктураПараметровДействия.Свойство("Склад", Склад);
			КонецЕсли;
			
			Организация = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "Организация") Тогда
				Организация = ТекущаяСтрока.Организация;
			Иначе
				СтруктураПараметровДействия.Свойство("Организация", Организация);
			КонецЕсли;
			
			Магазин = Неопределено;
			Если НЕ СтруктураПараметровДействия.Свойство("Магазин", Магазин) Тогда
				Магазин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Магазин");
			КонецЕсли;
			
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.Номенклатура,"ТоварнаяГруппа, СтавкаНДС");
			
			ПрименяетсяНДС = УчетНДС.ПрименяетсяНДС(
				СтруктураПараметровДействия.Дата,
				Организация,
				Магазин,
				Склад,
				РеквизитыНоменклатуры.ТоварнаяГруппа);
			
			Если ПрименяетсяНДС Тогда
				
				СтавкаНДС = УчетНДС.СкорректироватьСтавкуНДС(РеквизитыНоменклатуры.СтавкаНДС, СтруктураПараметровДействия.Дата);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	ТекущаяСтрока.СтавкаНДС = СтавкаНДС;
	
	//Марк 2025-02-13
	Если ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход5 Тогда
		ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС5;
	ИначеЕсли ВидНалога = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход7 Тогда 
		ТекущаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС7;
	КонецЕсли;
	//КонецМарк
	
	
КонецПроцедуры  

&После("ЗаполнитьЦенуПродажиВСтрокеТЧСервер")
Процедура ТБКЗаполнитьЦенуПродажиВСтрокеТЧСервер(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	//Марк 2025-08-12 https://jira.tabkn.ru/browse/ROZ-2
	Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика) Тогда
		
		Если СтрНайти(ТекущаяСтрока.Упаковка, "упак") Тогда
			Если НЕ ТекущаяСтрока.Упаковка.пустая() Тогда
				ТекущаяСтрока.Цена = ТекущаяСтрока.Упаковка.Коэффициент * СтрЗаменить(Строка(ТекущаяСтрока.Характеристика), Символы.НПП, "");	
			КонецЕсли;
		Иначе
			ТекущаяСтрока.Цена = Строка(ТекущаяСтрока.Характеристика);	
		КонецЕсли;	
	
	КонецЕсли;
	//КонецМарк
КонецПроцедуры
