
&НаСервере
&Перед("ОбработатьДокументыККМСервер")
Процедура ТБКОбработатьДокументыККМСервер(Отказ, СсылкаНаОтчет, НужноДополнительноеПредупреждение)
	//Вик 2021-10-21
	НачатьТранзакцию();
	Если не Отказ тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЧекККМ.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ КАК ЧекККМ
		      	 	             |ГДЕ
		      	 	             |	ЧекККМ.Дата >= &Дата
		      	 	             |	И ЧекККМ.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		      	 	             |	И ЧекККМ.Комментарий ПОДОБНО &Комментарий
		      	 	             |	И ЧекККМ.Проведен");
		Запрос.УстановитьПараметр("Дата",ТекущаяДата() - 2*24*60*60); //без даты запрос будет очень долго выполняться
		Запрос.УстановитьПараметр("Комментарий","Чек н.ф."); 		
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() = 0 тогда 
			ЗафиксироватьТранзакцию();
			Возврат 
		КонецЕсли;
		
		КопияТовары	=	Новый ТаблицаЗначений;
		КопияТовары.Колонки.Добавить("Количество");
		КопияТовары.Колонки.Добавить("КоличествоУпаковок");
		КопияТовары.Колонки.Добавить("Номенклатура");
		КопияТовары.Колонки.Добавить("Характеристика");
		КопияТовары.Колонки.Добавить("Сумма");
		КопияТовары.Колонки.Добавить("Цена");
	
		Для каждого Строка из Рез цикл
			Об							=	Строка.Ссылка.ПолучитьОбъект();
			Об.Комментарий				=	"Добавлен в ООРП";
			Об.ОбменДанными.Загрузка	=	Истина; //т.к. чек архивный

			Попытка
				Об.Записать();
			Исключение
				Отказ = Истина;
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			 
			 Для каждого СтрокаТовары из Об.товары цикл
			 	НоваяСтрока	=	КопияТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары);
			КонецЦикла;		
		КонецЦикла;
		КопияТовары.Свернуть("Номенклатура, Характеристика, Цена", "Количество, КоличествоУпаковок, Сумма");
		
		//Создаем ООРП
		ОтчетОРозничныхПродажах = СоздатьОтчетОРозничныхПродажах();
		ОтчетОРозничныхПродажах.Комментарий	=	"ООРП не ф.";
		ОтчетОРозничныхПродажах.Дата		=	ТекущаяДата();
		
		СуммаИтого	=	0;
		Для каждого СТрока из КопияТовары цикл
			НоваяСтрока =  ОтчетОРозничныхПродажах.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СТрока);
			
			НоваяСтрока.Склад	=	ОтчетОРозничныхПродажах.Магазин.СкладПродажи;
							
			СуммаИтого = СуммаИтого + СТрока.Сумма;
		КонецЦикла;
		ОтчетОРозничныхПродажах.СуммаОплатыНаличных = СуммаИтого;
		
		Попытка
			ОтчетОРозничныхПродажах.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		//Создаем приходник
		док 				= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		док.кассаККМ 		= ОтчетОРозничныхПродажах.кассаККМ;
		док.Касса	 		= ПолучитьКассу(док.кассаККМ);
		док.Организация 	= док.Касса.Владелец;
		док.СуммаДокумента 	= СуммаИтого;
		док.Дата 			= ТекущаяДата();
		
		док.Комментарий 	= "ПКО не ф.";;
		док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ;
		
		Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		      	 	             |	ВыемкаДенежныхСредствИзКассыККМ.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Документ.ВыемкаДенежныхСредствИзКассыККМ КАК ВыемкаДенежныхСредствИзКассыККМ");
		Рез = Запрос.Выполнить().Выгрузить();
		флТолькоЗапись	=	Ложь;
		Если Рез.Количество() = 1 тогда		
			док.ДокументОснование = Рез[0].Ссылка;
		иначе
			флТолькоЗапись	=	истина;
		КонецЕсли;
		
		док.Приложение	=	"1.1 Торговая розничная выручка - НАЛ";
			
		стр = док.РасшифровкаПлатежа.Добавить();
		стр.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Прочие доходы");
		стр.Сумма = СуммаИтого;
		
		Попытка
			Если флТолькоЗапись тогда
				док.Записать(РежимЗаписиДокумента.Запись);
			иначе
				док.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки; 
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	//КонецВик
КонецПроцедуры


Функция ПолучитьКассу(кассаККМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.КассаККМ = &КассаККМ";
	
	
	Запрос.УстановитьПараметр("КассаККМ",кассаККМ);
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.Ссылка;
	КонецЕсли;
КонецФУнкции

&НаКлиенте
&Вместо("ПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетПечатьЗавершение")
Процедура ТБКПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетПечатьЗавершение(РезультатВыполнения, ПараметрыВыполнения)
	Если Не РезультатВыполнения.Результат Тогда
		ТекстЗаголовка = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.'");
		ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%""
							|Отчет на фискальном регистраторе не сформирован.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		
		//Вик 2022-11-23
		Если Найти(ТекстСообщения,"Порт занят") тогда
			ТекстСообщения	=	"У вас запущено 2 программы 1с! Закройте одну из них. Если не помогло - перезагрузите компьютер." + Символы.ПС + Символы.ПС + ТекстСообщения
			+ Символы.ПС + Символы.ПС + "У вас запущено 2 программы 1с! Закройте одну из них. Если не помогло - перезагрузите компьютер.";
			
		ИначеЕсли Найти(ТекстСообщения,"Порт недоступен") тогда
			ТекстСообщения	=	"Проверьте включен ли фискальник (должна гореть зеленая лампочка)" + Символы.ПС + Символы.ПС + ТекстСообщения
			 + Символы.ПС + Символы.ПС + "Проверьте включен ли фискальник (должна гореть зеленая лампочка)" ;
		КонецЕсли;
		//КонецВик	

		Если ВыводитьСообщенияВРежимеРМК Тогда
			ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстЗаголовка, ТекстСообщения, , ЭтотОбъект.ВладелецФормы)
		Иначе
			ТекстСообщения = ТекстЗаголовка + Символы.ПС + ТекстСообщения;
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, ПараметрыВыполнения.Отказ);
		КонецЕсли;
		ПараметрыВыполнения.ИнформацияОбZОтчете = НСтр("ru = 'Нет возможности вывести Z-отчет'");
		
		ПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетЗавершение(Ложь, ПараметрыВыполнения);
		
	Иначе
		ПараметрыВыполнения.ИнформацияОбZОтчете = НСтр("ru = 'Z-отчет распечатан'");
		
		ОписаниеОшибки = "";
		
		Результат = ЗакрытьКассовуюСмену(Объект.КассаККМ, ОписаниеОшибки, ПараметрыВыполнения.СсылкаНаОтчет);
		Если Не Результат Тогда
			
			ТекстЗаголовка = НСтр("ru = 'При закрытии смены произошла ошибка.'");
			ТекстСообщения = НСтр("ru = 'Смена не закрыта.
			                            |Дополнительное описание: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);
			Если ВыводитьСообщенияВРежимеРМК Тогда
				ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ТекстЗаголовка, ТекстСообщения, , ЭтотОбъект.ВладелецФормы)
			Иначе
				ТекстСообщения = ТекстЗаголовка + Символы.ПС + ТекстСообщения;
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, ПараметрыВыполнения.Отказ);
			КонецЕсли;
		Иначе
			ПараметрыВыполнения.ИнформацияЗакрытиеСменыВСистеме = НСтр("ru = 'Кассовая смена в системе закрыта'") 
		КонецЕсли;
		
		ПродолжитьЗакрытиеСменыОкончаниеФискальныйОтчетЗавершение(Результат, ПараметрыВыполнения);
		
	КонецЕсли;

КонецПроцедуры
