
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Метод = "POST";
	ЭтаФорма.Функция = "CreateUser";
		
	_параметры = Новый Структура();
	_параметры.Вставить("UserName","ИвановИИ");
	_параметры.Вставить("Password","1");
	_параметры.Вставить("FullName","Иванов Иван Иванович");
	_параметры.Вставить("Birthdate","19901220");
	
	ЭтаФорма.ПараметрыЗапроса = СтруктураВjson(_параметры);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ЭтаФорма.РезультатВыполнения = "";
	рез = ВыполнитьЗапросСервер(
		ЭтаФорма.Метод,
		ЭтаФорма.Функция,
		ЭтаФорма.ПараметрыЗапроса
	);
	ЭтаФорма.РезультатВыполнения = СтруктураВjson(рез);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВыполнитьЗапросСервер(_метод,_функция,_параметрыJson)
	_рез = ""; 
	
	_параметры = jsonВСтруктура(_параметрыJson);
  	Выполнить("_рез = ТБК_WS_"+_метод+"."+_функция+"(_параметры);");
	Возврат _рез;
КонецФункции


&НаСервереБезКонтекста
Функция jsonВСтруктура(Значение)
	Если ЗначениеЗаполнено(СокрЛП(Значение)) Тогда
		
	    ЧтениеJSON = Новый ЧтениеJSON;
	    ЧтениеJSON.УстановитьСтроку(Значение);
	    Возврат ПрочитатьJSON(ЧтениеJSON, Ложь);
		
	Иначе
		Возврат Новый Структура();
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция СтруктураВjson(Значение)

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли;

	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции	
