
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Метод = "POST";
	ЭтаФорма.Функция = "CreateUser";
		
	_параметры = Новый Структура();
	_параметры.Вставить("UserName","ИвановИИ");
	_параметры.Вставить("Password","1");
	_параметры.Вставить("FullName","Иванов Иван Иванович");
	_параметры.Вставить("Birthdate","19901220");
	
	ЭтаФорма.ПараметрыЗапроса = СтруктураВjson(_параметры);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ЭтаФорма.РезультатВыполнения = "";
	ЭтаФорма.РезультатВыполнения = ВыполнитьЗапросСервер(
		ЭтаФорма.Метод,
		ЭтаФорма.Функция,
		ЭтаФорма.ПараметрыЗапроса
	);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВыполнитьЗапросСервер(_метод,_функция,_параметрыJson)
	_рез = "";
	_параметры = jsonВСтруктура(_параметрыJson);
  	Выполнить("_рез = ТБК_WS_"+_метод+"."+_функция+"(_параметры);");
	Возврат _рез;
КонецФункции


&НаСервереБезКонтекста
Функция СтруктураВjson(Значение)  
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть(); 	
	возврат СтрJSON;      
КонецФункции

&НаСервереБезКонтекста
Функция jsonВСтруктура(Значение) 
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Значение);
    Возврат ПрочитатьJSON(ЧтениеJSON, Ложь); 
КонецФункции

	
