
&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НеНадоПроверять = Ложь тогда 		
		если не ЗначениеЗаполнено(Продавец) тогда
			Отказ = Истина;
			Сообщить("Не заполнен продавец!");
		КонецЕсли;
		
		если не ЗначениеЗаполнено(КассаККМ) тогда
			Отказ = Истина;
			Сообщить("Не заполнена КассаККМ!");
		КонецЕсли;

		
		Если ВторойПродавец + ОсновнойПродавец + МладшийПродавец <> 1 тогда
			Отказ = Истина;
			Сообщить("Выберите тип продавца! Только 1 тип возможен.");	
		КонецЕсли;
		
		Если ВремяСмены = 0 тогда
			Отказ = Истина;
			Сообщить("Не заполнено время смены!");
		КонецЕсли;
		
		Если ВремяСмены > 24 тогда
			Отказ = Истина;
			Сообщить("Время смены превысило 24 ч.!");
		КонецЕсли;

		
		ЗаписатьДанные();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьТекПродавца()
	Возврат Пользователи.ТекущийПользователь().ФизическоеЛицо;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Продавец = ПолучитьТекПродавца();
КонецПроцедуры

&НаСервере
Процедура  ЗаписатьДанные()
	Рег = РегистрыСведений.ТБКСменыСотрудников.СоздатьМенеджерЗаписи();
	Рег.Период		=	ТекущаяДата();
	Рег.ВремяСмены	=	ВремяСмены;
	Рег.Продавец	=	Продавец;
	Рег.КассаККМ	=	КассаККМ;
	Если ВторойПродавец тогда
		Рег.ТипПродавца	=	"Второй продавец";
	ИначеЕсли ОсновнойПродавец тогда
		Рег.ТипПродавца	=	"Основной продавец";
	ИначеЕсли МладшийПродавец тогда
		Рег.ТипПродавца	=	"Младший продавец";
	иначе
		Рег.ТипПродавца	=	"Ночной продавец";
	КонецЕсли;
	
	Рег.Записать();		
КонецПроцедуры


&НаКлиенте
Процедура Выйти(Команда)
	НеНадоПроверять	=	истина;
	Этаформа.Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассыККМ.Ссылка КАК КассаККМ
	               |ИЗ
	               |	Справочник.КассыККМ КАК КассыККМ
	               |ГДЕ
	               |	КассыККМ.РабочееМесто = &РабочееМесто
	               |	И КассыККМ.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("РабочееМесто",РабочееМесто);
	
	Рез = запрос.Выполнить().Выгрузить();
	Если рез.Количество() = 1 Тогда
		КассаККМ	=	Рез[0].КассаККМ;
	КонецЕсли;
		
КонецПроцедуры

