
&Перед("ЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП")
Процедура ТБКЗаполнитьДанныеНеизвестныхТабачныхПачекБезЗапросаСведенийМОТП(ДанныеПоШтрихкодам, ПараметрыСканирования, МассивСтрок = Неопределено)
	//2024-09-25   
	Попытка
		Если ЗначениеЗаполнено(ПараметрыСканирования.Характеристика) тогда			
			Для каждого Строка из ДанныеПоШтрихкодам.ДанныеКодовМаркировки цикл
				Строка.Характеристика = ПараметрыСканирования.Характеристика;
			КонецЦикла; 		
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//	
КонецПроцедуры

&Вместо("СпецификаДляДополненияДанныхПоШтрихкодам")
Функция ТБКСпецификаДляДополненияДанныхПоШтрихкодам(СтрокиТаблицыДанныхДляПолученияСпецифики, ПараметрыСканирования)
	
	Результат = Новый Структура;
	Результат.Вставить("СпецификаШтрихкодов",            Неопределено);
	Результат.Вставить("ЕстьОшибки",                     Ложь);
	Результат.Вставить("ТекстОшибки",                    "");
	Результат.Вставить("ТребуетсяОбновлениеКлючаСессии", Ложь);
	
	//Вик 2024-11-01
	Если не ПараметрыСканирования.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации тогда 
	//КонецВик
		ДанныеПоШтрихкодамМОТП = ИнтерфейсМОТП.ЗапроситьСтатусыКодовМаркировки(
			СтрокиТаблицыДанныхДляПолученияСпецифики,
			ПараметрыСканирования.Организация,
			ШтрихкодированиеИСМПКлиентСервер.РазрешеноЗапрашиватьСтатусыКодовЕАЭС(ПараметрыСканирования));
		
		Если ДанныеПоШтрихкодамМОТП.ТребуетсяОбновлениеКлючаСессии Тогда
			Результат.ЕстьОшибки  = Истина;
			Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить данные из ИС МП.
			                                   |По причине: Требуется обновление ключа сессии.'");
			Результат.ТребуетсяОбновлениеКлючаСессии = Истина;
			
			Возврат Результат;
		ИначеЕсли ЗначениеЗаполнено(ДанныеПоШтрихкодамМОТП.ТекстОшибки) Тогда
			Результат.ЕстьОшибки  = Истина;
			Результат.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось получить данные из ИС МОТП.
				           |По причине: %1'"), ДанныеПоШтрихкодамМОТП.ТекстОшибки);
			
			Возврат Результат;
		КонецЕсли;
		
		Результат.СпецификаШтрихкодов = ДанныеПоШтрихкодамМОТП.СтатусыКодовМаркировки;
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции
