Функция УдалитьФункциюПослеСтартаВсехМагазов()
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПрименениеЦенНоменклатуры.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПрименениеЦенНоменклатуры КАК ПрименениеЦенНоменклатуры
	             |ГДЕ
	             |	ПрименениеЦенНоменклатуры.Номер ПОДОБНО ""%-00000001""";
	
	мДоки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	планы = ПланыОбмена.ОбменРозницаУправлениеТорговлей103.Выбрать();
	Пока планы.Следующий() Цикл
		Если планы.НомерПринятого > 0 Тогда
			Для Каждого Док из мДоки Цикл
				ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Док);
			КонецЦикла;
		КонецЕсли;
	Конеццикла;
КонецФункции

Процедура ВыполнитьОбмен() ЭКСПОРТ
	
	///!!!!!!!!!!!!!!!!!!!
	УдалитьФункциюПослеСтартаВсехМагазов();
	///!!!!!!!!!!!!!!!!!!!
	
	планы = ПланыОбмена.ОбменРозницаУправлениеТорговлей103.Выбрать();
	Пока планы.Следующий() Цикл
		Если планы.НомерПринятого > 0 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.РегистрыСведений.Штрихкоды);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Номенклатура);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.ХарактеристикиНоменклатуры);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.УпаковкиНоменклатуры);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Магазины);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.ПланыВидовХарактеристик.ТипыШтрихкодов);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.ФизическиеЛица);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Пользователи);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Организации);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Кассы);
			//ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.КассыККМ);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.ВидыНоменклатуры);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Документы.ПеремещениеТоваров);
		КонецЕсли;
	Конеццикла;
	
	сценарии = Справочники.СценарииОбменовДанными.Выбрать();
	Пока сценарии.Следующий() Цикл  
		Отказ = ложь;
		ОбменДаннымиСервер.ВыполнитьОбменДаннымиПоСценариюОбменаДанными(Отказ, сценарии.Ссылка);
	КонецЦикла;	
	
	ВыполнитьЗадачиПоВебСервису();
	ВыровнятьОстатки();//Вик 2022-05-04
	
	РегистрыСведений.ТБК_Штрихкоды.СинхронизацияШтрихкодов();
	
	//СнятьФлагиОрдернойСхемы(); //коммент от 2020_12_23. Все магазины переведены на ордерную схему
	
	ТБК_Номенклатура.Установить_ОсобенностьУчетаДля_ТабачнаяПродукция();
	
	РегистрыСведений.Штрихкоды.ОбработатьТипыШтрихкодов();	
	РегистрыСведений.Штрихкоды.ЧисткаШтрихкодов();
	
	
	Справочники.ФизическиеЛица.ГенерацияЮзеровДляФЛ();
	Справочники.ФизическиеЛица.ПроверкаФИО();

КонецПроцедуры


Функция СнятьФлагиОрдернойСхемы()
	МассивСкладовПоОрдернойСхеме = ПолучитьМассивСкладовПоОрдернойСхеме();
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	магазины.Ссылка КАК Ссылка,
				   |	магазины.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Магазины КАК магазины ГДЕ ИспользоватьОрдернуюСхемуПриПеремещении";
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЛОЖЬ Тогда Рез = Справочники.Магазины.ПустаяСсылка(); КонецЕсли;
		
		Если МассивСкладовПоОрдернойСхеме.Найти(нрег(рез.Наименование)) <> Неопределено тогда Продолжить КонецЕсли;
		
		об = Рез.Ссылка.ПолучитьОбъект();
		об.ИспользоватьОрдернуюСхемуПриПеремещении = ЛОЖЬ;
		об.ОбменДанными.Загрузка=Истина;
		об.Записать();
	КонецЦикла;
КонецФункции 

Функция ПолучитьМассивСкладовПоОрдернойСхеме()
	Массив = Новый Массив;
	Массив.Добавить(нрег("Интернет Магазин"));
	Массив.Добавить(нрег("Ленинский"));
	Массив.Добавить(нрег("БалканскаяПлПДВ"));
	Массив.Добавить(нрег("ГулливерСДП"));
	Массив.Добавить(нрег("ФиолентСДП"));
	Массив.Добавить(нрег("МиксерПДВ"));
	Массив.Добавить(нрег("Галерея1814СДП"));
	Массив.Добавить(нрег("Ленинский2ПДВ"));
	Массив.Добавить(нрег("Балкания Север"));
	Массив.Добавить(нрег("ДевяткиноПДВ"));
	
	//второй эшалон
	Массив.Добавить(нрег("Osinka"));
	Массив.Добавить(нрег("БайконурскийЛАФ"));
	Массив.Добавить(нрег("Бухарестская д.89"));
	Массив.Добавить(нрег("ДумскаяКИВ"));
	Массив.Добавить(нрег("Ларина15ПДВ"));
	Массив.Добавить(нрег("Линия7КИВ"));
	Массив.Добавить(нрег("ОКЕЙВТЕ"));
	Массив.Добавить(нрег("Смайл ТК"));
	Массив.Добавить(нрег("ТуканТК"));
	Массив.Добавить(нрег("Финляндский вокзал"));
	Массив.Добавить(нрег("Черная речка 1")); 
	
	//третий эшалон
	Массив.Добавить(нрег("БалканыРивГош2ЛИГ"));
	Массив.Добавить(нрег("Гашека5ПДВ"));
	Массив.Добавить(нрег("Димитрова11ПДВ"));
	Массив.Добавить(нрег("ДимитроваПДВ"));
	Массив.Добавить(нрег("Звездная2ПДВ"));
	Массив.Добавить(нрег("ЗвезднаяСЮБ"));
	Массив.Добавить(нрег("РадугаСЮБ"));
	Массив.Добавить(нрег("Универсам Южный"));
	Массив.Добавить(нрег("АтмосфераПДВ"));
	Массив.Добавить(нрег("КамышоваяПДВ"));
	Массив.Добавить(нрег("Кушелевская1ПДВ")); 	
	Массив.Добавить(нрег("Лесная"));
	Массив.Добавить(нрег("МеркурийСМА"));
	Массив.Добавить(нрег("МонпансьеБЮА")); 
	Массив.Добавить(нрег("ОкейБогатырскийПАО"));
	Массив.Добавить(нрег("Питерлэнд ТРЦ"));
	Массив.Добавить(нрег("ПятьОзёрВЛГ")); 
	
	//четвертый эшалон
	Массив.Добавить(нрег("БухарестскаяМВГ"));
	Массив.Добавить(нрег("ГатчинаКубусМВГ"));
	Массив.Добавить(нрег("ГринПаркПДВ"));
	Массив.Добавить(нрег("КировскСЮБ"));
	Массив.Добавить(нрег("КолпиноЛентаВЛГ"));
	Массив.Добавить(нрег("КолпиноМеркурийВЛГ"));
	Массив.Добавить(нрег("КолпиноОкейВЛГ"));
	Массив.Добавить(нрег("ЛиговВАА"));
	Массив.Добавить(нрег("ЛомоносовЛентаПАО"));
	Массив.Добавить(нрег("МеждународнаяМВС"));
	Массив.Добавить(нрег("МорозовапосГАМ")); 	
	Массив.Добавить(нрег("Москва Форт"));
	Массив.Добавить(нрег("МоскваКрасныйКитБОК"));
	Массив.Добавить(нрег("МоскваПринцПлазаБОК")); 
	Массив.Добавить(нрег("МоскваЯсеневоБДЮ"));
	Массив.Добавить(нрег("МосковскаяМВГ"));
	Массив.Добавить(нрег("ПаркПобедыМВС"));
	Массив.Добавить(нрег("РиоБЮА"));
	Массив.Добавить(нрег("Рыбацкое Находка"));
	Массив.Добавить(нрег("РыбацкоеПарадМВС"));
	Массив.Добавить(нрег("СлавянкаВТЕ"));
	Массив.Добавить(нрег("СосновыйБорПДВ"));
	Массив.Добавить(нрег("Тосно2ЛАФ"));
	Массив.Добавить(нрег("ТосноЛАФ"));
	Массив.Добавить(нрег("ЭлектраМВГ"));
	Массив.Добавить(нрег("ЮжныйПолюс2СМА"));
	Массив.Добавить(нрег("ЮжныйполюсПДВ"));
	Массив.Добавить(нрег("Кириши2ПДВ")); 
	
	//пятый эшалон
	Массив.Добавить(нрег("АкадемПарк2ПДВ"));
	Массив.Добавить(нрег("БестужевскийТЦ"));
	Массив.Добавить(нрег("ВасилеостровскаяПДВ"));
	Массив.Добавить(нрег("КиришиЛАФ"));
	Массив.Добавить(нрег("Лиговский53ПДВ"));
	Массив.Добавить(нрег("ЛьвовскаяСЮБ"));
	Массив.Добавить(нрег("МаксиСопотПДВ"));
	Массив.Добавить(нрег("Московский6ПДВ"));
	Массив.Добавить(нрег("Нарвский29ПДВ")); 	
	Массив.Добавить(нрег("НовочеркасскаяПДВ"));
	Массив.Добавить(нрег("ОхтаМоллЛИГ")); 	
	Массив.Добавить(нрег("Перинные ряды ПЕРЕКРЕСТОК"));
	Массив.Добавить(нрег("ПикПДВ"));
	Массив.Добавить(нрег("ПриморскаяПДВ")); 
	Массив.Добавить(нрег("РодеоЛАФ"));
	Массив.Добавить(нрег("ТихвинПАО"));
	Массив.Добавить(нрег("ТККубусВолховПАО"));
	Массив.Добавить(нрег("ТКСеннаяЛАФ"));
	Массив.Добавить(нрег("ЧкаловскаяКИВ"));
	Массив.Добавить(нрег("ШкиперскийКИВ"));
	Массив.Добавить(нрег("Шоссе Революции"));
	
	//шестой эшалон
	Массив.Добавить(нрег("АВТОВО"));
	Массив.Добавить(нрег("Большевиков пр. 32"));
	Массив.Добавить(нрег("БонусТКПДВ"));
	Массив.Добавить(нрег("Бронницкая2ПДВ"));
	
	Массив.Добавить(нрег("Ветеранов171ГАМ"));
	Массив.Добавить(нрег("ВсеволожскЮжныйГАМ"));
	Массив.Добавить(нрег("ВыборгскоешоссеУСВ"));
	Массив.Добавить(нрег("ГрандКаньонБЮА"));
	
	Массив.Добавить(нрег("Европейский3")); 	
	Массив.Добавить(нрег("ЖемчужинаВАА"));
	Массив.Добавить(нрег("ЗаневскийКаскадУСВ")); 	
	Массив.Добавить(нрег("ИюньПДВ"));
	
	Массив.Добавить(нрег("Кировский1УСВ"));
	Массив.Добавить(нрег("ЛондонМоллУСВ")); 
	Массив.Добавить(нрег("Мега Дыбенко"));
	Массив.Добавить(нрег("МегаДыбенкоПДВ"));
	
	Массив.Добавить(нрег("МегаПарнасПДВ"));
	Массив.Добавить(нрег("Московский42ПДВ"));
	Массив.Добавить(нрег("Невский2УСВ"));
	Массив.Добавить(нрег("НевскийПрезентальМВС"));
	
	Массив.Добавить(нрег("НордСМА"));
	Массив.Добавить(нрег("Озерки2ПДВ"));
	Массив.Добавить(нрег("Озерки3ПДВ"));
	Массив.Добавить(нрег("ОкейГерманаСДП"));
	
	Массив.Добавить(нрег("ПарнасСитиБЮА"));
	Массив.Добавить(нрег("ТетрисВТЕ"));
	Массив.Добавить(нрег("Тихая12ГАМ"));
	Массив.Добавить(нрег("Ульянка"));
	
	Массив.Добавить(нрег("Французский 2"));
	Массив.Добавить(нрег("Французский 3"));
	
	Возврат Массив;
КонецФункции

Процедура ВыполнитьЗадачиПоВебСервису()
	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
	Если Прокси = Неопределено тогда Возврат КонецЕсли; 
	
	Попытка
		УдалениеНеверныхШтрихкодов(Прокси);	
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаКодовСкидки(Прокси);
	Исключение   
	КонецПопытки;
	
	Попытка
		ЗагрузкаДанныхПоСкидкам(Прокси);
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхОНевернойОрганизации(Прокси);
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхОПокупкеСотрудников(Прокси); 
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхОЗаявкахМагазина(Прокси); 
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхИсторияПокупок(Прокси); 
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхСуммаОплат(Прокси); 
	Исключение   
	КонецПопытки;
	
	Попытка
		ОтправкаДанныхОЗаявкахНаЦенники(Прокси); 
	Исключение   
	КонецПопытки;   	
		
	//ОтправкаДанныхОСканированииВПеремещениях(Прокси);

	Прокси = Неопределено;

КонецПроцедуры

Процедура ОтправкаКодовСкидки(Прокси)
	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	КомментарииСтатистики.ХешНаименования КАК ХешНаименования,
	      	 	             |	КомментарииСтатистики.Наименование КАК Наименование
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.КомментарииСтатистики КАК КомментарииСтатистики
	      	 	             |ГДЕ
	      	 	             |	КомментарииСтатистики.Наименование ПОДОБНО &НаименованиеТБК
	      	 	             |	И НЕ КомментарииСтатистики.Наименование ПОДОБНО &УжеЗагружен");
	Запрос.УстановитьПараметр("НаименованиеТБК","%tbk%");
	Запрос.УстановитьПараметр("УжеЗагружен","%загружен%");

	НужныйСклад			 = ОбщегоНазначения.ПолучитьСкладИзООРП();
	НужнаяКассаККМ		 = ОбщегоНазначения.ПолучитьКассаККМИзООРП();
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Дата",Строка.ХешНаименования);
		эл.Вставить("Склад",Строка(НужныйСклад));
		эл.Вставить("КассаККМ",Строка(НужнаяКассаККМ));
		
		Данные		=	Строка.Наименование;
		Поз3		=	СтрНайти(Данные,"/",,,3);
		Поз4		=	СтрНайти(Данные,"/",,,4);
		Поз5		=	СтрНайти(Данные,"/",,,5);
		Поз6		=	СтрНайти(Данные,"/",,,6);
		Поз7		=	СтрНайти(Данные,"/",,,7);
		Поз8		=	СтрНайти(Данные,"/",,,8);
		Поз9		=	СтрНайти(Данные,"/",,,9);

		Если Найти(Строка.Наименование,"tbk_iqos") тогда
			Поз8	=	Поз3;
			Поз9	=	Поз4;
		КонецЕсли;
		
		Для ном = 0 по 100 цикл
			СуммаСкидки	=	Сред(Данные,Поз8+1,1);
			Если СуммаСкидки = "0" тогда
				Поз7	=	Поз7 + 14;
				Поз8	=	Поз8 + 14;
				Поз9	=	СтрНайти(Данные,"/",,Поз8+1);
			иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

	
		КодГруппы	=	Сред(Данные,Поз3+1,11);		
		эл.Вставить("НоменклатурнаяГруппа",КодГруппы);		
		
		КодПричины	=	Сред(Данные,Поз5+1,Поз6-Поз5-1);
		эл.Вставить("Причина",КодПричины);
		
		эл.Вставить("Код",Данные);
		
		КодНом		=	Сред(Данные,Поз7+1,Поз8-Поз7-1);
		эл.Вставить("КодНом",КодНом);
		
		Если Поз9 = 0 тогда
			СуммаСкидки	=	Сред(Данные,Поз8+1);
		иначе
			СуммаСкидки	=	Сред(Данные,Поз8+1, Поз9-Поз8-1);
		КонецЕсли;

		эл.Вставить("СуммаСкидки",СуммаСкидки);
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	//Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tabakon.ru:1777/ut/ws/tbk?wsdl");
	Ответ	=	Прокси.WriteDiscountsQR(JS);
	
	Если Ответ тогда
		Для каждого Строка из рез цикл
			рег = РегистрыСведений.КомментарииСтатистики.СоздатьНаборЗаписей();
			рег.Отбор.ХешНаименования.Установить(Строка.ХешНаименования);
			рег.Прочитать();
			рег[0].Наименование = рег[0].Наименование + "загружен";
			рег.Записать();			
		КонецЦикла;
	КонецЕсли;

	
	//Сообщить(Ответ);	
КонецПроцедуры

Процедура УдалениеНеверныхШтрихкодов(Прокси)
	Ответ = Прокси.DelSHK();
	
	СтруктураОтвета	= ОбщегоНазначения.jsonВСтруктура_Общая(Ответ);//если пустой ответ - то пустой массив	
	
	Для каждого Строка из СтруктураОтвета цикл
		НевернаяНоменклатура	=	Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка.КодНоменклатуры));
		Если НевернаяНоменклатура.Пустая() тогда Продолжить; КонецЕсли;
		
		
		НужЕд = Неопределено;
		Если ЗначениеЗаполнено(СокрЛП(Строка.ЕдиницаИзмерения)) тогда
			Если Найти(СокрЛП(Строка.ЕдиницаИзмерения),"шт") тогда
				НужНаим	=	"шт";
			ИначеЕсли  Найти(СокрЛП(Строка.ЕдиницаИзмерения),"упак") тогда
				НужНаим	=	"упак";				
			КонецЕсли;
			
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	УпаковкиНоменклатуры.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
			      	 	             |ГДЕ
			      	 	             |	УпаковкиНоменклатуры.Наименование ПОДОБНО &Наименование
			      	 	             |	И УпаковкиНоменклатуры.Владелец = &Владелец");
			Запрос.УстановитьПараметр("Наименование","%"+НужНаим+"%");
			Запрос.УстановитьПараметр("Владелец",НевернаяНоменклатура);
			
			РезЕдиница = Запрос.Выполнить().Выгрузить();
			Если РезЕдиница.Количество() >0 тогда
				НужЕд	=	РезЕдиница[0].Ссылка;	
			КонецЕсли;
		КонецЕсли;
					
		нз = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		
		нз.Отбор.Штрихкод.Установить(Строка.Штрихкод);
		нз.Отбор.Владелец.Установить(НевернаяНоменклатура);
		Если НужЕд <> Неопределено тогда
			Если НужНаим	=	"шт" тогда
				нз.Отбор.Упаковка.Установить(Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
			иначе
				нз.Отбор.Упаковка.Установить(НужЕд);
			КонецЕсли;
		КонецЕсли;
		
		нз.Записать(); 
		
		Если НужЕд = Неопределено тогда
			нз = РегистрыСведений.ТБК_Штрихкоды.СоздатьНаборЗаписей();
			
			нз.Отбор.Штрихкод.Установить(Строка.Штрихкод);
			нз.Отбор.Владелец.Установить(НевернаяНоменклатура);
			нз.Записать(); 
		иначе
			Для каждого Ед из  РезЕдиница цикл
				нз = РегистрыСведений.ТБК_Штрихкоды.СоздатьНаборЗаписей();
				
				нз.Отбор.Штрихкод.Установить(Строка.Штрихкод);
				нз.Отбор.Владелец.Установить(НевернаяНоменклатура);
				нз.Отбор.Упаковка.Установить(Ед);
				нз.Записать();
				
			КонецЦикла;
		КонецЕсли;  	
	КонецЦикла; 

КонецПроцедуры

Процедура ЗагрузкаДанныхПоСкидкам(Прокси);
	Касса	=	ОбщегоНазначения.ПолучитьКассуИзПКО();
	Если не ЗначениеЗаполнено(Касса) тогда
		Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		      	 	             |	Кассы.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Справочник.Кассы КАК Кассы
		      	 	             |ГДЕ
		      	 	             |	НЕ Кассы.ПометкаУдаления");
		рез = Запрос.Выполнить().Выгрузить();
		
		Если рез.Количество() = 1 тогда
			Касса	=	рез[0].Ссылка;
		иначе
			Касса	=	"";
		КонецЕсли;
	КонецЕсли;
	
	Ответ	=	Прокси.PostDiscountsData(СокрЛП(Строка(Касса)));
	Если ЗначениеЗаполнено(Ответ) тогда
		ОтветМассив	=	ОбщегоНазначения.jsonВСтруктура_Общая(Ответ);//В массив
		
		Для каждого СтрокаМассива из ОтветМассив цикл //добавляем
			нз = РегистрыСведений.ХранилищеСертификатов.СоздатьНаборЗаписей();// этот регистр выбран чтобы не обновлять монопольно. в этом регистре есть даты для быстрого отбора + измерение в виде строки
			
			нз.Отбор.Идентификатор.Установить(СтрокаМассива.УИ); 
			НоваяЗапись	=	нз.Добавить();
			
			НоваяЗапись.ДатаНачала		=	СтрокаМассива.ПериодАкцииНачало;
			НоваяЗапись.ДатаОкончания	=	СтрокаМассива.ПериодАкцииКонец;
			НоваяЗапись.Идентификатор	=	СтрокаМассива.УИ;
			НоваяЗапись.ТипХранилища	=	Перечисления.ТипХранилищаСертификатов.ПерсональныеСертификаты;
			
			ДанныеАкции	=	СтрокаМассива.ТипАкции 					+ "/" + СтрокаМассива.Скидка 			+ "/" +
							СтрокаМассива.ТоварВПодарок 			+ "/" + СтрокаМассива.СуммаЧека 		+ "/" +
							СтрокаМассива.КоличествоНоменклатуры 	+ "/" + СтрокаМассива.Номенклатура		+ "/" +
							СтрокаМассива.КоличествоШагов;
							
			НоваяЗапись.Наименование	=	ДанныеАкции;							
			
			нз.Записать();			
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

Процедура ОтправкаДанныхОНевернойОрганизации(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
		      	 	             |	ВременныеИдентификаторыЗапросов.Идентификатор КАК Идентификатор,
		      	 	             |	ВременныеИдентификаторыЗапросов.Дата КАК Дата,
		      	 	             |	ВременныеИдентификаторыЗапросов.Запрос КАК Запрос
		      	 	             |ИЗ
		      	 	             |	РегистрСведений.ВременныеИдентификаторыЗапросов КАК ВременныеИдентификаторыЗапросов
		      	 	             |ГДЕ
		      	 	             |	НЕ ВременныеИдентификаторыЗапросов.Идентификатор ПОДОБНО &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор","%загружен%");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Дата",Строка(Строка.Дата));		
		Данные		=	Строка.Запрос.Получить();
		
		эл.Вставить("Магазин",Строка(Данные.Магазин));
		эл.Вставить("Организация",Строка(Данные.Организация));
		эл.Вставить("ИНН",Данные.ИНН);
		эл.Вставить("Чек",Строка(Данные.Чек));
		эл.Вставить("ВидОперации",Данные.ВидОперации);
		эл.Вставить("ПроверкаМаркиИНН",Данные.ПроверкаМаркиИНН);
		эл.Вставить("НеверныйИНН",Данные.НеверныйИНН);
		эл.Вставить("Марка",Данные.Марка);
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	//Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tabakon.ru:1777/ut/ws/tbk?wsdl");
	Ответ	=	Прокси.WriteWrongINN(JS);
	
	Если Ответ тогда
		Для каждого Строка из рез цикл
			рег = РегистрыСведений.ВременныеИдентификаторыЗапросов.СоздатьМенеджерЗаписи();
			рег.Идентификатор 	= "загружен " + Строка.Идентификатор;
			рег.Дата 			=  Строка.Дата;
			рег.Запрос			=  Строка.Запрос;
			рег.Записать();
			
			рег = РегистрыСведений.ВременныеИдентификаторыЗапросов.СоздатьНаборЗаписей();
			рег.Отбор.Идентификатор.Установить(Строка.Идентификатор);
			рег.Записать();			
		КонецЦикла;
	КонецЕсли; 
	
	//Сообщить(Ответ);	
КонецПроцедуры

Процедура ОтправкаДанныхОПокупкеСотрудников(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ПокупкиСотрудников.Чек КАК Чек,
	      	 	             |	ТБК_ПокупкиСотрудников.Продавец КАК Продавец
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ПокупкиСотрудников КАК ТБК_ПокупкиСотрудников
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБК_ПокупкиСотрудников.ОтправленВУТ");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Чек",СокрЛП(Строка(Строка.Чек)));	
		Если Строка.Чек.ВидОперации =  Перечисления.ВидыОперацийЧекККМ.Возврат тогда
			эл.Вставить("СуммаЧека",Строка(-Строка.Чек.СуммаДокумента));
		иначе
			эл.Вставить("СуммаЧека",Строка(Строка.Чек.СуммаДокумента));
		КонецЕсли;	
		
		эл.Вставить("Сотрудник",СокрЛП(Строка(Строка.Продавец)));
		эл.Вставить("Дата",Строка(Строка.Чек.Дата));
		эл.Вставить("Магазин",Строка(Строка.Чек.Магазин));
		
		Для каждого СтрокаДанные из Строка.Чек.товары цикл			
			эл.Вставить("Номенклатура"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура));
			эл.Вставить("НоменклатураКод"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура.Код));
			эл.Вставить("Количество"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Количество));
			эл.Вставить("Цена"						+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Цена));
			эл.Вставить("Сумма"						+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Сумма));			
		КонецЦикла;
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);

	Ответ	=	Прокси.WriteWorkerPurchases(JS);
	
	Если Ответ тогда
		Для каждого Строка из рез цикл 
			рег = РегистрыСведений.ТБК_ПокупкиСотрудников.СоздатьНаборЗаписей();
			рег.Отбор.Чек.Установить(Строка.Чек); 		

			НоваяСтрока					=	Рег.Добавить(); 
			НоваяСтрока.Чек	 			=	Строка.Чек;
			НоваяСтрока.Продавец 		=	Строка.Продавец;
			НоваяСтрока.ОтправленВУТ	=	истина;
			рег.Записать();		
		КонецЦикла;
	КонецЕсли;  
	//Сообщить(Ответ);	
КонецПроцедуры

Процедура ОтправкаДанныхОСканированииВПеремещениях(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	СохраненныеДанныеПомощникаПриемкиОтгрузки.ДокументРаспоряжение КАК ДокументРаспоряжение,
	      	 	             |	СохраненныеДанныеПомощникаПриемкиОтгрузки.ТоварыПеремещение КАК ТоварыПеремещение
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.СохраненныеДанныеПомощникаПриемкиОтгрузки КАК СохраненныеДанныеПомощникаПриемкиОтгрузки
	      	 	             |ГДЕ
	      	 	             |	НЕ СохраненныеДанныеПомощникаПриемкиОтгрузки.Операция ПОДОБНО &Операция");
	Запрос.УстановитьПараметр("Операция","%!%");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Документ",Строка(Строка.ДокументРаспоряжение));		
		эл.Вставить("Номер",Строка(Строка.ДокументРаспоряжение.Номер));
		эл.Вставить("Дата",Строка(Строка.ДокументРаспоряжение.Дата));
		Данные		=	Строка.ТоварыПеремещение.Получить();
		Для каждого СтрокаДанные из Данные цикл			
			эл.Вставить("Номенклатура"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура));
			эл.Вставить("НоменклатураКод"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура.Код));
			эл.Вставить("Характеристика"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Характеристика));
			эл.Вставить("КоличествоФактРозница"		+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.КоличествоФакт)); 			
		КонецЦикла;
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	//Прокси  = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tabakon.ru:1777/ut/ws/tbk?wsdl");
	Ответ	=	Прокси.WriteSkanPer(JS);
	
	Если Ответ тогда
		Для каждого Строка из рез цикл
			рег = РегистрыСведений.СохраненныеДанныеПомощникаПриемкиОтгрузки.СоздатьНаборЗаписей();
			рег.Отбор.ДокументРаспоряжение.Установить(Строка.ДокументРаспоряжение);
			рег.Записать();	
			
			рег = РегистрыСведений.СохраненныеДанныеПомощникаПриемкиОтгрузки.СоздатьМенеджерЗаписи();
			рег.Операция	 			= рег.Операция + "!";
			рег.ДокументРаспоряжение 	=  Строка.ДокументРаспоряжение;
			рег.ТоварыПеремещение		=  Строка.ТоварыПеремещение;
			рег.Записать();		
		КонецЦикла;
	КонецЕсли;  
	//Сообщить(Ответ);	
КонецПроцедуры

Процедура ВыровнятьОстатки()
	НужнаяДата = НачалоДня(ТекущаяДата());

	//поиск источника	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ОприходованиеТоваров.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	      	 	             |ГДЕ
	      	 	             |	ОприходованиеТоваров.Комментарий ПОДОБНО &Комментарий
	      	 	             |	И НЕ ОприходованиеТоваров.ПометкаУдаления
	      	 	             |	И ОприходованиеТоваров.Дата = &Дата");
	Запрос.УстановитьПараметр("Комментарий","Выравнивание остатков"); 	
	Запрос.УстановитьПараметр("Дата",НужнаяДата); 
	Рез_Опр = Запрос.Выполнить().Выгрузить();
	
	Если Рез_Опр.Количество() <>1 тогда
		Сообщить("Не найдено оприходование за эту дату!");
		Возврат;
	КонецЕсли;
	
	//проверка
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	КорректировкаРегистров.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	      	 	             |ГДЕ
	      	 	             |	КорректировкаРегистров.Комментарий ПОДОБНО &Комментарий
	      	 	             |	И НЕ КорректировкаРегистров.ПометкаУдаления
	      	 	             |	И КорректировкаРегистров.Дата = &Дата");
	Запрос.УстановитьПараметр("Комментарий","%Выравнивание регистра ТоварыНаСкладах%"); 	
	Запрос.УстановитьПараметр("Дата",НужнаяДата); 

	Если не Запрос.Выполнить().Пустой() тогда
		Сообщить("Корректировка уже создана");
		Возврат;
	КонецЕсли;	
	

	//Списание
	НачатьТранзакцию();
	
	Корректировка				=	Документы.КорректировкаРегистров.СоздатьДокумент();
	Корректировка.Дата			= 	НужнаяДата;
	Корректировка.Комментарий 	= "Выравнивание регистра ТоварыНаСкладах на дату: "+НужнаяДата;
	Корректировка.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Админ");
	
	Рег							= Корректировка.ТаблицаРегистров.Добавить();
	Рег.Имя 					= "ТоварыНаСкладах";
	
	запрос	=	новый запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	            	 	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	            	 	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	            	 	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
	            	 	|ИЗ
	            	 	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&дата, ) КАК ТоварыНаСкладахОстатки";

	Запрос.УстановитьПараметр("Дата",НужнаяДата);

	Рез	=	Запрос.Выполнить().Выгрузить();
	
	Ном	=	0;
	Для каждого строка из Рез цикл
		Ном=Ном+1;		
				
		СтрокаРег	=	Корректировка.Движения.ТоварыНаСкладах.Добавить();
		
		СтрокаРег.Регистратор	=	Корректировка;
		СтрокаРег.ВидДвижения	=	ВидДвиженияНакопления.Расход;	
		СтрокаРег.Активность	=	Истина;
		СтрокаРег.Период		=	НужнаяДата;
		
		ЗаполнитьЗначенияСвойств(СтрокаРег,Строка); 		
	КонецЦикла; 	

	//Оприходование
	Если Рез_Опр[0].Ссылка.Проведен тогда
		Об = Рез_Опр[0].Ссылка.ПолучитьОбъект();
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли; 

	Для каждого строка из Рез_Опр[0].Ссылка.Товары цикл  				
		СтрокаРег	=	Корректировка.Движения.ТоварыНаСкладах.Добавить();
		
		СтрокаРег.Регистратор	=	Корректировка;
		СтрокаРег.ВидДвижения	=	ВидДвиженияНакопления.Приход;	
		СтрокаРег.Активность	=	Истина;
		СтрокаРег.Период		=	НужнаяДата;
		СтрокаРег.Склад			=	Рез_Опр[0].Ссылка.Склад;
		
		ЗаполнитьЗначенияСвойств(СтрокаРег,Строка); 		
	КонецЦикла;

	Корректировка.Записать(); 		
	Сообщить("Записана корректировка "+Корректировка);
	
	ЗафиксироватьТранзакцию();	
КонецПроцедуры

Процедура ОтправкаДанныхОЗаявкахМагазина(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Документ КАК Документ,
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Экспедитор КАК Экспедитор,
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Товары КАК Товары
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ДанныеПоЗаявкамМагазинов КАК ТБК_ДанныеПоЗаявкамМагазинов
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБК_ДанныеПоЗаявкамМагазинов.Отправлен");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();

	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Номер",Строка(Строка.Документ.Номер));
		эл.Вставить("Дата",Строка(Строка.Документ.Дата));
		эл.Вставить("Магазин",Строка(Строка.Документ.Магазин));
		эл.Вставить("ВидОперации",Строка(Строка.Документ.ВидОперации));
		эл.Вставить("Комментарий",Строка(Строка.Документ.Комментарий));
		эл.Вставить("ПричинаЗаявкиНаПоступление",Строка(Строка.Документ.ПричинаЗаявкиНаПоступление));
		эл.Вставить("Продавец",Строка(Строка.Документ.Продавец));
		эл.Вставить("Экспедитор",Строка(Строка.Документ.Экспедитор));		
		
		//Данные		=	Строка.Товары.Получить();
		//Для каждого СтрокаДанные из Данные цикл	
		Для каждого СтрокаДанные из Строка.Документ.Товары цикл	
			Если СтрокаДанные.КоличествоФакт = 0 тогда Продолжить; КонецЕсли;
			
			эл.Вставить("Номенклатура"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура));
			эл.Вставить("НоменклатураКод"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура.Код));
			эл.Вставить("Характеристика"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Характеристика));
			эл.Вставить("Количество"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.КоличествоФакт)); 			
		КонецЦикла;
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	Если Рез.Количество() >0 тогда
		JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
		
		Ответ	=	Прокси.writerequests(JS);
		
		Если Ответ тогда
			Для каждого Строка из рез цикл
				рег = РегистрыСведений.ТБК_ДанныеПоЗаявкамМагазинов.СоздатьНаборЗаписей();
				рег.Отбор.Документ.Установить(Строка.Документ);
				
				НоваяСтрока	=	Рег.добавить();  
				НоваяСтрока.ОТправлен	 			=  истина;
				НоваяСтрока.Документ 				=  Строка.Документ;
				НоваяСтрока.Экспедитор 				=  Строка.Экспедитор;
				НоваяСтрока.Товары					=  Строка.Товары; 
				
				рег.Записать();	
				
				Об = Строка.Документ.ПолучитьОбъект();
				Об.Статус	=	"В работе";
				об.записать();

			КонецЦикла;
		КонецЕсли;  
	КонецЕсли;

	
	//Обрабатываем ЗАЯВКИ "в работе"
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ЗаявкаОтМагазина.Ссылка КАК Документ
	      	 	             |ИЗ
	      	 	             |	Документ.ТБК_ЗаявкаОтМагазина КАК ТБК_ЗаявкаОтМагазина
	      	 	             |ГДЕ
	      	 	             |	ТБК_ЗаявкаОтМагазина.Проведен
	      	 	             |	И (ТБК_ЗаявкаОтМагазина.Статус = &Статус
	      	 	             |			ИЛИ ТБК_ЗаявкаОтМагазина.Статус = &Статус1)
	      	 	             |	И ТБК_ЗаявкаОтМагазина.ВидОперации = &ВидОперации");
	Запрос.УстановитьПараметр("Статус","В работе");
	Запрос.УстановитьПараметр("Статус1","");
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ТБК_ВидыОперацийЗаявокОтМагазина.ВозвратТовара);
	Рез = Запрос.Выполнить().Выгрузить();
	
	Структура 		= Новый Структура;	
	МассивВозврата	=	Новый Массив;
	
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Номер",Строка(Строка.Документ.Номер));
		эл.Вставить("Дата",Строка(Строка.Документ.Дата));		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	ОтветJS	=	Прокси.getrequests(JS);
	
	МассивПринятый	=	ОбщегоНазначения.jsonВСтруктура_Общая(ОтветJS);
	
	Для каждого Строка из МассивПринятый цикл 

		НомерДокумента		=	Строка.Номер;
		ДатаДокумента		=	ОбщегоНазначения.РазобратьДату(Строка.дата); 
		ДокументЗаявка		=	Документы.ТБК_ЗаявкаОтМагазина.НайтиПоНомеру(НомерДокумента,ДатаДокумента);
		
		Если ДокументЗаявка.Пустая() тогда 
			Продолжить; 
		КонецЕсли;
		
		Об	=	ДокументЗаявка.ПолучитьОбъект();
		Если Строка.Статус <>"" тогда 
			Об.Статус				=	Строка.Статус; 
		КонецЕсли;
		Об.ПричинаОтказа		=	Строка.Причина;
		Об.ПризнакОбновление	=	0;
		Об.Записать();   		
	КонецЦикла;


	
КонецПроцедуры

Процедура ОтправкаДанныхИсторияПокупок(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ИсторияПокупокРозница.IDКлиента КАК IDКлиента,
	      	 	             |	ТБК_ИсторияПокупокРозница.Чек КАК Чек,
	      	 	             |	ТБК_ИсторияПокупокРозница.Отправлен КАК Отправлен,
	      	 	             |	ТБК_ИсторияПокупокРозница.Дата КАК Дата,
	      	 	             |	ТБК_ИсторияПокупокРозница.Товары КАК Товары,
	      	 	             |	ТБК_ИсторияПокупокРозница.Сумма КАК Сумма,
	      	 	             |	ТБК_ИсторияПокупокРозница.ВидОперации КАК ВидОперации,
	      	 	             |	ТБК_ИсторияПокупокРозница.КоличествоСписанныхБаллов КАК КоличествоСписанныхБаллов,
	      	 	             |	ТБК_ИсторияПокупокРозница.флНадоНачислить КАК флНадоНачислить
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ИсторияПокупокРозница КАК ТБК_ИсторияПокупокРозница
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБК_ИсторияПокупокРозница.Отправлен");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Чек",						СокрЛП(Строка(Строка.Чек)));	
		эл.Вставить("СуммаЧека",				Строка(Строка.Сумма));		
		эл.Вставить("IDКлиента",				СокрЛП(Строка.IDКлиента));
		эл.Вставить("Дата",						Строка(Строка.Дата));
		эл.Вставить("Магазин",					Строка(Строка.Чек.Магазин));
		эл.Вставить("ВидОперации",				Строка(Строка.ВидОперации));
		эл.Вставить("КоличествоСписанныхБаллов",Строка(Строка.КоличествоСписанныхБаллов));
		эл.Вставить("флНадоНачислить",			Строка(Строка.флНадоНачислить));
		эл.Вставить("ДатаЧекККМПродажа",		Строка(Строка.Чек.ЧекККМПродажа.Дата));
		эл.Вставить("ЧекККМПродажа",			Строка(Строка.Чек.ЧекККМПродажа));   

		Данные		=	Строка.Товары.Получить();
		Для каждого СтрокаДанные из Данные цикл			
			эл.Вставить("Номенклатура"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура));
			эл.Вставить("НоменклатураКод"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура.Код));
			эл.Вставить("Характеристика"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Характеристика));
			эл.Вставить("КоличествоУпаковок"		+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.КоличествоУпаковок));
			эл.Вставить("Цена"						+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Цена));  
			эл.Вставить("Сумма"						+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Сумма));  
		КонецЦикла;

		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);

	Ответ	=	Прокси.writehistorysales(JS);
	
	Если Ответ тогда
		Для каждого Строка из рез цикл 
			рег = РегистрыСведений.ТБК_ИсторияПокупокРозница.СоздатьНаборЗаписей();
			рег.Отбор.Чек.Установить(Строка.Чек); 
			рег.Отбор.IDКлиента.Установить(Строка.IDКлиента);
			рег.Прочитать();
			Рег[0].Отправлен	= Истина;			
			рег.Записать();		
		КонецЦикла;
	КонецЕсли;  
	//Сообщить(Ответ);	
КонецПроцедуры

Процедура ОтправкаДанныхСуммаОплат(Прокси)	
	НачалоПрошлогоДня	= НачалоДня(НачалоДня(ТекущаяДата())-1);
	ДатаЧисло			= Число(Лев(СтрЗаменить(Строка(НачалоПрошлогоДня),".",""),8));
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	БуферОперацийСтатистики.ДатаЗаписи КАК ДатаЗаписи
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.БуферОперацийСтатистики КАК БуферОперацийСтатистики
	      	 	             |ГДЕ
	      	 	             |	БуферОперацийСтатистики.ДатаЗаписи = &ДатаЗаписи");
	Запрос.УстановитьПараметр("ДатаЗаписи",ДатаЧисло);
	Если не запрос.Выполнить().Пустой() тогда Возврат КонецЕсли;
	

	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	СУММА(ЧекККМОплата.Сумма) КАК Сумма,
	      	 	             |	ЧекККМОплата.Ссылка.ВидОперации КАК ВидОперации,
	      	 	             |	ЧекККМОплата.ВидОплаты.Наименование КАК ВидОплатыНаименование,
	      	 	             |	ЧекККМОплата.Ссылка.Магазин КАК Магазин
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	      	 	             |ГДЕ
	      	 	             |	ЧекККМОплата.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ЧекККМОплата.Ссылка.Проведен
	      	 	             |	И (ЧекККМОплата.Ссылка.СтатусЧекаККМ = &СтатусАрхивный
	      	 	             |			ИЛИ ЧекККМОплата.Ссылка.СтатусЧекаККМ = &СтатусПробитый)
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ЧекККМОплата.Ссылка.ВидОперации,
	      	 	             |	ЧекККМОплата.ВидОплаты.Наименование,
	      	 	             |	ЧекККМОплата.Ссылка.Магазин");
	Запрос.УстановитьПараметр("ДатаНач",НачалоПрошлогоДня);//выгружаем за предыдущий день
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(НачалоПрошлогоДня));	
	Запрос.УстановитьПараметр("СтатусАрхивный",Перечисления.СтатусыЧековККМ.Архивный);	
	Запрос.УстановитьПараметр("СтатусПробитый",Перечисления.СтатусыЧековККМ.Пробитый);	
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;

	Структура = Новый Структура;   	
	МассивВозврата	=	Новый Массив; 	
	
	эл	=	Новый Структура;
	эл.Вставить("Магазин",					СокрЛП(Строка(Рез[0].Магазин)));
	эл.Вставить("Дата",						СокрЛП(Строка(НачалоПрошлогоДня)));	
	
	эл.Вставить("СуммаНал",	"0");	
	эл.Вставить("СуммаБезнал",	"0");	
	эл.Вставить("СуммаВозвратовНал",	"0");	
	эл.Вставить("СуммаВозвратовБезНал","0");

	Для каждого Строка из Рез цикл 		
		Если Строка(Строка.ВидОперации) = "Продажа" и Строка.ВидОплатыНаименование = "Наличные" тогда
			эл.Вставить("СуммаНал",	Строка(Строка.Сумма));	
			
		ИначеЕсли  Строка(Строка.ВидОперации) = "Продажа" и Строка.ВидОплатыНаименование = "Платежная карта" тогда
			эл.Вставить("СуммаБезнал",	Строка(Строка.Сумма));	
			
		иначеЕсли Строка(Строка.ВидОперации) = "Возврат" и Строка.ВидОплатыНаименование = "Наличные" тогда
			эл.Вставить("СуммаВозвратовНал",	Строка(Строка.Сумма));	
			
		ИначеЕсли  Строка(Строка.ВидОперации) = "Возврат" и Строка.ВидОплатыНаименование = "Платежная карта" тогда
			эл.Вставить("СуммаВозвратовБезНал",	Строка(Строка.Сумма));	
		КонецЕсли; 		
	КонецЦикла;
	
	МассивВозврата.Добавить(эл);	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);

	Ответ	=	Прокси.writepayment(JS);
	сообщить(Ответ);
	
	Если Ответ тогда
		Рег = РегистрыСведений.БуферОперацийСтатистики.СоздатьМенеджерЗаписи();
		Рег.ДатаЗаписи				=	ДатаЧисло;
		Рег.Записать();
	КонецЕсли;  
КонецПроцедуры

Процедура ОтправкаДанныхОЗаявкахНаЦенники(Прокси)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ЗаявкаНаЦенники.Ссылка КАК Документ
	      	 	             |ИЗ
	      	 	             |	Документ.ТБК_ЗаявкаНаЦенники КАК ТБК_ЗаявкаНаЦенники
	      	 	             |ГДЕ
	      	 	             |	ТБК_ЗаявкаНаЦенники.Проведен
	      	 	             |	И ТБК_ЗаявкаНаЦенники.Сформирован
	      	 	             |	И НЕ ТБК_ЗаявкаНаЦенники.Отправлен");

	Структура = Новый Структура;
	
	МассивВозврата	=	Новый Массив;
	
	Рез = Запрос.Выполнить().Выгрузить();

	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Номер",Строка(Строка.Документ.Номер));
		эл.Вставить("Дата",Строка(Строка.Документ.Дата));
		эл.Вставить("Магазин",Строка(Строка.Документ.Магазин));
		эл.Вставить("Комментарий",Строка(Строка.Документ.Комментарий));
		эл.Вставить("Продавец",Строка(Строка.Документ.Продавец));
		эл.Вставить("ЭтоЦенники","Да");
		
		//Данные		=	Строка.Товары.Получить();
		//Для каждого СтрокаДанные из Данные цикл	
		Для каждого СтрокаДанные из Строка.Документ.Товары цикл	
			эл.Вставить("Номенклатура"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура));
			эл.Вставить("НоменклатураКод"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Номенклатура.Код));
			эл.Вставить("Характеристика"			+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Характеристика));
			эл.Вставить("ТипЦенника"				+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.ТипЦенника)); 	
			эл.Вставить("Цена"						+	Строка(СтрокаДанные.НомерСтроки),	Строка(СтрокаДанные.Цена)); 
		КонецЦикла;
		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	Если Рез.Количество() >0 тогда
		JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
		
		Ответ	=	Прокси.writerequests(JS);
		
		Если Ответ тогда
			Для каждого Строка из рез цикл
				Об = Строка.Документ.ПолучитьОбъект();
				Об.Статус		=	"В работе";
				Об.Отправлен	=	Истина;
				об.записать(); 
			КонецЦикла;
		КонецЕсли;  
	КонецЕсли;
	
	//Обрабатываем ЗАЯВКИ "в работе"
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ЗаявкаНаЦенники.Ссылка КАК Документ
	      	 	             |ИЗ
	      	 	             |	Документ.ТБК_ЗаявкаНаЦенники КАК ТБК_ЗаявкаНаЦенники
	      	 	             |ГДЕ
	      	 	             |	ТБК_ЗаявкаНаЦенники.Проведен
	      	 	             |	И ТБК_ЗаявкаНаЦенники.Статус = &Статус");
	Запрос.УстановитьПараметр("Статус","В работе");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Структура 		= Новый Структура;	
	МассивВозврата	=	Новый Массив;
	
	Если Рез.Количество() = 0 тогда возврат КонецЕсли;
	
	Для каждого Строка из рез цикл
		эл	=	Новый Структура;
		эл.Вставить("Номер",Строка(Строка.Документ.Номер));
		эл.Вставить("Дата",Строка(Строка.Документ.Дата));	
		эл.Вставить("ЭтоЦенники","Да");		
		МассивВозврата.Добавить(эл);
	КонецЦикла;
	
	JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	ОтветJS	=	Прокси.getrequests(JS);
	
	МассивПринятый	=	ОбщегоНазначения.jsonВСтруктура_Общая(ОтветJS);
	
	Для каждого Строка из МассивПринятый цикл
		Если Строка.Статус	<>	"Выполнена" тогда Продолжить; КонецЕсли;

		НомерДокумента		=	Строка.Номер;
		ДатаДокумента		=	ОбщегоНазначения.РазобратьДату(Строка.дата); 
		ДокументЗаявка		=	Документы.ТБК_ЗаявкаНаЦенники.НайтиПоНомеру(НомерДокумента,ДатаДокумента);
		
		Если ДокументЗаявка.Пустая() тогда 
			Продолжить; 
		КонецЕсли;
		
		Если Строка.Статус	=	"" тогда Продолжить; КонецЕсли;
		
		Об	=	ДокументЗаявка.ПолучитьОбъект();
		Об.Статус	=	Строка.Статус;
		Об.Записать();   		
	КонецЦикла; 	
КонецПроцедуры