Функция УдалитьФункциюПослеСтартаВсехМагазов()
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПрименениеЦенНоменклатуры.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПрименениеЦенНоменклатуры КАК ПрименениеЦенНоменклатуры
	             |ГДЕ
	             |	ПрименениеЦенНоменклатуры.Номер ПОДОБНО ""%-00000001""";
	
	мДоки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	планы = ПланыОбмена.ОбменРозницаУправлениеТорговлей103.Выбрать();
	Пока планы.Следующий() Цикл
		Если планы.НомерПринятого > 0 Тогда
			Для Каждого Док из мДоки Цикл
				ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Док);
			КонецЦикла;
		КонецЕсли;
	Конеццикла;
КонецФункции

Процедура ВыполнитьОбмен() ЭКСПОРТ
	
	///!!!!!!!!!!!!!!!!!!!
	УдалитьФункциюПослеСтартаВсехМагазов();
	///!!!!!!!!!!!!!!!!!!!
	
	планы = ПланыОбмена.ОбменРозницаУправлениеТорговлей103.Выбрать();
	Пока планы.Следующий() Цикл
		Если планы.НомерПринятого > 0 Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.РегистрыСведений.Штрихкоды);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Номенклатура);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.ХарактеристикиНоменклатуры);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.УпаковкиНоменклатуры);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Магазины);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.ПланыВидовХарактеристик.ТипыШтрихкодов);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.ФизическиеЛица);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Пользователи);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Организации);
			ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.Кассы);
			//ПланыОбмена.УдалитьРегистрациюИзменений(планы.Ссылка ,Метаданные.Справочники.КассыККМ);
		КонецЕсли;
	Конеццикла;
	
	сценарии = Справочники.СценарииОбменовДанными.Выбрать();
	Пока сценарии.Следующий() Цикл  
		Отказ = ложь;
		ОбменДаннымиСервер.ВыполнитьОбменДаннымиПоСценариюОбменаДанными(Отказ, сценарии.Ссылка);
	КонецЦикла;	
	РегистрыСведений.ТБК_Штрихкоды.СинхронизацияШтрихкодов();

	
	СнятьФлагиОрдернойСхемы();
	
	ТБК_Номенклатура.Установить_ОсобенностьУчетаДля_ТабачнаяПродукция();
	
	РегистрыСведений.Штрихкоды.ОбработатьТипыШтрихкодов();	
	РегистрыСведений.Штрихкоды.ЧисткаШтрихкодов();
	
	
	Справочники.ФизическиеЛица.ГенерацияЮзеровДляФЛ();
КонецПроцедуры


Функция СнятьФлагиОрдернойСхемы()
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	магазины.Ссылка КАК Ссылка,
				   |	магазины.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Магазины КАК магазины ГДЕ ИспользоватьОрдернуюСхемуПриПеремещении";
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЛОЖЬ Тогда Рез = Справочники.Магазины.ПустаяСсылка(); КонецЕсли;
		
		Если рез.Наименование = "Интернет Магазин" или рез.Наименование = "Ленинский"
		 или рез.Наименование = "БалканскаяПлПДВ" или рез.Наименование = "ГулливерСДП" 
			  или рез.Наименование = "ФиолентСДП" или рез.Наименование = "МиксерПДВ"
			   или рез.Наименование = "Галерея1814СДП" или рез.Наименование = "Ленинский2ПДВ"
			    или рез.Наименование = "БАлкания Север"
			 
			 Тогда			
			Продолжить;
		КонецЕсли;
		
		об = Рез.Ссылка.ПолучитьОбъект();
		об.ИспользоватьОрдернуюСхемуПриПеремещении = ЛОЖЬ;
		об.ОбменДанными.Загрузка=Истина;
		об.Записать();
	КонецЦикла;
КонецФункции