
&Вместо("ПроверитьЗаполнениеХарактеристик")
Процедура TBK_ПроверитьЗаполнениеХарактеристик(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки)
	// Вставить содержимое метода.
	Если (Пользователи.ТекущийПользователь().Наименование = "Админ" или Пользователи.ТекущийПользователь().Наименование = "Admin") тогда
		Если ПараметрыПроверки = Неопределено Тогда
			ПараметрыПроверки = ПараметрыПроверкиЗаполненияХарактеристик();
		КонецЕсли;

		ИмяТЧ                 = ПараметрыПроверки.ИмяТЧ;
		МассивНепроверяемыхРеквизитов.Добавить(ИмяТЧ+".Характеристика");
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(Объект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки);
КонецПроцедуры
