
Процедура ПриЗаписи(Отказ, Замещение)
		
	Перем ОбновлятьЗначениеГлПеременной;
	
	КэшНастроекПользователей = глЗначениеПеременной("ЗначенияНастроекПользователей");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшНастроекПользователей, 
																					  "Настройка",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения настроек",
																					  ОбновлятьЗначениеГлПеременной);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
	КонецЕсли;																						  
	
	// НЧАН
	Если Не (РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("ЛК_МенеджерПоПерсоналу")) Тогда
		Отказ = Истина;		
	КонецЕсли;
	// КЧАН	
	
КонецПроцедуры
