Процедура Печать(Док) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ(Печать)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.РеестрДокументов.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Сотрудники
	Область = Макет.ПолучитьОбласть("СотрудникиШапка");
	ТабДок.Вывести(Область);
	ОбластьСотрудники = Макет.ПолучитьОбласть("Сотрудники");
	Для Каждого ТекСтрока Из ТаблицаРеквизитов Цикл
		ОбластьСотрудники.Параметры.Заполнить(ТекСтрока);
		ТабДок.Вывести(ОбластьСотрудники);
	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры
