
&Вместо("ШаблоныКодовМаркировкиПоОтбору")
Функция ТБКШаблоныКодовМаркировкиПоОтбору(ШаблоныКодовМаркировки, Отбор)
		Если ТипЗнч(ШаблоныКодовМаркировки) = Тип("Массив") Тогда
		
		НайденныеШаблоны = Новый Массив;
		
		Для Каждого ШаблонКМ Из ШаблоныКодовМаркировки Цикл
			
			ШаблонНайден = Истина;
			
			Для Каждого ОтборКлючЗначение Из Отбор Цикл
				Если ШаблонКМ[ОтборКлючЗначение.Ключ] <> ОтборКлючЗначение.Значение Тогда
					ШаблонНайден = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ШаблонНайден Тогда
				НайденныеШаблоны.Добавить(ШаблонКМ);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		НайденныеШаблоны = ШаблоныКодовМаркировки.НайтиСтроки(Отбор);
		
	КонецЕсли;  
	
	//Костыль иначе не пробиваются товары, например табак Corsar
	//Вик 2024-07-31
	Если НайденныеШаблоны.количество() = 2 тогда
		Для Ном =0 по НайденныеШаблоны.Количество()-1 цикл
			Если Найти( Строка(НайденныеШаблоны[Ном].ВидПродукции),"вода") тогда
				НайденныеШаблоны.Удалить(Ном);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;    
	
	Для Ном =0 по НайденныеШаблоны.Количество()-1 цикл   
		Если Не ЗначениеЗаполнено(НайденныеШаблоны[Ном].ВидПродукции) тогда
			НайденныеШаблоны[Ном].ВидПродукции	=	ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак");	
		КонецЕсли;     
		
		Если Не ЗначениеЗаполнено(НайденныеШаблоны[Ном].ВидУпаковки) тогда
			НайденныеШаблоны[Ном].ВидУпаковки	=	ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская");	
		КонецЕсли;    
		
	КонецЦикла; 
	//
	
	Возврат НайденныеШаблоны;

КонецФункции
