Функция ЗакодироватьМРЦ(МРЦ) экспорт 
	СтрокаКодирования = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!""%&'*+-./_,:;=<>?";
	
	Целое1		=	Цел((МРЦ/80));
	Остаток1	=	МРЦ - (Целое1*80);
	
	ЧетвертыйСимвол	=	Сред(СтрокаКодирования,Остаток1+1,1);
	
	
	Целое2		=	Цел((Целое1/80));
	Остаток2	=	Целое1 - (Целое2*80);

	ТретийСимвол	=	Сред(СтрокаКодирования,Остаток2+1,1);   
	
	Если Целое2 >0 тогда 
		Целое3		=	Цел((Целое2/80));
		Остаток3	=	Целое2 - (Целое3*80);

		ВторойСимвол	=	Сред(СтрокаКодирования,Остаток3+1,1); 
		
		Если Целое3 >0 тогда 
			Целое4		=	Цел((Целое3/80));
			Остаток4	=	Целое3 - (Целое4*80);

			ПервыйСимвол	=	Сред(СтрокаКодирования,Остаток4+1,1); 
		иначе   
			ПервыйСимвол	=	"A";
		КонецЕсли;
		
	иначе    
		ПервыйСимвол	=	"A";
		ВторойСимвол	=	"A";
	КонецЕсли; 
	
	Возврат ПервыйСимвол + ВторойСимвол + ТретийСимвол + ЧетвертыйСимвол; 

КонецФункции