
&После("ОбработкаПроведения")
Процедура ТБКОбработкаПроведения(Отказ, РежимПроведения)
	Если Не Отказ тогда
		Если  Номенклатура	= Справочники.Номенклатура.НайтиПоНаименованию("Произвольный букет") тогда
			Если Не ЗначениеЗаполнено(НомерБукета) тогда
				Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕстьNULL(МАКСИМУМ(ТБК_ДанныеПоПроизвольнымБукетам.НомерБукета),0) КАК НомерБукета
		      	 	             |ИЗ
		      	 	             |	РегистрСведений.ТБК_ДанныеПоПроизвольнымБукетам КАК ТБК_ДанныеПоПроизвольнымБукетам");
				Рез = Запрос.Выполнить().Выгрузить();
				
				Если НЕ Рез.Количество() = 0 тогда
					НомерБукета	= Рез[0].НомерБукета + 1;
				иначе
					НомерБукета	= 1;
				КонецЕсли;
			КонецЕсли;
	
			Рег = РегистрыСведений.ТБК_ДанныеПоПроизвольнымБукетам.СоздатьМенеджерЗаписи();
			Рег.Комплектация	=	Ссылка;
			Рег.НомерБукета		=	НомерБукета;			
			Рег.Цена			=	Цена;
			Рег.Записать();	
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
