
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
Если ЗначениеЗаполнено(СписокСкладов) тогда
		
КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = СписокСкладов;
КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Истина;

Иначе

КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = Ложь;

КонецЕсли;

Если ЗначениеЗаполнено(СписокНоменклатуры) тогда
		
КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = СписокНоменклатуры;
КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Истина;

Иначе

КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование  = Ложь;

КонецЕсли;

Если ЗначениеЗаполнено(ДатаНач) тогда
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Значение = ДатаНач;
	
Иначе
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Значение = НачалоМесяца(ТекущаяДата());
	
КонецЕсли;

Если ЗначениеЗаполнено(ДатаКон) тогда
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Значение = КонецДня(ДатаКон);
	
Иначе
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Значение = КонецМесяца(ТекущаяДата());
	
КонецЕсли;




КонецПроцедуры


