
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
	Количество   = Параметры.Количество;

	Если Параметры.Свойство("УжеОтсканированныеБК") тогда
		
		СтрокаУжеОтсканированныеБК	=	Параметры.УжеОтсканированныеБК;
		СтрокаКоличествоВУпаковке	=	Параметры.СтрокаКоличествоВУпаковке;

		Ном = 1;
		
		Пока Найти(СтрокаУжеОтсканированныеБК,Символы.ПС) цикл
			Поз = Найти(СтрокаУжеОтсканированныеБК,Символы.ПС);
			Поз1 = Найти(СтрокаКоличествоВУпаковке,Символы.ПС);
			
			НовСтрока = Марки.Добавить();
			НовСтрока.Марка 				= Сред(СтрокаУжеОтсканированныеБК,1,Поз-1);
			НовСтрока.КоличествоВУпаковке	= Сред(СтрокаКоличествоВУпаковке,1,Поз1-1);
			НовСтрока.НомерСтроки 			= Ном;	
			Ном = Ном+1;
			
			СтрокаУжеОтсканированныеБК	=	Сред(СтрокаУжеОтсканированныеБК,Поз+1);
			СтрокаКоличествоВУпаковке	=	Сред(СтрокаКоличествоВУпаковке,Поз1+1);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть(Марки);  
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	отборС	=	Новый Структура("Марка",Данные);	
	
	Если Марки.НайтиСтроки(отборС).количество()>0 тогда
		Возврат;
	КонецЕсли;
	
	НовСтрока = Марки.Добавить();
	НовСтрока.Марка 		= Данные;
	НовСтрока.НомерСтроки 	= Марки.Количество();
	
	Если СтрДлина(Данные)>29 тогда     
		Попытка
			НовСтрока.КоличествоВУпаковке	=	ОбщегоНазначенияВызовСервера.ПолучитьКоличествоВУпаковкеПоКуару(Данные);		
		Исключение
			НовСтрока.КоличествоВУпаковке	=	1;		
		КонецПопытки;
	иначе
		НовСтрока.КоличествоВУпаковке	=	1;		
	КонецЕсли;
КонецПроцедуры


