
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверят использование механизма регистрации розничных продаж в ЕГАИС.
//
// Параметры:
//  ДатаПродажи  - Дата - дата, на которую нужно проверить использование регистрации продаж.
//
// Возвращаемое значение:
//   Булево - признак использования регистрации продаж.
//
Функция ИспользуетсяРегистрацияРозничныхПродажВЕГАИС(ДатаПродажи = Неопределено) Экспорт
	
	Возврат ИнтеграцияЕГАИСВызовСервера.ИспользуетсяРегистрацияРозничныхПродажВЕГАИС(ДатаПродажи);
	
КонецФункции // ИспользуетсяРегистрацияРозничныхПродажВЕГАИС()

// Проверяет необходимость выгрузки в ЕГАИС немаркируемой алкогольной продукции.
//
Функция ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС() Экспорт
	
	Возврат ИнтеграцияЕГАИСВызовСервера.ПолучитьЗначениеКонстанты("ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС");
	
КонецФункции // ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС()