
&Вместо("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Константы.КонтрагентРозничныйПокупатель.Получить();
	КонецЕсли;
	
	РозничныеПродажиСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
	
	ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
		ЭтотОбъект,
		ОбработкаТабличнойЧастиТоварыКлиентСервер.СуммаДокумента(Товары, ЦенаВключаетНДС),
		"СуммаДокумента");
		
	//ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
	//	ЭтотОбъект,
	//	РозничныеПродажиСервер.НаличиеНеЗарезервированныхСтрок(Товары),
	//	"НаличиеНеЗарезервированныхСтрок");
		
	ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
		ЭтотОбъект,
		РозничныеПродажиСервер.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено"),
		"Отменено");
		
	ДополнительныеСвойства.Вставить("Отказ", Отказ);

КонецПроцедуры
