
&Вместо("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Толстоухов 27.11.2025 PRIC-94 ++
	Если ПометкаУдаления = Истина И Ссылка.ПометкаУдаления = Ложь 
		И (Статус = Перечисления.СтатусыЗаказовПокупателей.НеСогласован 
		Или Статус = Перечисления.СтатусыЗаказовПокупателей.Согласован) Тогда
		Сообщить("Пометка на удаление не доступна из ""Заказов покупателей"".");
		Отказ = Истина;
	КонецЕсли;
	// Толстоухов 27.11.2025 PRIC-94 --
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Константы.КонтрагентРозничныйПокупатель.Получить();
	КонецЕсли;
	
	РозничныеПродажиСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
	
	ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
		ЭтотОбъект,
		ОбработкаТабличнойЧастиТоварыКлиентСервер.СуммаДокумента(Товары, ЦенаВключаетНДС),
		"СуммаДокумента");
		
	//ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
	//	ЭтотОбъект,
	//	РозничныеПродажиСервер.НаличиеНеЗарезервированныхСтрок(Товары),
	//	"НаличиеНеЗарезервированныхСтрок");
		
	ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
		ЭтотОбъект,
		РозничныеПродажиСервер.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено"),
		"Отменено");
		
	ДополнительныеСвойства.Вставить("Отказ", Отказ);

КонецПроцедуры

