
&НаКлиенте
Процедура TBK_ДобавитьРегистрациюПосле(Команда)
	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			Для Каждого Узел Из Группа.ПолучитьЭлементы() Цикл
				Если Узел.Пометка и Найти(Узел.МетаПолноеИмя,"Документ") тогда
					
					ДобавитьРегистрациюДокументовНаСервере(Узел.МетаПолноеИмя);	
				КонецЕсли;
			КонецЦикла;   
		КонецЦикла;
	КонецЦикла;
	
	ОбновитьВсеДанные(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ДобавитьРегистрациюДокументовнаСервере(МетаПолноеИмя);
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	"+МетаПолноеИмя+" КАК ОтчетОРозничныхПродажах
	      	 	             |ГДЕ
	      	 	             |	ОтчетОРозничныхПродажах.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ОтчетОРозничныхПродажах.Организация = &Организация");
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация",Организация);
	Если не ЗначениеЗаполнено(Организация) тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ОтчетОРозничныхПродажах.Организация = &Организация","");	
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из Рез Цикл 
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменаСсылка,Строка.Ссылка);
	КонецЦикла;
КонецПроцедуры