
&НаКлиенте
Процедура TBK_ДобавитьРегистрациюПосле(Команда)
	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			Для Каждого Узел Из Группа.ПолучитьЭлементы() Цикл
				Если Узел.Пометка и Найти(Узел.МетаПолноеИмя,"Документ") тогда
					
					Попытка
						ДобавитьРегистрациюДокументовНаСервере(Узел.МетаПолноеИмя);	
					Исключение
						Сообщить("ошибка регистрации "+ Узел.МетаПолноеИмя);
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;   
		КонецЦикла;
	КонецЦикла;
	
	ОбновитьВсеДанные(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ДобавитьРегистрациюДокументовнаСервере(МетаПолноеИмя);
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	"+МетаПолноеИмя+" КАК ОтчетОРозничныхПродажах
	      	 	             |ГДЕ
	      	 	             |	ОтчетОРозничныхПродажах.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И ОтчетОРозничныхПродажах.Организация = &Организация");
	Запрос.УстановитьПараметр("ДатаНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация",Организация);
	
	
	ориджинал = запрос.Текст;
	Попытка
		Рез = Запрос.Выполнить().Выгрузить();
	Исключение
		запрос.Текст = СтрЗаменить(ориджинал,"ОтчетОРозничныхПродажах.Организация","ОтчетОРозничныхПродажах.КассаККМ.Владелец");
		Рез = Запрос.Выполнить().Выгрузить();
	КонецПопытки;
	
	Для каждого Строка из Рез Цикл 
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменаСсылка,Строка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура TBK_DayByDayПосле(Команда)
	// Вставить содержимое обработчика.
	
	окончание = ДатаКон;
	шаг = 3;
	
	Пока ДатаНач <= окончание Цикл
		ДатаКон = КонецДня(ДатаНач)+60*60*24*шаг;
		Если ДатаКон > окончание Тогда
			ДатаКон = окончание;
		КонецЕсли;
		TBK_ДобавитьРегистрациюПосле(неопределено);
		
		ВыполнитьОбмен(УзелОбменаСсылка);
		
		ДатаНач = КонецДня(ДатаКон) + 1;
	КонецЦикла; 	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ВыполнитьОбмен(узел)
	
	отказ = ложь;
	
	ПарамОбмена = новый Структура;
	ПарамОбмена.Вставить("ВидТранспортаСообщенийОбмена",Перечисления.ВидыТранспортаСообщенийОбмена.COM);
	ПарамОбмена.Вставить("ВыполнятьВыгрузку",ЛОЖЬ);
	ПарамОбмена.Вставить("ВыполнятьЗагрузку",ЛОЖЬ);
	ПарамОбмена.Вставить("ДлительнаяОперация",ЛОЖЬ);
	ПарамОбмена.Вставить("ДлительнаяОперацияРазрешена",ЛОЖЬ);
	ПарамОбмена.Вставить("ИдентификаторОперации","");
	ПарамОбмена.Вставить("ИдентификаторФайла","");
	ПарамОбмена.Вставить("ИнтервалОжиданияНаСервере",0);
	ПарамОбмена.Вставить("ПараметрыАутентификации");
	ПарамОбмена.Вставить("СообщениеДляСопоставленияДанных",ЛОЖЬ);
	ПарамОбмена.Вставить("ТолькоПараметры");
	
	ПарамОбмена.ВыполнятьВыгрузку = ЛОЖЬ;
	ПарамОбмена.ВыполнятьЗагрузку = ИСТИНА;
	ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(узел,ПарамОбмена,отказ,неопределено);
	
	
	ПарамОбмена.ВыполнятьВыгрузку = ИСТИНА;
	ПарамОбмена.ВыполнятьЗагрузку = ЛОЖЬ;
	ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(узел,ПарамОбмена,отказ,неопределено);
	
	
КонецФункции