
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТЗПоГруппам =	Новый ТаблицаЗначений;
	ТЗПоГруппам.Колонки.Добавить("ГруппаНоменклатуры");	
	ТЗПоГруппам.Колонки.Добавить("Сумма");
	
	Для каждого Строка из ДанныеЗаполнения.Товары цикл
		Если Строка.ЭтоНедостача тогда
			СуммаНедостачиФакт = СуммаНедостачиФакт - (Строка.Итого * Строка.ЦенаВРознице);
			
			НоваяСтрока 					=  ТЗПоГруппам.Добавить();
			НоваяСтрока.Сумма				=  -Строка.Итого * Строка.ЦенаВРознице;
			НоваяСтрока.ГруппаНоменклатуры 	=  Справочники.Номенклатура.НайтиПоКоду(лев(Строка.Номенклатура.ПолныйКод(),11));
			
		КонецЕсли;
	КонецЦикла;
	СуммаНеРаспределеноНедостача = СуммаНедостачиФакт;	
	Ответственный				 = ДанныеЗаполнения.Ответственный;
	ДокументИнвентаризация		 = ДанныеЗаполнения.ссылка;
	
	ТЗПоГруппам.Свернуть("ГруппаНоменклатуры","Сумма");
	ГруппыНоменклатуры.Загрузить(ТЗПоГруппам);

КонецПроцедуры
