
// Розничные токены Честного знака отозваны, и коды маркировки проверяются без CDN-площадок.
&ИзменениеИКонтроль("ПриОткрытииСменыНаККТ")
Процедура ТБКПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации)
	
	#Удаление
	Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		ПараметрыЗапроса                         = ИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
		ПараметрыЗапроса.УникальныйИдентификатор = Новый УникальныйИдентификатор;
		ПараметрыЗапроса.Параметры               = Новый Структура("НеВыводитьОкноОжидания", Истина);
		
		ИнтерфейсИСМПОбщегоНазначенияКлиент.АктуализацияСпискаCDNПлощадок(ПараметрыЗапроса);
	КонецЕсли;
	#КонецУдаления
	
КонецПроцедуры
