
Функция GetVersion()
	// Вставить содержимое обработчика.
	
	результ = "";
	
	мРасширений = РасширенияКонфигурации.Получить();
	
	Для Каждого расширение из мРасширений Цикл
		результ = результ + ?(ЗначениеЗаполнено(результ),Символы.ПС,"")+расширение.Имя+":"+расширение.Версия;
	КонецЦикла;
	
	возврат результ + Символы.ПС + ОбщегоНазначения.ПолучитьМагазин();
КонецФункции

Функция Get(method, params)	
	результ = ВыполнитьЗапросСервер("GET",method,params);
	результ = ТБК_WS.СтруктураВjson(результ);
	return результ;
КонецФункции


Функция Post(method, params)
	результ = ВыполнитьЗапросСервер("POST",method,params);
	результ = ТБК_WS.СтруктураВjson(результ);
	return результ;
КонецФункции



Функция ВыполнитьЗапросСервер(_метод,_функция,_параметрыJson)
	_рез = "";
	_параметры = ТБК_WS.jsonВСтруктура(_параметрыJson);
  	Выполнить("_рез = ТБК_WS_"+_метод+"."+_функция+"(_параметры);");
	Возврат _рез;
КонецФункции


