
Функция GetVersion()
	// Вставить содержимое обработчика.
	
	результ = "";
	
	мРасширений = РасширенияКонфигурации.Получить();
	
	Для Каждого расширение из мРасширений Цикл
		результ = результ + ?(ЗначениеЗаполнено(результ),Символы.ПС,"")+расширение.Имя+":"+расширение.Версия;
	КонецЦикла;
	
	возврат результ;
КонецФункции

Функция Get(method, params)
	// Вставить содержимое обработчика.
	
	вхПараметры = jsonВСтруктура(params);	
	результ = Новый структура;
	
	//
	Если method  = "DailySelesReport" Тогда
		результ = ТБК_WS_GET.DailySelesReport(вхПараметры);
	КонецЕсли;
	
	//
	
	return  СтруктураВjson(результ)
КонецФункции




Функция jsonВСтруктура(Значение)

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Значение);
    Возврат ПрочитатьJSON(ЧтениеJSON, Ложь);

КонецФункции


Функция СтруктураВjson(Значение)

    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции