
&Вместо("КассаФискализацииРаспределяемойНоменклатуры")
Функция ТБККассаФискализацииРаспределяемойНоменклатуры(Магазин, РабочееМесто, Номенклатура, Склад)

	//Вик 2025-10-08
	Если ЗначениеЗаполнено(РабочееМесто) и ЗначениеЗаполнено(РабочееМесто.КассаККМ_ПоУмолчанию) тогда 
		Возврат РабочееМесто.КассаККМ_ПоУмолчанию.ПодключаемоеОборудование;
	КонецЕсли;   
	//

	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РаспределениеНоменклатуры.РабочееМесто = &РабочееМесто
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет,
	|	РаспределениеНоменклатуры.Организация КАК Организация
	|ПОМЕСТИТЬ втОрганизации
	|ИЗ
	|	РегистрСведений.РаспределениеНоменклатуры КАК РаспределениеНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО РаспределениеНоменклатуры.ТоварнаяГруппа = Номенклатура.ТоварнаяГруппа
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И &УсловиеМагазинРаспределения
	|	И (РаспределениеНоменклатуры.РабочееМесто = &РабочееМесто
	|			ИЛИ РаспределениеНоменклатуры.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	Склады.Организация
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	&УсловиеСклад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	Магазины.СкладПродажи.Организация
	|ИЗ
	|	Справочник.Магазины КАК Магазины
	|ГДЕ
	|	&УсловиеМагазин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КассыККМ.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ИЗ
	|	втОрганизации КАК втОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО втОрганизации.Организация = КассыККМ.Владелец
	|			И (КассыККМ.РабочееМесто = &РабочееМесто)
	|			И (ЕСТЬNULL(КассыККМ.ПодключаемоеОборудование.ТипОборудования, ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	втОрганизации.Приоритет";
	
	УсловиеМагазинРаспределения = "ЛОЖЬ";
	УсловиеМагазин = "ЛОЖЬ";
	УсловиеСклад = "ЛОЖЬ";
	Если ЗначениеЗаполнено(Магазин) Тогда
		Запрос.УстановитьПараметр("Магазин", Магазин);
		УсловиеМагазинРаспределения = "РаспределениеНоменклатуры.Магазин = &Магазин";
		УсловиеМагазин = "Магазины.Ссылка = &Магазин";
	КонецЕсли;
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
		УсловиеСклад = "Склады.Ссылка = &Склад";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеМагазинРаспределения", УсловиеМагазинРаспределения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеМагазин", УсловиеМагазин);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСклад", УсловиеСклад);
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПодключаемоеОборудование = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПодключаемоеОборудование)
			И ОборудованиеЧекопечатающиеУстройстваВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(Выборка.ПодключаемоеОборудование) Тогда
			ПодключаемоеОборудование = Выборка.ПодключаемоеОборудование;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключаемоеОборудование;

КонецФункции
