
&НаКлиенте
Процедура ДобавитьТовар(Команда)
	Если Товар.Количество() > 0 Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ИмяДействия" , НСтр("ru = 'Подбор номенклатуры'"));
		
		СтруктураОтвета.Вставить("Номенклатура" , Товар[0].Номеклатура);
		СтруктураОтвета.Вставить("Цена" , Товар[0].Цена);
	
		СтруктураОтвета.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		СтруктураОтвета.Вставить("Упаковка" , ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"));
	
		ОповеститьОВыборе(СтруктураОтвета);
	КонецЕсли; 
КонецПроцедуры

//Номенклатура   = РезультатВыбора.ДанныеВыбора.Номенклатура;
//	Характеристика = РезультатВыбора.ДанныеВыбора.Характеристика;
//	Серия = РезультатВыбора.ДанныеВыбора.Серия;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Этаформа.Элементы.Комментарий.Заголовок = Параметры.Комментарий;
	
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номеклатура = Параметры.НоменклатураБК;
	
	ПК	=	параметры.Номенклатура.ПолныйКод();                             //напитки
	//электронки и жидкости						//Табак					    //Напитки
	Если найти(ПК,"00048205348") или найти(ПК,"00048205349") или найти(ПК,"00048205246") Тогда
		Если Параметры.Характеристика.Пустая() Тогда
			
			НоваяСтрока.Цена = ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(параметры.Номенклатура);
		Иначе
			
			Если СтрокаСостоитИзЦифр(Строка(Параметры.Характеристика)) Тогда
				НоваяСтрока.Цена = Число(Строка(Параметры.Характеристика));		
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры 

&НаСерверебезКонтекста
Функция СтрокаСостоитИзЦифр(Строка)
	СтрокаПроверки  = СокрЛП(Строка);
	Для НомерСимвола = 0 По СтрДлина(СтрокаПроверки) Цикл 
        Если Найти("0123456789", Сред(СтрокаПроверки, НомерСимвола, 1)) = 0 Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;
КонецФункции
