
&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ИмяДействия" , НСтр("ru = 'Подбор номенклатуры'"));
	СтруктураОтвета.Вставить("Номенклатура" , Номенклатура);
	СтруктураОтвета.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	СтруктураОтвета.Вставить("Упаковка" , ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"));
			
	ОповеститьОВыборе(СтруктураОтвета);
		
КонецПроцедуры

//Номенклатура   = РезультатВыбора.ДанныеВыбора.Номенклатура;
//	Характеристика = РезультатВыбора.ДанныеВыбора.Характеристика;
//	Серия = РезультатВыбора.ДанныеВыбора.Серия;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.НоменклатураБК;
	
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номеклатура = Параметры.НоменклатураБК;
	
КонецПроцедуры  

