
&НаКлиенте
Процедура ДобавитьТовар(Команда)
	Если Товар.Количество() > 0 Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ИмяДействия" , НСтр("ru = 'Подбор номенклатуры'"));
		
		СтруктураОтвета.Вставить("Номенклатура" , Товар[0].Номеклатура);
		СтруктураОтвета.Вставить("Цена" , Товар[0].Цена);
	
		СтруктураОтвета.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		
		СтруктураОтвета.Вставить("Упаковка" , ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"));
		
		СтруктураОтвета.Вставить("Количество" , Товар[0].Количество);  // Толстоухов 05.02.2026 KRO-98 ++
	
		ОповеститьОВыборе(СтруктураОтвета);
	КонецЕсли; 
КонецПроцедуры

// Толстоухов 05.02.2026 KRO-98 ++
Функция ПолучитьДанныеШтрихкода(Штрихкод)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Упаковка КАК Упаковка,
		|	ЕСТЬNULL(Штрихкоды.Упаковка.Коэффициент, 1) КАК Коэффициент
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Упаковка, Коэффициент", Выборка.Упаковка, Выборка.Коэффициент);
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Этаформа.Элементы.Комментарий.Заголовок = Параметры.Комментарий;
	
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номеклатура = Параметры.НоменклатураБК;
	
	ПК	=	параметры.Номенклатура.ПолныйКод();
	//электронки и жидкости						//Табак					    //Напитки
	Если найти(ПК,"00048205348") или найти(ПК,"00048205349") или найти(ПК,"00048205246") Тогда
		Если Параметры.Характеристика.Пустая() Тогда
			
			НоваяСтрока.Цена = ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(параметры.Номенклатура);
		Иначе
			
			Если СтрокаСостоитИзЦифр(Строка(Параметры.Характеристика)) Тогда
				НоваяСтрока.Цена = Число(Строка(Параметры.Характеристика));		
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
	// Толстоухов 05.02.2026 KRO-98 ++	
	ДанныеШтрихкода = ПолучитьДанныеШтрихкода(параметры.ДанныеШтрихкода.Штрихкод);
	НоваяСтрока.Упаковка = ДанныеШтрихкода.Упаковка;
	Коэффициент = ДанныеШтрихкода.Коэффициент;	
	
	НоваяСтрока.Количество = Коэффициент;
	НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
	// Толстоухов 05.02.2026 --
	
КонецПроцедуры 

&НаСерверебезКонтекста
Функция СтрокаСостоитИзЦифр(Строка)
	СтрокаПроверки  = СокрЛП(Строка);
	Для НомерСимвола = 0 По СтрДлина(СтрокаПроверки) Цикл 
        Если Найти("0123456789", Сред(СтрокаПроверки, НомерСимвола, 1)) = 0 Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;
КонецФункции
