&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	Если Товар.Количество() > 0 Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ИмяДействия" , НСтр("ru = 'Подбор номенклатуры'"));
		
		СтруктураОтвета.Вставить("Номенклатура" , Товар[0].Номенклатура);
		СтруктураОтвета.Вставить("Цена" , Товар[0].Цена);
	
		СтруктураОтвета.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		СтруктураОтвета.Вставить("Упаковка" , ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"));
	
		ОповеститьОВыборе(СтруктураОтвета);
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номенклатура = Параметры.НоменклатураБК;
	
	ПК	=	параметры.Номенклатура.ПолныйКод();
	Если найти(ПК,"ВЭ100001512") или найти(ПК,"ВЭ100000499") или найти(ПК,"ВЭ100002986") или найти(ПК,"ВЭ000000003")Тогда
		НоваяСтрока.Цена = ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(параметры.Номенклатура);	
	КонецЕсли;
	
КонецПроцедуры  