
&НаКлиенте
Процедура ДобавитьТовар(Команда)
	Если Товар.Количество() > 0 Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ИмяДействия" , НСтр("ru = 'Подбор номенклатуры'"));
		
		СтруктураОтвета.Вставить("Номенклатура" , Товар[0].Номеклатура);
		СтруктураОтвета.Вставить("Цена" , Товар[0].Цена);
	
		СтруктураОтвета.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
		СтруктураОтвета.Вставить("Упаковка" , ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.ПустаяСсылка"));
	
		ОповеститьОВыборе(СтруктураОтвета);
	КонецЕсли; 
КонецПроцедуры

//Номенклатура   = РезультатВыбора.ДанныеВыбора.Номенклатура;
//	Характеристика = РезультатВыбора.ДанныеВыбора.Характеристика;
//	Серия = РезультатВыбора.ДанныеВыбора.Серия;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Этаформа.Элементы.Комментарий.Заголовок = Параметры.Комментарий;
	
	НоваяСтрока = Товар.Добавить();
	НоваяСтрока.Номеклатура = Параметры.НоменклатураБК;
	
	ПК	=	параметры.Номенклатура.ПолныйКод();
	Если найти(ПК,"00048205348") Тогда
		НоваяСтрока.Цена = ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(параметры.Номенклатура);	
	КонецЕсли; 
	
КонецПроцедуры  
