Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Сотрудник) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено Физлицо.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Сотрудник.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать в качестве физлица группу!";
			Прервать;
		КонецЕсли;
		Сотрудник=Запись.Сотрудник;
	КонецЦикла;
	
	Если Отказ Тогда                  
		Сообщить(СтрокаОтказа); 
    Иначе
		 ЗаписатьИсторию(ЭтотОбъект, Сотрудник);
	КонецЕсли; 
	
КонецПроцедуры

//ЛК Андрей Добавление истории у этого регистира=======
Процедура ЗаписатьИсторию(ЭтотОбъект, Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст="ВЫБРАТЬ
	|	СтавкиОсновныхВидовРасчетовСотрудников.Сумма,
	|	СтавкиОсновныхВидовРасчетовСотрудников.ВидРасчета,
	|	СтавкиОсновныхВидовРасчетовСотрудников.Регистратор
	|ИЗ
	|	РегистрСведений.СтавкиОсновныхВидовРасчетовСотрудников КАК СтавкиОсновныхВидовРасчетовСотрудников
	|ГДЕ
	|	СтавкиОсновныхВидовРасчетовСотрудников.Сотрудник = &Сотрудник";
	Запрос = Запрос.Выполнить().Выгрузить();
	Для каждого Запись Из ЭтотОбъект Цикл
		Новое=Истина;
		Для каждого Строчка из Запрос Цикл 
			Если Запись.ВидРасчета=Строчка.ВидРасчета И Строка(Запись.ВидРасчета)<>"Оклад стажера (за смену)" Тогда 
				Новое=Ложь;
				Если Запись.Сумма<>Строчка.Сумма Тогда   //Если запись просто меняют.
						НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Дата=ТекущаяДата();
						НоваяЗапись.Событие=Строка(Строчка.Сумма)+" -> "+Строка(Запись.Сумма);
						НоваяЗапись.ИзменённыйЭлемент=Запись.ВидРасчета;
						НоваяЗапись.Сотрудник=Запись.Сотрудник;
						НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
						НаборЗаписей.Записать(Ложь);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если Новое=Истина И Строка(Запись.ВидРасчета)<>"Оклад стажера (за смену)"Тогда   //Если записи не было в регистре и это новая.
				НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Дата=ТекущаяДата();
				НоваяЗапись.Событие="Новая запись: "+Строка(Запись.Сумма);
				НоваяЗапись.ИзменённыйЭлемент=Запись.ВидРасчета;  
				НоваяЗапись.Сотрудник=Сотрудник;
				НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
				НаборЗаписей.Записать(Ложь);

		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строчка из Запрос Цикл
		Удаленное=Истина; 	
		Для каждого Запись Из ЭтотОбъект Цикл
			Если Запись.ВидРасчета=Строчка.ВидРасчета Тогда 
				Удаленное=Ложь;
			КонецЕсли;
		КонецЦикла; 
		Если Удаленное=Истина И Строка(Строчка.ВидРасчета)<>"Оклад стажера (за смену)" Тогда  //Если запись была в регистре, но в новых записях её нет, значит она удалена. 
				НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Дата=ТекущаяДата();
				НоваяЗапись.Событие="Удалена запись с суммой: "+Строка(Строчка.Сумма);
				НоваяЗапись.ИзменённыйЭлемент=Строчка.ВидРасчета;
				НоваяЗапись.Сотрудник=Сотрудник;
				НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
				НаборЗаписей.Записать(Ложь);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//=====================================================