Функция ПолучитьТаблицуПоФокуснойМотивации(ИтогоПремииФокус=0, Период, ПереключательМесяцДень =0, Продавец) экспорт
//ФОКУСНАЯ	
	ИтогоПремииФокус	=	0;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.ПланКоличество КАК ПланКоличество,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Процент КАК Процент,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Сумма КАК Сумма,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.СверхПлана КАК СверхПлана,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Тип КАК Тип
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКФокуснаяМотивация.СрезПоследних(, ) КАК ТБКФокуснаяМотивацияСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.ПланКоличество,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Процент,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Сумма,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.СверхПлана,
	      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Тип
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ПланКоличество УБЫВ");
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));

	ГруппыНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРасшифровка = Новый ТаблицаЗначений;
	ТаблицаРасшифровка.Колонки.Добавить("ФокусГруппа",,		"Группа");
	ТаблицаРасшифровка.Колонки.Добавить("ПланПродаж",,		"План");
	ТаблицаРасшифровка.Колонки.Добавить("ФактПродаж",,		"Факт");
	ТаблицаРасшифровка.Колонки.Добавить("КоличествоСверх",,	"Количество сверх плана");
	ТаблицаРасшифровка.Колонки.Добавить("СуммаФакт",,		"Сумма факт");
	ТаблицаРасшифровка.Колонки.Добавить("СуммаСверх",,		"Сумма сверх плана");
	ТаблицаРасшифровка.Колонки.Добавить("СуммаПремии",,		"Сумма премии");
	ТаблицаРасшифровка.Колонки.Добавить("Заголовок",,		"Заголовок");
	
	
	//УЧЕТ БК
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Количество, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Количество, 0)
	      	 	             |			КОНЕЦ), 0) КАК Количество,
	      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
	      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
	      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
	      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
	      	 	             |			КОНЕЦ), 0) КАК Сумма,
	      	 	             |	ЧекККМТовары.Номенклатура КАК Номенклатура,
	      	 	             |	ЧекККМТовары.Ссылка.Дата КАК Дата
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.Ссылка.Проведен
	      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
	      	 	             |	И ЧекККМТовары.Продавец = &Продавец
	      	 	             |	И ЧекККМТовары.Номенклатура.Наименование ПОДОБНО &Наименование
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	ЧекККМТовары.Номенклатура,
	      	 	             |	ЧекККМТовары.Ссылка.Дата
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата");
	
	Запрос.УстановитьПараметр("Наименование","% БК%"); 	
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;

	Запрос.УстановитьПараметр("Продавец",Продавец);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
	
	ТаблицаБК	=	Запрос.Выполнить().Выгрузить();
	Для каждого Строка из ТаблицаБК цикл
		Строка.Номенклатура	=	Справочники.Номенклатура.НайтиПоНаименованию(СтрЗаменить(Строка.Номенклатура.Наименование, " БК",""));		
	КонецЦикла;
	//
	
	
	Для каждого СтрокаГруппа из ГруппыНоменклатуры цикл
		ЗапросН	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Номенклатура КАК Номенклатура
		      	 	             |ИЗ
		      	 	             |	РегистрСведений.ТБКФокуснаяМотивация.СрезПоследних(, ) КАК ТБКФокуснаяМотивацияСрезПоследних
		      	 	             |ГДЕ
		      	 	             |	ТБКФокуснаяМотивацияСрезПоследних.Период МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И ТБКФокуснаяМотивацияСрезПоследних.Тип = &Тип");
		ЗапросН.УстановитьПараметр("Тип",СтрокаГруппа.Тип);
		ЗапросН.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		ЗапросН.УстановитьПараметр("ДатаКон",КонецМесяца(Период));

		РезН	=	ЗапросН.Выполнить().Выгрузить();
		МассивНоменклатуры	=	РезН.ВыгрузитьКолонку("Номенклатура");
		
		
		БонусЗаГруппу			=	0;
		СуммаПродажСверхПлана	=	0;
		 
		
		ПланКоличество		=  СтрокаГруппа.ПланКоличество;   
		ПроцентПремии		=  СтрокаГруппа.Процент;
		СуммаПремии			=  СтрокаГруппа.Сумма;
		
		ИтогоПродано 		= 0;
		ИтогоПроданоСумма	= 0;
		
		Если СтрокаГруппа.СверхПлана тогда   //только за то что сверх плана
			ТЗПродано	=	ПолучитьКоличествоПродажПоГруппе(Продавец, МассивНоменклатуры,,ТаблицаБК,ПереключательМесяцДень,Период);			

			Для каждого Строка из ТЗПродано цикл
				ИтогоПродано		=	ИтогоПродано 		+ Строка.Количество; 
				ИтогоПроданоСумма	=	ИтогоПроданоСумма 	+ Строка.Сумма;
				
				
				Если ИтогоПродано > ПланКоличество тогда
					Разница				= ИтогоПродано - ПланКоличество;
						
					КНачислению			= Мин(Разница, Строка.Количество); 
					СуммаПродажСверхПлана	=	0;
					
					Если ПроцентПремии>0  тогда    
						КНачислениюСумма		=   (Строка.Сумма /Строка.Количество)*КНачислению ;			
						ИтогоПремииФокус		=	ИтогоПремииФокус   		+ КНачислениюСумма/100 * ПроцентПремии;
						БонусЗаГруппу			=	БонусЗаГруппу 			+ КНачислениюСумма/100 * ПроцентПремии;
						СуммаПродажСверхПлана	=	СуммаПродажСверхПлана 	+ КНачислениюСумма;
					иначе
						ИтогоПремииФокус		=	ИтогоПремииФокус   		+ КНачислению * СуммаПремии;
						БонусЗаГруппу			=	БонусЗаГруппу 			+ КНачислению * СуммаПремии;
						СуммаПродажСверхПлана	=	СуммаПродажСверхПлана 	+ (Строка.Сумма /Строка.Количество) * КНачислению;
					КонецЕсли;
					
				КонецЕсли;				
			КонецЦикла; 
			
			Если ПроцентПремии>0  тогда    
				НужЗаголовок	=	"Процент премии на сумму сверх плана. "+ Символы.ПС +СуммаПродажСверхПлана +" * "+ ПроцентПремии+"% = "+БонусЗаГруппу;
			иначе
				НужЗаголовок	=	Строка(СуммаПремии) + " за каждую проданную штуку сверх плана. "+ Символы.ПС  + Макс(ИтогоПродано - ПланКоличество,0) + " * " +СуммаПремии + " = "+БонусЗаГруппу;
			КонецЕсли;
			
			НовСтр	=	ТаблицаРасшифровка.Добавить();
			НовСтр.Заголовок					=	НужЗаголовок;
			НовСтр.ФокусГруппа					=	СтрокаГруппа.Тип;
			НовСтр.ПланПродаж					=	ПланКоличество;
			НовСтр.ФактПродаж					=	ИтогоПродано;
			НовСтр.КоличествоСверх				=	Макс(НовСтр.ФактПродаж - ПланКоличество,0);
			НовСтр.СуммаФакт					=	ИтогоПроданоСумма;
			НовСтр.СуммаСверх					=	СуммаПродажСверхПлана;
			НовСтр.СуммаПремии					=	БонусЗаГруппу;
			
		иначе //начисляем за все
			ТЗПродано	=	ПолучитьКоличествоПродажПоГруппе(Продавец,МассивНоменклатуры, Истина, ТаблицаБК, ПереключательМесяцДень, Период);			
			
			Если ТЗПродано.количество() > 0 тогда
				ИтогоПродано		=	ТЗПродано[0].Количество; 
				ИтогоПроданоСумма	=	ТЗПродано[0].Сумма;				
			КонецЕсли; 
			
			Если ИтогоПродано > ПланКоличество тогда
				
				Если ПроцентПремии>0  тогда    
					КНачислениюСумма		=   (ИтогоПроданоСумма/100)	 * ПроцентПремии;			
					ИтогоПремииФокус		=	ИтогоПремииФокус   		 + КНачислениюСумма;
					БонусЗаГруппу			=	БонусЗаГруппу			 + КНачислениюСумма; 					
				иначе 					
					ИтогоПремииФокус		=	ИтогоПремииФокус    + ИтогоПродано * СуммаПремии;
					БонусЗаГруппу			=	БонусЗаГруппу 		+ ИтогоПродано * СуммаПремии;
				КонецЕсли;
			КонецЕсли;  			
			
			Если ПроцентПремии>0  тогда    
				НужЗаголовок	=	"Процент премии на сумму продаж. "+ Символы.ПС +ИтогоПроданоСумма + " * "+ ПроцентПремии+"% = "+ БонусЗаГруппу;
			иначе
				НужЗаголовок	=	Строка(СуммаПремии) + " за каждую проданную штуку. "+ Символы.ПС + ИтогоПродано + " * " +СуммаПремии + " = "+БонусЗаГруппу;
			КонецЕсли;  

			
			НовСтр	=	ТаблицаРасшифровка.Добавить();
			НовСтр.ФокусГруппа					=	СтрокаГруппа.Тип;
			НовСтр.Заголовок					=	НужЗаголовок;
			НовСтр.ПланПродаж					=	ПланКоличество;
			НовСтр.ФактПродаж					=	ИтогоПродано;
			//НовСтр.КоличествоСверх				=	ИтогоПродано;
			НовСтр.СуммаФакт					=	ИтогоПроданоСумма;
			//НовСтр.СуммаСверх					=	ИтогоПроданоСумма;
			НовСтр.СуммаПремии					=	БонусЗаГруппу;
	
		КонецЕсли;
		
	КонецЦикла;
	
	//ОТДЕЛЬНО УЦЕНКА
	СтруктураДанныхУценка	=	ПолучитьДанныеПоУценке(ПереключательМесяцДень, Период, Продавец);  
	
	НовСтр	=	ТаблицаРасшифровка.Добавить();
	
	НужЗаголовок	=	"Процент премии на сумму продаж. " + Символы.ПС + СтруктураДанныхУценка.СуммаТабак + " * 10% = "+ СтруктураДанныхУценка.ПремияТабак;
	НовСтр.Заголовок					=	НужЗаголовок;
	НовСтр.ФокусГруппа					=	"Табак (Уценка)";
	НовСтр.ПланПродаж					=	0;
	НовСтр.ФактПродаж					=	СтруктураДанныхУценка.ПроданоТабак;
	//НовСтр.КоличествоСверх				=	НовСтр.ФактПродаж;
	НовСтр.СуммаФакт					=	СтруктураДанныхУценка.СуммаТабак;
	//НовСтр.СуммаСверх					=	СтруктураДанныхУценка.СуммаТабак;
	НовСтр.СуммаПремии					=	СтруктураДанныхУценка.ПремияТабак;
	
	НовСтр	=	ТаблицаРасшифровка.Добавить();
	НужЗаголовок	=	"Процент премии на сумму продаж. " + Символы.ПС +СтруктураДанныхУценка.СуммаСувениры + " * 20% = "+ СтруктураДанныхУценка.ПремияСувениры;
	НовСтр.Заголовок					=	НужЗаголовок;
	НовСтр.ФокусГруппа					=	"Сувениры (Уценка)";
	НовСтр.ПланПродаж					=	0;
	НовСтр.ФактПродаж					=	СтруктураДанныхУценка.ПроданоСувениры;
	//НовСтр.КоличествоСверх				=	НовСтр.ФактПродаж;
	НовСтр.СуммаФакт					=	СтруктураДанныхУценка.СуммаСувениры;
	//НовСтр.СуммаСверх					=	СтруктураДанныхУценка.СуммаСувениры;
	НовСтр.СуммаПремии					=	СтруктураДанныхУценка.ПремияСувениры; 
	
	ИтогоПремииФокус					=	ИтогоПремииФокус + СтруктураДанныхУценка.ПремияСувениры + СтруктураДанныхУценка.ПремияТабак;
	//      
	
	Возврат ТаблицаРасшифровка;
КонецФункции

Функция ПолучитьКоличествоПродажПоГруппе(Продавец_, Номенклатура, НеГруппироватьПоДате = Ложь, ТаблицаБК = Неопределено, ПереключательМесяцДень, Период) 
	
	Если НеГруппироватьПоДате тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Количество, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Количество, 0)
		      	 	             |			КОНЕЦ), 0) КАК Количество,
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
		      	 	             |			КОНЕЦ), 0) КАК Сумма
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		      	 	             |ГДЕ
		      	 	             |	ЧекККМТовары.Ссылка.Проведен
		      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
		      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
		      	 	             |	И ЧекККМТовары.Продавец = &Продавец
		      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&Номенклатура)");
		
		Если ТаблицаБК <> Неопределено тогда
			ТаблицаБК.Свернуть("Номенклатура","Количество,Сумма");
		КонецЕсли;
		
	иначе
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Количество, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Количество, 0)
		      	 	             |			КОНЕЦ), 0) КАК Количество,
		      	 	             |	ЧекККМТовары.Ссылка.Дата КАК Дата,
		      	 	             |	ЕСТЬNULL(СУММА(ВЫБОР
		      	 	             |				КОГДА ЧекККМТовары.Ссылка.ВидОперации = &ВидПродажа
		      	 	             |					ТОГДА ЕСТЬNULL(ЧекККМТовары.Сумма, 0)
		      	 	             |				ИНАЧЕ ЕСТЬNULL(-ЧекККМТовары.Сумма, 0)
		      	 	             |			КОНЕЦ), 0) КАК Сумма
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		      	 	             |ГДЕ
		      	 	             |	ЧекККМТовары.Ссылка.Проведен
		      	 	             |	И ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		      	 	             |	И (ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ
		      	 	             |			ИЛИ ЧекККМТовары.Ссылка.СтатусЧекаККМ = &СтатусЧекаККМ1)
		      	 	             |	И ЧекККМТовары.Продавец = &Продавец
		      	 	             |	И ЧекККМТовары.Номенклатура В ИЕРАРХИИ (&Номенклатура)
		      	 	             |
		      	 	             |СГРУППИРОВАТЬ ПО
		      	 	             |	ЧекККМТовары.Ссылка.Дата
		      	 	             |
		      	 	             |УПОРЯДОЧИТЬ ПО
		      	 	             |	Дата");
	КонецЕсли;
		
	Если ПереключательМесяцДень = 0 тогда	
		Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	иначе
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Период));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период));  	
	КонецЕсли;

	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Продавец",Продавец_);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("СтатусЧекаККМ1",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
		
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаБК <> Неопределено тогда
		Если ТаблицаБК.Количество()>0 тогда
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ТаблицаБК.Количество КАК Количество,
			      	 	             |	ТаблицаБК.Сумма КАК Сумма
			      	 	             |ПОМЕСТИТЬ Итог
			      	 	             |ИЗ
			      	 	             |	&ТаблицаБК КАК ТаблицаБК
			      	 	             |ГДЕ
			      	 	             |	ТаблицаБК.Номенклатура В ИЕРАРХИИ(&Номенклатура)
			      	 	             |;
			      	 	             |
			      	 	             |////////////////////////////////////////////////////////////////////////////////
			      	 	             |ВЫБРАТЬ
			      	 	             |	Итог.Количество КАК Количество,
			      	 	             |	Итог.Сумма КАК Сумма
			      	 	             |ИЗ
			      	 	             |	Итог КАК Итог");
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);    
			Запрос.УстановитьПараметр("ТаблицаБК",ТаблицаБК);

			РезБК	=	запрос.Выполнить().Выгрузить();
			Для каждого Строка из РезБК цикл
				НоваяСтрока	=	Рез.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
				Рез.Свернуть("","Количество,Сумма");
			КонецЦикла;
			
			Если не НеГруппироватьПоДате тогда
				Рез.Свернуть("","Количество,Сумма,Дата");
				Рез.Сортировать("Дата");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат рез;
	
КонецФункции


Функция ПолучитьДанныеПоУценке(ПереключательМесяцДень, Период, Продавец)	
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	КомментарииСтатистики.ХешНаименования КАК ХешНаименования,
	      	 	             |	КомментарииСтатистики.Наименование КАК Наименование
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.КомментарииСтатистики КАК КомментарииСтатистики
	      	 	             |ГДЕ
	      	 	             |	КомментарииСтатистики.Наименование ПОДОБНО &НаименованиеТБК
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 4, 2) = &Месяц
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 7, 4) = &Год
	      	 	             |	И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 1, 2) = &День");
	Запрос.УстановитьПараметр("НаименованиеТБК","%tbkskidka%");

	ДеньСтрока	=	Строка(День(Период));
	МесяцСтрока	=	Строка(Месяц(Период));
	ГодСтрока	=	ОбщегоНазначения.УдалениеНезначимыхСимволов(Строка(Год(Период)));

	Если СтрДлина(МесяцСтрока) = 1 тогда МесяцСтрока = "0"+ МесяцСтрока; КонецЕсли;
	
	Запрос.УстановитьПараметр("Месяц",МесяцСтрока);
	Запрос.УстановитьПараметр("Год",ГодСтрока);
	
	Если ПереключательМесяцДень = 1 тогда
		Если СтрДлина(ДеньСтрока) = 1 тогда ДеньСтрока = "0"+ ДеньСтрока; КонецЕсли;
		Запрос.УстановитьПараметр("День",ДеньСтрока);   
	иначе
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"И ПОДСТРОКА(КомментарииСтатистики.ХешНаименования, 1, 2) = &День","");		
	КонецЕсли;
	
	МассивВозврата	=	Новый Массив;
	
	
	ПроданоТабак	=	0;
	ПроданоСувениры	=	0;
	ПремияТабак		=	0;
	ПремияСувениры	=	0;
	СуммаТабак		=	0;
	СуммаСувениры	=	0;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из рез цикл
		//изменения 20240205
		Если ЗначениеЗаполнено(Продавец) и ТекущаяДата() > '20240301' тогда
			НомерЧека	=	Прав(Строка.ХешНаименования,11);
			ДатаЧека	=	Дата(Лев(Строка.ХешНаименования,19));
			НужЧек		=	Документы.ЧекККМ.НайтиПоНомеру(НомерЧека, ДатаЧека);
			
			Если Не НужЧек.Пустая() тогда
				Если НужЧек.Товары.Количество() >0 тогда
					Если НужЧек.Товары[0].Продавец <> Продавец тогда
						
						Продолжить;
						
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Данные		=	Строка.Наименование;		
		Поз3		=	СтрНайти(Данные,"/",,,3);
		Поз9		=	СтрНайти(Данные,"/",,,9);
		Поз10		=	СтрНайти(Данные,"/",,,10);
		ПозЗагружен	=	СтрНайти(Данные,"загружен");
		
		КодГруппы	=	Сред(Данные,Поз3+1,11);
		
		КодГруппы	=	СтрЗаменить(КодГруппы,"u","Ю");
		
		Попытка
			Если Поз10 = 0 тогда 
				Если ПозЗагружен >0 тогда
					Сумма		=	Сред(Данные,Поз9+1, ПозЗагружен-Поз9-1);
				иначе
					Сумма		=	Сред(Данные,Поз9+1);
				КонецЕсли;
				Сумма	=	Число(Сумма);
				
			иначе
				Если ПозЗагружен >0 тогда
					Сумма		=	Сред(Данные,Поз10+1, ПозЗагружен-Поз10-1);
				иначе
					Сумма		=	Сред(Данные,Поз10+1);
				КонецЕсли;
				Сумма	=	Число(Сумма);
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;


		ПК			=	Справочники.Номенклатура.НайтиПоКоду(КодГруппы).ПолныйКод();
		Если найти(ПК, "00048205349") тогда //Это Табак
			ПроданоТабак	=	ПроданоТабак +1;
			ПремияТабак		=	ПремияТабак + (Сумма/100)*10;	
			Попытка
				СуммаТабак		=	СуммаТабак + Сумма;
			Исключение
			КонецПопытки;
		иначе
			ПроданоСувениры	=	ПроданоСувениры + 1;
			ПремияСувениры	=	ПремияСувениры  +  (Сумма/100)*20;	
			Попытка
				СуммаСувениры	=	СуммаСувениры + Сумма;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураПремийУценка	=	Новый Структура;
	СтруктураПремийУценка.Вставить("ПроданоТабак", 		ПроданоТабак);
	СтруктураПремийУценка.Вставить("ПроданоСувениры", 	ПроданоСувениры);
	СтруктураПремийУценка.Вставить("СуммаТабак", 		СуммаТабак);
	СтруктураПремийУценка.Вставить("СуммаСувениры", 	СуммаСувениры);
	СтруктураПремийУценка.Вставить("ПремияТабак", 		ПремияТабак);
	СтруктураПремийУценка.Вставить("ПремияСувениры", 	ПремияСувениры);
	
	
	Возврат СтруктураПремийУценка;
	
	
КонецФункции
