функция РассчитатьВозможнуюСкидкуПоШагу(Скидка, КоличествоШагов, СзНоменклатура) экспорт
	СуммаВозможнойСкидки	=	0;
	
	ТаблСумм	=	Новый ТаблицаЗначений;
	ТаблСумм.Колонки.Добавить("Сумма");
	
	
	//Сначала Разбиваем
	Для каждого СтрокаТовары Из Товары цикл
		ПК	=	СтрокаТовары.Номенклатура.ПолныйКод();
		
		Для каждого СтрокаСписка из СзНоменклатура цикл
			Если Найти(ПК,СтрокаСписка.Значение)  тогда
				
				Для Ном=1 По СтрокаТовары.Количество цикл 
					НоваяСтрока	=	ТаблСумм.Добавить();
					НоваяСтрока.Сумма	=	СтрокаТовары.Цена;						
				КонецЦикла;	
				Прервать;
				
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ТаблСумм.Сортировать("Сумма Убыв");
	
	Счетчик	=	1;
	Для каждого Строка из ТаблСумм цикл
		ПроцентСкидки	=	Счетчик * Скидка;
		
		СуммаВозможнойСкидки	=	СуммаВозможнойСкидки + (Строка.Сумма/100 * ПроцентСкидки);
		
		
		Если Счетчик <>  КоличествоШагов тогда
			Счетчик	=	Счетчик + 1;
		КонецЕсли; 		
	КонецЦикла;
	
	Возврат  СуммаВозможнойСкидки;
КонецФункции


функция ПроставитьСкидкуПоШагу(Скидка, КоличествоШагов, СзНоменклатура, флНадо, СзНоменклатураИсключения) экспорт
	
	
	//Сначала Разбиваем
	ВсегоТоваров	=	Товары.Количество()+1;
	Для каждого СтрокаТовары Из Товары цикл
		ПК	=	СтрокаТовары.Номенклатура.ПолныйКод();
		
		Для каждого СтрокаСписка из СзНоменклатураИсключения цикл
			Если Найти(ПК,СтрокаСписка.Значение) тогда
				Продолжить;
			КонецЕсли;
		КонецЦикла;	
		
		Если ВсегоТоваров = СтрокаТовары.НомерСтроки тогда Прервать; КонецЕсли;
		
		Для каждого СтрокаСписка из СзНоменклатура цикл
			Если Найти(ПК,СтрокаСписка.Значение)  тогда
				
				Для Ном=2 По СтрокаТовары.Количество цикл
					СтрокаТовары.Количество			=	1;
					СтрокаТовары.КоличествоУпаковок	=	1;
					СтрокаТовары.Сумма		=	СтрокаТовары.Количество * СтрокаТовары.Цена;
					
					НоваяСтрока	=	Товары.добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары);
					
				КонецЦикла;	
				Прервать;
					
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	Товары.Сортировать("Цена Убыв");
	
	Счетчик	=	1;
	Для каждого СтрокаТовары из Товары цикл
		ПК	=	СтрокаТовары.Номенклатура.ПолныйКод();
		
		Для каждого СтрокаСписка из СзНоменклатураИсключения цикл
			Если Найти(ПК,СтрокаСписка.Значение) тогда
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаСписка из СзНоменклатура цикл
			Если Найти(ПК,СтрокаСписка.Значение)  тогда				

				ПроцентСкидки	=	Счетчик * Скидка;
				
				СтрокаТовары.СуммаРучнойСкидки			=	Окр((СтрокаТовары.Цена/100) * ПроцентСкидки,0);
				СтрокаТовары.Сумма						=	СтрокаТовары.Количество * СтрокаТовары.Цена - СтрокаТовары.СуммаРучнойСкидки;
				СтрокаТовары.флПроставленаСкидкаПоАкции	=	Истина; //При смене количества -  идет пересчет процента скидки. а После этого в зависимости от прцента идет пересчет суммы скидки. плохо сделано фирмой 1с
				флНадо	=	Истина;

				Если Счетчик <>  КоличествоШагов тогда
					Счетчик	=	Счетчик + 1;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции