
Функция DailySelesReport(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Результ = Новый Массив;
	прототипСтроки = "ООРП,Продавец,ЭтоГлавныйПродавец,ЭтоДопСмена";
	
	
	датаН = Дата(вхПараметры.DateFrom);
	датаК= Дата(вхПараметры.DateTo);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ведомость.Ссылка КАК Ссылка,
	               |	ведомость.Продавец КАК Продавец,
	               |	ведомость.ЭтоГлавныйПродавец КАК ЭтоГлавныйПродавец,
	               |	ведомость.ЭтоДопСмена КАК ЭтоДопСмена
	               |ИЗ
	               |	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ведомость
	               |ГДЕ
	               |	ведомость.Ссылка.Дата >= &ДатаН
	               |	И ведомость.Ссылка.Дата <= &ДатаК
	               |	И ведомость.Ссылка.Проведен = Истина";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(датаН));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаК));
	
	рез = Запрос.Выполнить().Выбрать();   
	
	Пока Рез.Следующий() Цикл
		эл = Новый Структура(прототипСтроки);
		
		эл.ООРП = Строка(рез.Ссылка.УникальныйИдентификатор());
		эл.Продавец = Строка(рез.Продавец.УникальныйИдентификатор());
		эл.ЭтоГлавныйПродавец = рез.ЭтоГлавныйПродавец;
		эл.ЭтоДопСмена = рез.ЭтоДопСмена;
		
		Результ.Добавить(эл);
	конецЦикла;
	
	возврат Результ;	
	
КонецФункции


//вхПараметры - структура
Функция GetUserList(вхПараметры) ЭКСПОРТ
	результ = Новый Массив;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	Пользователи.Наименование КАК Пользователь,
	      	 	             |	Пользователи.Ссылка КАК Ссылка,
	      	 	             |	Пользователи.ПометкаУдаления КАК ПометкаУдаления,
	      	 	             |	Пользователи.Подразделение КАК Подразделение,
	      	 	             |	Пользователи.ФизЛицо КАК ФизЛицо
	      	 	             |ИЗ
	      	 	             |	Справочник.Пользователи КАК Пользователи
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Пользователь");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого СТрока из Рез цикл
		ИмяПользователяИБ	 = Строка.Пользователь;
		ПометкаУдаления		 = Строка.ПометкаУдаления;		
		ФизическоеЛицоУИ 	 = Строка(Строка.ФизЛицо.УникальныйИдентификатор());
		МагазинУИ 			 = Строка(Строка.Подразделение.УникальныйИдентификатор());
		МагазинНаименование  = Строка.Подразделение.Наименование;	
		
		Струуктура = Новый Структура;
		Струуктура.Вставить("ИмяПользователяИБ",ИмяПользователяИБ);
		Струуктура.Вставить("ФизическоеЛицоУИ",ФизическоеЛицоУИ);
		Струуктура.Вставить("МагазинУИ",МагазинУИ);
		Струуктура.Вставить("МагазинНаименование",МагазинНаименование);
		Струуктура.Вставить("ПометкаУдаления",ПометкаУдаления);
		
		результ.Добавить(Струуктура);
	КонецЦикла;
	
	//прототипСтроки = "ИмяПользователяИБ, ФизическоеЛицоУИ, МагазинУИ, МагазинНаименование";
		
	Возврат результ;
КонецФункции