
Функция DailySelesReport(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Результ = Новый Массив;
	прототипСтроки = "RetailSalesReportRef, RetailSalesReportDate,UserRef,UserName,IsMainUser,IsExtraShift";
	
	
	датаН = Дата(вхПараметры.DateFrom);
	датаК= Дата(вхПараметры.DateTo);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	оорп.ОтчетОРозничныхПродажах КАК Ссылка,
	               |	ведомостьПродавцы.Продавец КАК Продавец,
	               |	ведомостьПродавцы.ЭтоГлавныйПродавец КАК ЭтоГлавныйПродавец,
	               |	ведомостьПродавцы.ЭтоДопСмена КАК ЭтоДопСмена
	               |ИЗ
	               |	Документ.ТБК_ВедомостьОПродажахЗаДень.ОтчетыОРозничныхПродажах КАК оорп
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ведомостьПродавцы
	               |		ПО (ведомостьПродавцы.Ссылка = оорп.Ссылка)
	               |ГДЕ
	               |	оорп.Ссылка.Дата >= &ДатаН
	               |	И оорп.Ссылка.Дата <= &ДатаК
	               |	И оорп.Ссылка.Проведен = ИСТИНА
	               |ИТОГИ ПО
	               |	Ссылка";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(датаН));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаК));
	
	резДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	
	Пока резДокументы.Следующий() Цикл
		эл = Новый Структура();
		эл.Вставить("RetailSalesReportRef",Строка(резДокументы.Ссылка.УникальныйИдентификатор()));
		эл.Вставить("RetailSalesReportDate",Формат(резДокументы.Ссылка.Дата,"ДФ='dd/MM/yyyy HH:mm:ss'"));
		
		мПродавцы = новый Массив;
		эл.Вставить("Users", мПродавцы);

		резПродавцы = резДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока резПродавцы.Следующий() Цикл
			элПродавцы = Новый Структура;
			
			элПродавцы.Вставить("UserRef", Строка(резПродавцы.Продавец.УникальныйИдентификатор()));
			элПродавцы.Вставить("UserName",Строка(резПродавцы.Продавец));
			элПродавцы.Вставить("IsMainUser",резПродавцы.ЭтоГлавныйПродавец);
			элПродавцы.Вставить("IsExtraShift",резПродавцы.ЭтоДопСмена);
			
			мПродавцы.Добавить(элПродавцы);
		КонецЦикла;
		
		
		
		Результ.Добавить(эл);
	конецЦикла;
	
	возврат Результ;	
	
КонецФункции


//вхПараметры - структура
Функция GetUserList(вхПараметры) ЭКСПОРТ
	результ = Новый Массив;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	Пользователи.Наименование КАК Пользователь,
	      	 	             |	Пользователи.Ссылка КАК Ссылка,
	      	 	             |	Пользователи.ПометкаУдаления КАК ПометкаУдаления,
	      	 	             |	Пользователи.Подразделение КАК Подразделение,
	      	 	             |	Пользователи.ФизЛицо КАК ФизЛицо
	      	 	             |ИЗ
	      	 	             |	Справочник.Пользователи КАК Пользователи
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Пользователь");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого СТрока из Рез цикл
		ИмяПользователяИБ	 = Строка.Пользователь;
		ПометкаУдаления		 = Строка.ПометкаУдаления;		
		ФизическоеЛицоУИ 	 = Строка(Строка.ФизЛицо.УникальныйИдентификатор());
		МагазинУИ 			 = Строка(Строка.Подразделение.УникальныйИдентификатор());
		МагазинНаименование  = Строка.Подразделение.Наименование;	
		
		Струуктура = Новый Структура;
		Струуктура.Вставить("ИмяПользователяИБ",ИмяПользователяИБ);
		Струуктура.Вставить("ФизическоеЛицоУИ",ФизическоеЛицоУИ);
		Струуктура.Вставить("МагазинУИ",МагазинУИ);
		Струуктура.Вставить("МагазинНаименование",МагазинНаименование);
		Струуктура.Вставить("ПометкаУдаления",ПометкаУдаления);
		
		результ.Добавить(Струуктура);
	КонецЦикла;
	
	//прототипСтроки = "ИмяПользователяИБ, ФизическоеЛицоУИ, МагазинУИ, МагазинНаименование";
		
	Возврат результ;
КонецФункции


Функция GetExtConfiguration(вхПараметры) ЭКСПОРТ
	Возврат РегистрыСведений.ТБК_Константы.Получить_РежимРаботыРасширения();
КонецФункции

Функция GetStoreBalance(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Результ = Новый Массив;
	//прототипСтроки = "RetailSalesReportRef, RetailSalesReportDate,UserRef,UserName,IsMainUser,IsExtraShift";
	
	//Вик Изменения по просьбе Волковой 2021_80_18
	//датаК = НачалоДня(ТекущаяДата())-1;
	//Если ТипЗнч(вхПараметры) = Тип("Структура") И вхПараметры.Свойство("Date") Тогда
	//	датаК		= Дата(вхПараметры.Date);
	//КонецЕсли; 
	датаК = НачалоДня(ТекущаяДата()) - 24*60*60;
	//
	
	НужныйСклад		 = ОбщегоНазначения.ПолучитьСкладИзООРП();
	НужныйМагазин	 = ОбщегоНазначения.ПолучитьМагазинИзООРП();

	Если НужныйСклад = Неопределено тогда Возврат Результ; КонецЕсли;
	Если НужныйМагазин = Неопределено тогда Возврат Результ; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки"; 	
	
	Запрос.УстановитьПараметр("Склад",НужныйСклад);
	Запрос.УстановитьПараметр("Дата",ДатаК);
	
	рез = Запрос.Выполнить().Выбрать();   
	
	эл = Новый Структура();
	эл.Вставить("Store",Строка(НужныйМагазин.УникальныйИдентификатор()));
	эл.Вставить("Date",датаК);
	
	мОстатки = новый Массив;
	эл.Вставить("Balance", мОстатки);

	Пока рез.Следующий() Цикл		

		элОстатки = Новый Структура;
		
		элОстатки.Вставить("Nom", Строка(рез.Номенклатура.УникальныйИдентификатор()));
		элОстатки.Вставить("Har", Строка(рез.Характеристика.УникальныйИдентификатор()));
		элОстатки.Вставить("HarN", рез.Характеристика.Наименование);
		элОстатки.Вставить("Ostatok",рез.КоличествоОстаток);
		
		мОстатки.Добавить(элОстатки);
	конецЦикла; 
		
	Результ.Добавить(эл);
	
	возврат Результ;	
КонецФункции

Функция GetKolChecks(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Чеки = новый Массив;
	
	датаН = Дата(вхПараметры.DateFrom);
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ) КАК Дата,
	      	 	             |	СУММА(ВЫБОР
	      	 	             |			КОГДА ЧекККМ.ВидОперации = &ВидПродажа
	      	 	             |				ТОГДА 1
	      	 	             |			ИНАЧЕ 0
	      	 	             |		КОНЕЦ) КАК КолЧековПродажа,
	      	 	             |	СУММА(ВЫБОР
	      	 	             |			КОГДА ЧекККМ.ВидОперации = &ВидВозврат
	      	 	             |				ТОГДА 1
	      	 	             |			ИНАЧЕ 0
	      	 	             |		КОНЕЦ) КАК КолЧековВозврат
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ КАК ЧекККМ
	      	 	             |ГДЕ
	      	 	             |	ЧекККМ.Дата >= &Дата
	      	 	             |	И ЧекККМ.Проведен
	      	 	             |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМ
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ)
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата");

	
	Запрос.УстановитьПараметр("Дата",датаН);
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("ВидПродажа",Перечисления.ВидыОперацийЧекККМ.Продажа);
	Запрос.УстановитьПараметр("ВидВозврат",Перечисления.ВидыОперацийЧекККМ.Возврат);

	Рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() цикл
	
		элЧеки = Новый Структура;
		
		элЧеки.Вставить("Дата", рез.Дата);
		элЧеки.Вставить("КолЧековПродажа", рез.КолЧековПродажа);
		элЧеки.Вставить("КолЧековВозврат", рез.КолЧековВозврат);
		
		Чеки.Добавить(элЧеки);
	КонецЦикла; 
	
	возврат Чеки;	
КонецФункции

Функция GrtBarcodesPackagesProduct(вхПараметры) Экспорт
	
	
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Номен
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Код В(&Код)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Хар
	                      |ИЗ
	                      |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |ГДЕ
	                      |	ХарактеристикиНоменклатуры.Наименование В(&НаименованиеХар)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	                      |	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	                      |	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
	                      |	ШтрихкодыУпаковокТоваров.ДатаУпаковки КАК ДатаУпаковки,
	                      |	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки
	                      |ИЗ
	                      |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров,
	                      |	Номен КАК Номен,
	                      |	Хар КАК Хар
	                      |ГДЕ
	                      |	ШтрихкодыУпаковокТоваров.ДатаУпаковки МЕЖДУ &ДатаНач И &ДатаКон
	                      |	И ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО ""%"" + &ЗначениеШтрихкода + ""%""
	                      |	И ШтрихкодыУпаковокТоваров.Номенклатура В (Номен.Ссылка)
	                      |	И ШтрихкодыУпаковокТоваров.Характеристика В (Хар.Ссылка)");
	Запрос.УстановитьПараметр("ДатаНач", Дата(вхПараметры.ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", Дата(вхПараметры.ДатаКон));
	
	МассивНоменклатуры = Новый Массив;
	Если вхПараметры.свойство("МассивНоменклатураКод") Тогда
		Запрос.УстановитьПараметр("Код", вхПараметры.МассивНоменклатураКод);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
	                      						|	Номенклатура.Код В(&Код)", ""); 	
	КонецЕсли;
	
	Если вхПараметры.свойство("МассивХарактеристика") Тогда
		Запрос.УстановитьПараметр("НаименованиеХар", вхПараметры.МассивХарактеристика);
	иначе
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ
	                      |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Хар
	                      |ИЗ
	                      |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |ГДЕ
	                      |	ХарактеристикиНоменклатуры.Наименование В(&НаименованиеХар)
	                      |;
	                      |", "");

		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШтрихкодыУпаковокТоваров.Характеристика В (Хар.Ссылка)", "");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,",
											|	Хар КАК Хар", "");
	
	КонецЕсли;
	
	Если вхПараметры.свойство("ЗначениеШтрихкода") Тогда
		Запрос.УстановитьПараметр("ЗначениеШтрихкода", вхПараметры.ЗначениеШтрихкода);
	иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО ""%"" + &ЗначениеШтрихкода + ""%""", "");	
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Информация",УровеньЖурналаРегистрации.Информация,,,Запрос.Текст);
	
	Результат = Запрос.Выполнить().Выгрузить();
	МассивВозврата = Новый Массив;
	Для каждого Строка Из Результат Цикл
	
		СтруктураСтрокиЗаписи = Новый Структура(); 
		СтруктураСтрокиЗаписи.Вставить("НоменклатураКод", Строка(Строка.Номенклатура.Код));
		СтруктураСтрокиЗаписи.Вставить("ЗначениеШтрихкода", Строка(Строка.ЗначениеШтрихкода));
		СтруктураСтрокиЗаписи.Вставить("Характеристика", Строка(Строка.Характеристика.Наименование));
		СтруктураСтрокиЗаписи.Вставить("Упаковка", Строка(Строка.ТипУпаковки));
		СтруктураСтрокиЗаписи.Вставить("ДатаУпаковки", Строка(Строка.ДатаУпаковки));
		МассивВозврата.Добавить(СтруктураСтрокиЗаписи);
	КонецЦикла;
	
	//JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
	
	Возврат МассивВозврата;

	
КонецФункции // ()

Функция GetCancelledQR(вхПараметры) Экспорт

	    Запрос = Новый запрос("ВЫБРАТЬ
	                          |	ЧекККМАкцизныеМарки.АкцизнаяМарка КАК АкцизнаяМарка
	                          |ИЗ
	                          |	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	                          |ГДЕ
	                          |	ЧекККМАкцизныеМарки.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                          |	И ЧекККМАкцизныеМарки.Ссылка.Комментарий ПОДОБНО ""Добавлен в ООРП""
	                          |	И ЧекККМАкцизныеМарки.Ссылка.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)");
		Запрос.УстановитьПараметр("ДатаНач", Дата(вхПараметры.ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", Дата(вхПараметры.ДатаКон));
				
		Результат = Запрос.Выполнить().Выгрузить();
		МассивМарок = Новый Массив;
		Для каждого Строка Из Результат Цикл
		
			МассивМарок.Добавить(Строка(Строка.АкцизнаяМарка));	
		
		КонецЦикла; 
		
		Возврат МассивМарок;

КонецФункции // ()
