
Функция DailySelesReport(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Результ = Новый Массив;
	прототипСтроки = "RetailSalesReportRef, RetailSalesReportDate,UserRef,UserName,IsMainUser,IsExtraShift";
	
	
	датаН = Дата(вхПараметры.DateFrom);
	датаК= Дата(вхПараметры.DateTo);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	оорп.ОтчетОРозничныхПродажах КАК Ссылка,
	               |	ведомостьПродавцы.Продавец КАК Продавец,
	               |	ведомостьПродавцы.ЭтоГлавныйПродавец КАК ЭтоГлавныйПродавец,
	               |	ведомостьПродавцы.ЭтоДопСмена КАК ЭтоДопСмена
	               |ИЗ
	               |	Документ.ТБК_ВедомостьОПродажахЗаДень.ОтчетыОРозничныхПродажах КАК оорп
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ведомостьПродавцы
	               |		ПО (ведомостьПродавцы.Ссылка = оорп.Ссылка)
	               |ГДЕ
	               |	оорп.Ссылка.Дата >= &ДатаН
	               |	И оорп.Ссылка.Дата <= &ДатаК
	               |	И оорп.Ссылка.Проведен = ИСТИНА
	               |ИТОГИ ПО
	               |	Ссылка";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(датаН));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаК));
	
	резДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	
	Пока резДокументы.Следующий() Цикл
		эл = Новый Структура();
		эл.Вставить("RetailSalesReportRef",Строка(резДокументы.Ссылка.УникальныйИдентификатор()));
		эл.Вставить("RetailSalesReportDate",Формат(резДокументы.Ссылка.Дата,"ДФ='dd/MM/yyyy HH:mm:ss'"));
		
		мПродавцы = новый Массив;
		эл.Вставить("Users", мПродавцы);

		резПродавцы = резДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока резПродавцы.Следующий() Цикл
			элПродавцы = Новый Структура;
			
			элПродавцы.Вставить("UserRef", Строка(резПродавцы.Продавец.УникальныйИдентификатор()));
			элПродавцы.Вставить("UserName",Строка(резПродавцы.Продавец));
			элПродавцы.Вставить("IsMainUser",резПродавцы.ЭтоГлавныйПродавец);
			элПродавцы.Вставить("IsExtraShift",резПродавцы.ЭтоДопСмена);
			
			мПродавцы.Добавить(элПродавцы);
		КонецЦикла;
		
		
		
		Результ.Добавить(эл);
	конецЦикла;
	
	возврат Результ;	
	
КонецФункции


//вхПараметры - структура
Функция GetUserList(вхПараметры) ЭКСПОРТ
	результ = Новый Массив;
	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	Пользователи.Наименование КАК Пользователь,
	      	 	             |	Пользователи.Ссылка КАК Ссылка,
	      	 	             |	Пользователи.ПометкаУдаления КАК ПометкаУдаления,
	      	 	             |	Пользователи.Подразделение КАК Подразделение,
	      	 	             |	Пользователи.ФизЛицо КАК ФизЛицо
	      	 	             |ИЗ
	      	 	             |	Справочник.Пользователи КАК Пользователи
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Пользователь");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого СТрока из Рез цикл
		ИмяПользователяИБ	 = Строка.Пользователь;
		ПометкаУдаления		 = Строка.ПометкаУдаления;		
		ФизическоеЛицоУИ 	 = Строка(Строка.ФизЛицо.УникальныйИдентификатор());
		МагазинУИ 			 = Строка(Строка.Подразделение.УникальныйИдентификатор());
		МагазинНаименование  = Строка.Подразделение.Наименование;	
		
		Струуктура = Новый Структура;
		Струуктура.Вставить("ИмяПользователяИБ",ИмяПользователяИБ);
		Струуктура.Вставить("ФизическоеЛицоУИ",ФизическоеЛицоУИ);
		Струуктура.Вставить("МагазинУИ",МагазинУИ);
		Струуктура.Вставить("МагазинНаименование",МагазинНаименование);
		Струуктура.Вставить("ПометкаУдаления",ПометкаУдаления);
		
		результ.Добавить(Струуктура);
	КонецЦикла;
	
	//прототипСтроки = "ИмяПользователяИБ, ФизическоеЛицоУИ, МагазинУИ, МагазинНаименование";
		
	Возврат результ;
КонецФункции


Функция GetExtConfiguration(вхПараметры) ЭКСПОРТ
	Возврат РегистрыСведений.ТБК_Константы.Получить_РежимРаботыРасширения();
КонецФункции

Функция GetStoreBalance(вхПараметры) ЭКСПОРТ
	Если ЛОЖЬ Тогда вхПараметры = Новый Структура(); КонецЕсли;
	
	Результ = Новый Массив;
	//прототипСтроки = "RetailSalesReportRef, RetailSalesReportDate,UserRef,UserName,IsMainUser,IsExtraShift";
	датаК		= Дата(вхПараметры.Date);
	НужныйСклад = ПолучитьНужныйСклад();
	Если НужныйСклад = Неопределено тогда Возврат Результ; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки"; 	
	
	Запрос.УстановитьПараметр("Склад",НужныйСклад);
	Запрос.УстановитьПараметр("Дата",КонецДня(ДатаК));
	
	рез = Запрос.Выполнить().Выбрать();   
	
	эл = Новый Структура();
	эл.Вставить("Store",Строка(НужныйСклад.УникальныйИдентификатор()));
	эл.Вставить("Date",Формат(датаК,"ДФ='dd/MM/yyyy HH:mm:ss'"));
	
	мОстатки = новый Массив;
	эл.Вставить("Balance", мОстатки);

	Пока рез.Следующий() Цикл		

		элОстатки = Новый Структура;
		
		элОстатки.Вставить("Nom", Строка(рез.Номенклатура.УникальныйИдентификатор()));
		Если ЗначениеЗаполнено(рез.Характеристика) тогда
			элОстатки.Вставить("Har", Строка(рез.Характеристика.УникальныйИдентификатор()));
		КонецЕсли;
		элОстатки.Вставить("Ostatok",рез.КоличествоОстаток);
		
		мОстатки.Добавить(элОстатки);
	конецЦикла; 
		
	Результ.Добавить(эл);
	
	возврат Результ;	
КонецФункции

Функция ПолучитьНужныйСклад()
	Запрос	=	Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ОтчетОРозничныхПродажах.Магазин КАК Магазин
	      	 	             |ИЗ
	      	 	             |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	      	 	             |ГДЕ
	      	 	             |	ОтчетОРозничныхПродажах.Проведен
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ОтчетОРозничныхПродажах.Дата УБЫВ");
	Рез = запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество() = 0 тогда
		Возврат Неопределено;
	иначе
		Если ЗначениеЗаполнено(Рез[0].Магазин.СкладПоступления) тогда
			Возврат Рез[0].Магазин.СкладПоступления;
		иначе
			Возврат Неопределено;	
		КонецЕсли;		
	КонецЕсли;
	
КонецФункции