
Функция remnants() 
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРозницеОстатки.Склад.Наименование КАК СкладНаименование,
				   |	ТоварыВРозницеОстатки.Склад.Код КАК СкладКод,
				   |	ТоварыВРозницеОстатки.Номенклатура.Код КАК НоменклатураКод,
	               |	ISNULL(ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры.Наименование,"""") КАК ХарактеристикаНоменклатурыНаименование,
	               |	ТоварыВРозницеОстатки.КоличествоОстаток,
	               |	ISNULL(ЦеныНоменклатурыСрезПоследних.ТипЦен.Наименование,"""") КАК ТипЦенНаименование,
	               |	ISNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) Цена
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРознице.Остатки КАК ТоварыВРозницеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыВРозницеОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И (ЦеныНоменклатурыСрезПоследних.ТипЦен.Наименование = ""Интернет Магазин"")
	               |			И ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры";
				   
				   
	Результат = новый массив;
	макетСтруктуры = "СкладНаименование,СкладКод,НоменклатураКод,ХарактеристикаНоменклатурыНаименование,КоличествоОстаток,ТипЦенНаименование,Цена";
	
	рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		нЗапись = Новый Структура(макетСтруктуры);
		ЗаполнитьЗначенияСвойств(нЗапись,рез);
		
		Для каждого эл из нЗапись цикл
			если ТипЗнч(эл.Значение) <> Тип("Число") Тогда
				нЗапись[эл.Ключ]=строка(эл.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Результат.Добавить(нЗапись);
	КонецЦикла;	
	
	Возврат СтруктураВjson(Результат);
	
КонецФункции



Функция СтруктураВjson(Значение)

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли; 	
	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции