Функция ПолучимиТоварыНоменклатурнойГруппы(НоменклатурнаяГруппа) Экспорт 
		
		Запрос = новый Запрос("ВЫБРАТЬ
		|	Номенклатура.Ссылка как Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа",НоменклатурнаяГруппа);
		
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		
		
	КонецФункции
	
Функция ПолучитьЗакупочнуюЦену(Номенклатура, ХарактеристикаH = Неопределено) Экспорт
		
		// НЧАН	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЦеныНоменклатурыСрезПоследних.Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&Дата,
		                      |			Номенклатура = &Номенклатура
		                      |				И ТипЦен.Закупочная) КАК ЦеныНоменклатурыСрезПоследних");
		                      
		
		Если ХарактеристикаH <> Неопределено Тогда
			Запрос.Текст = Запрос.Текст + " 
			|ГДЕ
		    |	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаH); 
		КонецЕсли;
			
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		
		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		//	КЧАН	
		
	КонецФункции
	
Функция ПолучитьБазовуюЦену(Номенклатура) Экспорт
		
		Запрос = новый Запрос("ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ТипЦен.Базовая) КАК ЦеныНоменклатурыСрезПоследних");
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());

		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		
		
КонецФункции
	
Функция ПолучитьРозничнуюЦену(Номенклатура,ТипЦен) Экспорт
		
		Запрос = новый Запрос("ВЫБРАТЬ
		                      |	ЦеныНоменклатурыСрезПоследних.Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&Дата,
		                      |			Номенклатура = &Номенклатура
		                      |				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних");
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
         Запрос.УстановитьПараметр("Дата",ТекущаяДата());

		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		
		
КонецФункции

Функция ПолучитьОстатки(Номенклатура,Склад = неопределено) Экспорт
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ТоварыНаСкладахОстатки.Номенклатура,
	                      |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |			&Дата,
	                      |			Номенклатура = &Номенклатура
	                      |				{И Склад = &Склад}) КАК ТоварыНаСкладахОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыНаСкладахОстатки.Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Если Склад <> Неопределено тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"{И Склад = &Склад}","И Склад = &Склад");
		Запрос.УстановитьПараметр("Склад",Склад);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"{И Склад = &Склад}","");
	КонецЕсли;
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() тогда
		Возврат Результат.КоличествоОстаток;
	Иначе
		Возврат 0
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьРасчетноБазовуюЦену (Номенклатура,Склад = неопределено) Экспорт
	
	РасчетноБазоваяЦена = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000074");

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыСрезПоследних.Цена
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |			&Дата,
	                      |			Номенклатура = &Номенклатура
	                      |				И ТипЦен = &РасчетноБазоваяЦена) КАК ЦеныНоменклатурыСрезПоследних");
						  
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		Запрос.УстановитьПараметр("РасчетноБазоваяЦена",РасчетноБазоваяЦена);


		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;

КонецФункции