Процедура СинхронизацияШтрихкодов()Экспорт
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	Штрихкоды.Штрихкод КАК Штрихкод,
	      	 	             |	Штрихкоды.Владелец КАК Владелец,
	      	 	             |	Штрихкоды.ТипШтрихкода КАК ТипШтрихкода,
	      	 	             |	Штрихкоды.Упаковка КАК Упаковка,
	      	 	             |	ЕСТЬNULL(ТБК_Штрихкоды.Штрихкод, 0) КАК Штрихкод1
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.Штрихкоды КАК Штрихкоды
	      	 	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТБК_Штрихкоды КАК ТБК_Штрихкоды
	      	 	             |		ПО Штрихкоды.Штрихкод = ТБК_Штрихкоды.Штрихкод
	      	 	             |			И Штрихкоды.Владелец = ТБК_Штрихкоды.Владелец
	      	 	             |			И Штрихкоды.ТипШтрихкода = ТБК_Штрихкоды.ТипШтрихкода
	      	 	             |			И Штрихкоды.Упаковка = ТБК_Штрихкоды.Упаковка
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Итог.Штрихкод КАК Штрихкод,
	      	 	             |	Итог.Владелец КАК Владелец,
	      	 	             |	Итог.ТипШтрихкода КАК ТипШтрихкода,
	      	 	             |	Итог.Упаковка КАК Упаковка,
	      	 	             |	Итог.Штрихкод1 КАК Штрихкод1
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог
	      	 	             |ГДЕ
	      	 	             |	Итог.Штрихкод1 = 0
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	Итог.Штрихкод,
	      	 	             |	Итог.Владелец,
	      	 	             |	Итог.ТипШтрихкода,
	      	 	             |	Итог.Упаковка,
	      	 	             |	Итог.Штрихкод1");
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из Рез цикл
		НоваяЗапись = РегистрыСведений.ТБК_Штрихкоды.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			
		КонецПопытки;		
	КонецЦикла;	
КонецПроцедуры