
&ИзменениеИКонтроль("ОткрытьФормуПодбораНоменклатурыПоШтрихкодам")
Процедура ТБКОткрытьФормуПодбораНоменклатурыПоШтрихкодам(ПараметрыФормы, Владелец, ОповещениеОЗакрытии)

	ОценкаПроизводительностиКлиент.ЗамерВремени(
	"ОбщаяФорма.ПоискНоменклатурыПоШтрихкоду");
	
	#Вставка
	//Марк 2025-05-26
	Если ПараметрыФормы.НеизвестныеШтрихкоды.Количество() Тогда
		Для каждого НеНайденныйШтрихкод Из ПараметрыФормы.НеизвестныеШтрихкоды Цикл
		
			ОбщегоНазначенияВызовСервера.ДобавитьДанныеШтрихкодаК_ТБК_ЗапросДанныхУ_УТ(НеНайденныйШтрихкод.Штрихкод);	
		
		КонецЦикла;	
	КонецЕсли;
	//КонецМарк
    #КонецВставки
	
	ОткрытьФорму("ОбщаяФорма.ПоискНоменклатурыПоШтрихкоду", 
	ПараметрыФормы, Владелец, Новый УникальныйИдентификатор, , , ОповещениеОЗакрытии);

КонецПроцедуры
