&НаКлиенте
Перем ПутьКБиблиотекеГТД;

&НаКлиенте
Процедура СписокГТДПриАктивизацииСтроки(Элемент)
	ОбновитьТаблицуФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПутьКБиблиотекеГТД = Константы.ПутьКБиблиотекеГТД.Получить();
	ПутьККаталогуПоУмолчанию = ВосстановитьЗначение("Обработка_ПутьККаталогуПоУмолчанию");
	
	Если ЗначениеЗаполнено(ТекущаяГТД) тогда
		НужнаяСсылка = ПолучитьНужнуюСсылкуГТД(ТекущаяГТД);		
		Элементы.СписокГТД.ТекущаяСтрока = НужнаяСсылка;
	КонецЕсли;
	
	ОбновитьТаблицуФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьГТД(Команда)
	Если ЗначениеЗаполнено(Элементы.СписокГТД.ТекущаяСтрока) тогда
		ИмяФайлаНазначение	=	ПутьКБиблиотекеГТД + СтрЗаменить(СокрЛП(Элементы.СписокГТД.ТекущаяСтрока.Код),"/","_")+".pdf";
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "PDF (*.pdf)|*.pdf"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Если ЗначениеЗаполнено(ПутьККаталогуПоУмолчанию) тогда
		Диалог.Каталог = ПутьККаталогуПоУмолчанию;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда 
		Если Диалог.Каталог <> ПутьКБиблиотекеГТД тогда
			Попытка
				ОбщегоНазначения.СкопироватьФайл_ОбщегоНазначения(Диалог.ПолноеИмяФайла,ИмяФайлаНазначение,Истина,Истина);		
				ОбновитьТаблицуФайлы();
			Исключение
				Предупреждение("Выполнено успешно");	
			КонецПопытки;
		иначе
			Предупреждение("Каталоги совпадают! Привязка не требуется. При необходимости - переименуйте файлы!");	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПутьККаталогу(Команда)
	Элементы.ПутьККаталогуПоУмолчанию.Видимость = не Элементы.ПутьККаталогуПоУмолчанию.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьДекларацию(Команда)
	Если не ЗначениеЗаполнено(Элементы.СписокГТД.ТекущаяСтрока) тогда
		Сообщить("Выберите нужную ГТД!");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "PDF (*.pdf)|*.pdf"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Если ЗначениеЗаполнено(ПутьККаталогуПоУмолчанию) тогда
		Диалог.Каталог = ПутьККаталогуПоУмолчанию;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда 
		
		Если Диалог.Каталог <> ПутьКБиблиотекеГТД + "Декларации\" тогда
			ИмяФайла = СтрЗаменить(Диалог.ПолноеИмяФайла,Диалог.Каталог,"");
			ИмяФайлаНазначение	=	ПутьКБиблиотекеГТД +"Декларации\"+ ИмяФайла;			
			
			флВсеХорошо = ОбщегоНазначения.СкопироватьФайл_ОбщегоНазначения(Диалог.ПолноеИмяФайла, ИмяФайлаНазначение, Истина, Истина);
		иначе
			флВсеХорошо = Истина;	
		КонецЕсли;
		
		Если флВсеХорошо тогда
			Об =   Элементы.СписокГТД.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
			Об.ИмяФайлаДекларации = Диалог.ПолноеИмяФайла;
			Об.Записать();
			Предупреждение("Выполнено успешно!");
		КонецЕсли;
		
		ОбновитьТаблицуФайлы();  		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуФайлы ()	
	Файлы.Очистить(); 
	
	Если Элементы.СписокГТД.ТекущаяСтрока <> Неопределено тогда
	
		ПутьКГТД	=	ПутьКБиблиотекеГТД + СтрЗаменить(СокрЛП(Элементы.СписокГТД.ТекущаяСтрока.Код),"/","_")+".pdf";
		НужныйФайлГТД = Новый Файл(ПутьКГТД);		
		Если  НужныйФайлГТД.Существует() тогда
			НоваяСтрока = Файлы.Добавить();
			НоваяСтрока.ФайлГТД = ПутьКГТД;
			
			Если ЗначениеЗаполнено(Элементы.СписокГТД.ТекущаяСтрока.Ссылка.ИмяФайлаДекларации) тогда
				НоваяСтрока.ФайлДекларации = Элементы.СписокГТД.ТекущаяСтрока.Ссылка.ИмяФайлаДекларации;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Элементы.СписокГТД.ТекущаяСтрока.Ссылка.ИмяФайлаДекларации) тогда
			НоваяСтрока = Файлы.Добавить();
			НоваяСтрока.ФайлДекларации = Элементы.СписокГТД.ТекущаяСтрока.Ссылка.ИмяФайлаДекларации;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГТД(Команда)
	Если Файлы.Количество() >0 тогда
		Если ЗначениеЗаполнено(Файлы[0].ФайлГТД) тогда
			ЗапуститьПриложение(Файлы[0].ФайлГТД);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Файлы[0].ФайлДекларации) тогда		
			ЗапуститьПриложение(Файлы[0].ФайлДекларации);
		КонецЕсли;
	иначе
		Предупреждение("Нет данных для печати!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНужнуюСсылкуГТД(Код)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	НомераГТД.Ссылка
	      	 	             |ИЗ
	      	 	             |	Справочник.НомераГТД КАК НомераГТД
	      	 	             |ГДЕ
	      	 	             |	НомераГТД.Код = &Код");
	Запрос.УстановитьПараметр("Код",Код);
	рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() >0 тогда
		Возврат Рез[0].Ссылка;
	иначе
		Справочники.НомераГТД.ПустаяСсылка();
	КонецЕсли;                               	
	
КонецФункции

&НаКлиенте
Процедура СоздатьГТД(Команда)
	ОткрытьФорму("Справочник.НомераГТД.ФормаОбъекта");	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьЗначение("Обработка_ПутьККаталогуПоУмолчанию",  ПутьККаталогуПоУмолчанию);
КонецПроцедуры
