
&После("ПередЗаписью")
Процедура TBK_ПередЗаписью(Отказ)
	// Вставить содержимое метода.
	//ЭтотОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	
	
	Если НЕ(Отказ)  Тогда
		Объект = ЭтотОбъект;
		Если Не Объект.ЭтоГруппа Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
				Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт.");
			Конецесли;
			
			группаВторогоУровня = Объект;
			группаПервогоУровня = группаВторогоУровня.Родитель;
			
			Пока ЗначениеЗаполнено(группаВторогоУровня.Родитель) И ЗначениеЗаполнено(группаВторогоУровня.Родитель.Родитель) Цикл
				группаВторогоУровня = группаВторогоУровня.Родитель;				
				Если ЗначениеЗаполнено(группаВторогоУровня.Родитель) Тогда
					группаПервогоУровня = группаВторогоУровня.Родитель;
				Конецесли;
			КонецЦикла;
			
			группаВторогоУровня = СокрЛП(Строка(группаВторогоУровня));
			Если НЕ (Строка(Объект.НоменклатурнаяГруппа) = группаВторогоУровня) Тогда
				группаАналитическогоУчета = ПолучитьГруппуАналитическогоУчета(группаВторогоУровня, Строка(группаПервогоУровня));
				Объект.НоменклатурнаяГруппа = группаАналитическогоУчета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры


Функция ПолучитьГруппуАналитическогоУчета(наименование, наименованиеРодителя = "")
	группаАналитическогоУчетаСсылка = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(наименование);
				
	Если НЕ ЗначениеЗаполнено(группаАналитическогоУчетаСсылка) Тогда
		новаяГруппаАналитическогоУчета = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		новаяГруппаАналитическогоУчета.Наименование = наименование;
		новаяГруппаАналитическогоУчета.ОбменДанными.Загрузка = истина;
		новаяГруппаАналитическогоУчета.Записать();
		группаАналитическогоУчетаСсылка = новаяГруппаАналитическогоУчета.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(наименованиеРодителя) Тогда
		Если СокрЛП(Строка(группаАналитическогоУчетаСсылка.Родитель)) <> СокрЛП(наименованиеРодителя) Тогда
			
			обГруппаАналитическогоУчета = группаАналитическогоУчетаСсылка.ПолучитьОбъект(); 
			
			обГруппаАналитическогоУчета.Родитель = ПолучитьГруппуАналитическогоУчета(наименованиеРодителя);
			
			обГруппаАналитическогоУчета.ОбменДанными.Загрузка = истина;
			обГруппаАналитическогоУчета.Записать();

		КонецЕсли;
	Конецесли;
	
	возврат группаАналитическогоУчетаСсылка;
КонецФункции
