
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер(Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить());
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если не отказ и Сформирован и Проведен тогда
		ЗаписатьДанныеПоЗаявке(Ссылка,Новый ХранилищеЗначения(Товары.Выгрузить()));	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьДанныеПоЗаявке(Ссылка,ХранЗнач)
	Рег = РегистрыСведений.ТБК_ДанныеПоЗаявкамМагазинов.СоздатьНаборЗаписей();
	Рег.Отбор.Документ.Установить(Ссылка); 
	
	Рег.Прочитать();
	Если рег.Количество() = 0 тогда	
		НоваяСтрока	=	Рег.Добавить();
		НоваяСтрока.Документ	=	Ссылка;
		НоваяСтрока.Товары		=	ХранЗнач;
		НоваяСтрока.Экспедитор	=	Экспедитор;
		
		Рег.Записать();
	иначе
		Если ЗначениеЗаполнено(Экспедитор) и не ЗначениеЗаполнено(рег[0].Экспедитор) тогда
			рег[0].Экспедитор	=	Экспедитор;	
			рег[0].Отправлен	=	Ложь;
			рег.Записать();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Документ КАК Документ
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ДанныеПоЗаявкамМагазинов КАК ТБК_ДанныеПоЗаявкамМагазинов
	      	 	             |ГДЕ
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Документ = &Документ
	      	 	             |	И ТБК_ДанныеПоЗаявкамМагазинов.Отправлен");
	Запрос.УстановитьПараметр("Документ",Ссылка);
	Если не запрос.Выполнить().Пустой() тогда
		СОобщить("Не возможно! Документ уже отправлен в офис!");
		отказ = истина;
	иначе
		Рег = РегистрыСведений.ТБК_ДанныеПоЗаявкамМагазинов.СоздатьНаборЗаписей();
		Рег.Отбор.Документ.Установить(Ссылка); 
		Рег.Записать();
	КонецЕсли;
	


КонецПроцедуры
  