
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер(Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить());
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если не отказ и Сформирован и Проведен тогда
		ЗаписатьДанныеПоЗаявке(Ссылка,Новый ХранилищеЗначения(Товары.Выгрузить()));	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьДанныеПоЗаявке(Ссылка,ХранЗнач)
	Рег = РегистрыСведений.ТБК_ДанныеПоЗаявкамМагазинов.СоздатьНаборЗаписей();
	Рег.Отбор.Документ.Установить(Ссылка); 
	
	Рег.Прочитать();
	Если рег.Количество() = 0 тогда	
		НоваяСтрока	=	Рег.Добавить();
		НоваяСтрока.Документ	=	Ссылка;
		НоваяСтрока.Товары		=	ХранЗнач;
		НоваяСтрока.Экспедитор	=	Экспедитор;
		
		Рег.Записать();
	иначе
		Если ЗначениеЗаполнено(Экспедитор) и не ЗначениеЗаполнено(рег[0].Экспедитор) тогда
			рег[0].Экспедитор	=	Экспедитор;	
			рег[0].Отправлен	=	Ложь;
			рег.Записать();
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос	=	новый запрос("ВЫБРАТЬ
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Документ КАК Документ
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБК_ДанныеПоЗаявкамМагазинов КАК ТБК_ДанныеПоЗаявкамМагазинов
	      	 	             |ГДЕ
	      	 	             |	ТБК_ДанныеПоЗаявкамМагазинов.Документ = &Документ
	      	 	             |	И ТБК_ДанныеПоЗаявкамМагазинов.Отправлен"); 
	Запрос.УстановитьПараметр("Документ",Ссылка);
	Если не запрос.Выполнить().Пустой() тогда
		СОобщить("Не возможно! Документ уже отправлен в офис!");
		отказ = истина;
	иначе
		Рег = РегистрыСведений.ТБК_ДанныеПоЗаявкамМагазинов.СоздатьНаборЗаписей();
		Рег.Отбор.Документ.Установить(Ссылка); 
		Рег.Записать();
	КонецЕсли;
	


КонецПроцедуры

// Сохраняет настройку рабочей даты пользователя.
//
// Параметры:
//	СтруктураДанных - Стркутра - Пример данных структруы: НоменклатураКод1, Характеристика1, Количество1 (ТипСтрока);
//
процедура ЗаполнитьТоварыПоСтруктуреДанных(СтруктураДанных) Экспорт
	
	Для i=1 по 10000 цикл
			Если СтруктураДанных.Свойство("НоменклатураКод"+Строка(i)) тогда
				Количество				=	"";
				НоменклатураКод			=	"";
				Характеристика			=	"";
				
				СтруктураДанных.Свойство("Количество"					+	Строка(i),	Количество);
				СтруктураДанных.Свойство("НоменклатураКод"				+	Строка(i),	НоменклатураКод);
				СтруктураДанных.Свойство("Характеристика"				+	Строка(i),	Характеристика); 
				
				НоменклатураСсылка		=	Справочники.Номенклатура.НайтиПоКоду(НоменклатураКод);	
				
				НужнаяХарактеристика	=	Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Если ЗначениеЗаполнено(Характеристика) тогда
					Запрос	=	Новый Запрос("ВЫБРАТЬ
					      	 	             |	ХарактеристикиНоменклатуры.Ссылка
					      	 	             |ИЗ
					      	 	             |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
					      	 	             |ГДЕ
					      	 	             |	ХарактеристикиНоменклатуры.Владелец = &Владелец
					      	 	             |	И ХарактеристикиНоменклатуры.Наименование = &Наименование");
					Запрос.УстановитьПараметр("Владелец",НоменклатураСсылка);
					Запрос.УстановитьПараметр("Наименование",Характеристика);
					Рез = Запрос.Выполнить().Выгрузить();
					Если Рез.Количество() >0 тогда
						НужнаяХарактеристика			=	Рез[0].Ссылка;
					КонецЕсли; 	
				КонецЕсли;					
				
	       		НоваяСтрока	= Товары.Добавить();
				НоваяСтрока.Номенклатура	=	НоменклатураСсылка;
				НоваяСтрока.Характеристика	=	НужнаяХарактеристика;
				НоваяСтрока.Количество		=	Число(Количество);	
			иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	
КонецПроцедуры
