
&НаКлиенте
Процедура НоменклатураСодержитПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьПоиск", ПоискПоНоменклатруре);
	Список.Параметры.УстановитьЗначениеПараметра("КлючевоеСлово", "%" + НоменклатураСодержит + "%");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если ТекСтрока.ПризнакОбновление = 0 тогда
			УбратьПризнакСервер(ТекСтрока.Номер, ТекСтрока.Дата);
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСерверебезКонтекста
Процедура УбратьПризнакСервер(Номер,Дата)
	Об	=	Документы.ТБК_ЗаявкаОтМагазина.НайтиПоНомеру(Номер,дата).ПолучитьОбъект();
	Об.ПризнакОбновление	=	1;
	Об.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура Инструкция(Команда)
	ОбщегоНазначенияВызовСервера.ОткрытьНужнуюИнструкцию("Заявка на возврат товара");		
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Статус",,ВидСравненияКомпоновкиДанных.Содержит,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ФильтрПоПроектам.Очистить();
	
	если ПоказыватьВсе тогда Возврат; КонецЕсли;
		
	Если ПоказатьТолькоИМ тогда 
		
		ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());   	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	иначе
		//Марк 2025-01-10
		ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());   	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.НеВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		//КонецМарк
		Если НачалоДня(ТекущаяДата()) <= '20250104'  Тогда //Марк 2024-12-16
			
			ФильтрПоПроектам.Добавить(ПолучитьПроектЧистка());   	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Проект", ФильтрПоПроектам ,ВидСравненияКомпоновкиДанных.НеВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ЭтоИМ") тогда
		Если Параметры.ЭтоИМ тогда
			ПоказатьТолькоИМ	=	Истина;		
		иначе
			ФильтрПоПроектам.Добавить(ПолучтьПроектИнтернетМагазин());	
		КонецЕсли;
	//Марк 2025-02-03	
	ИначеЕсли Параметры.Свойство("ПоказыватьВсе") Тогда
		ПоказыватьВсе = Истина;
	//КонецМарк 
	КонецЕсли;
		
	ФильтрПроектСписано = Справочники.ТБКПроекты.НайтиПоНаименованию("Списано");
	
	//Марк 2026-03-03 https://jira.tabkn.ru/browse/ROZ-22
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьПоиск", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("КлючевоеСлово", "");
	//КонецМарк
	
КонецПроцедуры

&НаСерверебезКонтекста 
Функция ПолучитьПроектЧистка()
	Возврат Справочники.ТБКПроекты.НайтиПоНаименованию("ЧИСТКА");	
КонецФункции


&НаСерверебезКонтекста
Функция ПолучтьПроектИнтернетМагазин() //Марк 2024-02-27
	Возврат Справочники.ТБКПроекты.НайтиПоНаименованию("Возврат (Собирать) интернет-магазин");
КонецФункции

&НаКлиенте
Процедура ОтчетТБКЗаявки(Команда)
	ОткрытьФорму("Отчет.ТБКОтчет_ТБК_Заявки.Форма");
КонецПроцедуры

