&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ИзменитьЗаголовок тогда
		Если ЗначениеЗаполнено(НовыйЗаголовок) тогда
			Элементы.Декорация_Внимание.Заголовок	=	"ВНИМАНИЕ!!!" + Символы.ПС + НовыйЗаголовок;
		иначе
			Элементы.Декорация_Внимание.Заголовок	=	"ВНИМАНИЕ!!!" + Символы.ПС + "Нельзя продавать номенклатуру помеченную на удаление!";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИзменитьЗаголовок") тогда
		ИзменитьЗаголовок	= Параметры.ИзменитьЗаголовок;
		НовыйЗаголовок		= Параметры.НовыйЗаголовок;	
	иначе
		ИзменитьЗаголовок	=	ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Ok(Команда)
	Этаформа.Закрыть();
КонецПроцедуры
