
Процедура ОбновитьРезультатФокуснойМотивации() Экспорт 
	
	ДатаПересчета	=	ОбщегоНазначения.ПолучитьЗначениеТБККонстанты("ДанныеПоФокуснойМотивацииПересчитаны");
	
	Если ДатаПересчета <> Неопределено тогда
		Если НачалоДня(ДатаПересчета) = НачалоДня(ТекущаяДата()) тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ПериодНачало = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
	
	//ДатаПрошлогоМесяца = ДобавитьМесяц(ТекущаяДата(), -2);
	//ПериодНачало = НачалоМесяца(ДатаПрошлогоМесяца);
	//КонецПериода = КонецМесяца(ПериодНачало);
	
	Запрос.УстановитьПараметр("Период2", КонецПериода);
	Запрос.УстановитьПараметр("Период1", ПериодНачало);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации КАК ПериодМотивации
	|ИЗ
	|	РегистрСведений.ТБК_РезультатФокуснойМотивации КАК ТБК_РезультатФокуснойМотивации
	|ГДЕ
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации МЕЖДУ &Период1 И &Период2
	|
	|СГРУППИРОВАТЬ ПО
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ТБК_РезультатФокуснойМотивации.СоздатьНаборЗаписей();
		Набор.Отбор.ПериодМотивации.Установить(Выборка.ПериодМотивации);
		Набор.Записать();
	КонецЦикла;
	
	
	// пересчитать и отправить в ут	
	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПроктиWStbk();
	
	ПериодКонец = НачалоДня(КонецПериода);
	
	Пока ПериодНачало <> ПериодКонец Цикл
		
		//ПОЛУЧАЕМ ПРОДАВЦОВ 	
		Запрос	= Новый запрос("ВЫБРАТЬ
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец,
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин КАК Магазин
		|ИЗ
		|	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		|ГДЕ
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец,
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин");  
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодНачало));
		Запрос.УстановитьПараметр("ТипПродавца", Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
		РезВсеПродавцы = Запрос.Выполнить().Выгрузить();    
		
		флОтправленоУспешно = Ложь; 
		
		МассивОбщий	= Новый Массив; 
		
		Для каждого СтрокаПродавец из РезВсеПродавцы Цикл
			
			ТаблицаРасшифровка	=	Обработки.РМКУправляемыйРежим.ПолучитьТаблицуПоФокуснойМотивации(0, ПериодНачало, 1, СтрокаПродавец.Продавец);
			
			ДанныеДляЗаписи	=	Новый Структура;
			ДанныеДляЗаписи.Вставить("Продавец", СтрокаПродавец.Продавец);	
			
			МассивДляЗаписи	=	Новый Массив;
			Для каждого СтрокаДанные из ТаблицаРасшифровка Цикл		
				ДляЗаписи	=	Новый Структура;
				ДляЗаписи.Вставить("ФокусГруппа",		СтрокаДанные.ФокусГруппа);
				ДляЗаписи.Вставить("ПланПродаж", 		СтрокаДанные.ПланПродаж);
				ДляЗаписи.Вставить("ФактПродаж", 		СтрокаДанные.ФактПродаж);
				ДляЗаписи.Вставить("КоличествоСверх", 	СтрокаДанные.КоличествоСверх);
				ДляЗаписи.Вставить("СуммаФакт", 		СтрокаДанные.СуммаФакт);
				ДляЗаписи.Вставить("СуммаСверх", 		СтрокаДанные.СуммаСверх);
				ДляЗаписи.Вставить("СуммаПремии", 		СтрокаДанные.СуммаПремии);
				
				МассивДляЗаписи.Добавить(ДляЗаписи);
			КонецЦикла;
			ДанныеДляЗаписи.Вставить("ДляЗаписи", МассивДляЗаписи);
			
			МассивОбщий.Добавить(ДанныеДляЗаписи);
			
		КонецЦикла;	
		
		
		Магазин = ОбщегоНазначения.ПолучитьМагазин();
		
		Для каждого ПродавецМагазин из МассивОбщий Цикл
			ДляЗаписи	=	ПродавецМагазин.ДляЗаписи;
			
			Для каждого СтрокаДанных из ДляЗаписи Цикл
				Рег = РегистрыСведений.ТБК_РезультатФокуснойМотивации.СоздатьМенеджерЗаписи();
				Рег.ПериодМотивации	=	ПериодНачало;
				рег.Магазин			=	Магазин;
				рег.Продавец		=	ПродавецМагазин.Продавец; 
				
				ЗаполнитьЗначенияСвойств(рег, СтрокаДанных);
				
				рег.Записать();
			КонецЦикла;  			
		КонецЦикла;
		
		// перенос
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ПериодНачало));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ТБК_РезультатФокуснойМотивации.Магазин КАК Магазин,
		|	ТБК_РезультатФокуснойМотивации.Продавец КАК Продавец,
		|	ТБК_РезультатФокуснойМотивации.ПериодМотивации КАК ПериодМотивации,
		|	ТБК_РезультатФокуснойМотивации.ФокусГруппа КАК ФокусГруппа,
		|	ТБК_РезультатФокуснойМотивации.ПланПродаж КАК ПланПродаж,
		|	ТБК_РезультатФокуснойМотивации.ФактПродаж КАК ФактПродаж,
		|	ТБК_РезультатФокуснойМотивации.КоличествоСверх КАК КоличествоСверх,
		|	ТБК_РезультатФокуснойМотивации.СуммаФакт КАК СуммаФакт,
		|	ТБК_РезультатФокуснойМотивации.СуммаПремии КАК СуммаПремии,
		|	ТБК_РезультатФокуснойМотивации.СуммаСверх КАК СуммаСверх
		|ИЗ
		|	РегистрСведений.ТБК_РезультатФокуснойМотивации КАК ТБК_РезультатФокуснойМотивации
		|ГДЕ
		|	ТБК_РезультатФокуснойМотивации.ПериодМотивации МЕЖДУ &ДатаНач И &ДатаКон
		|ИТОГИ ПО
		|	Продавец";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПродавец = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивВозврата	=	Новый Массив;
		
		Пока ВыборкаПродавец.Следующий() Цикл
			
			эл = Новый Структура;
			эл.Вставить("Продавец",		СокрЛП(Строка(ВыборкаПродавец.Продавец)));	
			эл.Вставить("Магазин",		СокрЛП(Строка(Магазин)));
			эл.Вставить("Период",		Строка(ПериодНачало));
			
			Выборка = ВыборкаПродавец.Выбрать();
			
			МассивДанные	=	Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				
				Данные	=	Новый Структура;
				Данные.Вставить("ФокусГруппа",		Строка(Выборка.ФокусГруппа));
				Данные.Вставить("ПланПродаж", 		Строка(Выборка.ПланПродаж));
				Данные.Вставить("ФактПродаж", 		Строка(Выборка.ФактПродаж));
				Данные.Вставить("КоличествоСверх", 	Строка(Выборка.КоличествоСверх));
				Данные.Вставить("СуммаФакт", 		Строка(Выборка.СуммаФакт));
				Данные.Вставить("СуммаСверх", 		Строка(Выборка.СуммаСверх));
				Данные.Вставить("СуммаПремии", 		Строка(Выборка.СуммаПремии));
				
				МассивДанные.Добавить(Данные);
				
			КонецЦикла;
			эл.Вставить("Данные", МассивДанные);
			
			МассивВозврата.Добавить(эл);
			
		КонецЦикла;
		Ответ = Истина;
		JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
		
		Ответ	=	Прокси.writeFocusMotivation_day(JS); 
		
		ПериодНачало = ПериодНачало + 60 * 60 * 24;
		
	КонецЦикла;
	
	Если Ответ Тогда
		ОбщегоНазначения.УстановитьЗначениеТБККонстанты("ДанныеПоФокуснойМотивацииПересчитаны", ТекущаяДата());				
	КонецЕсли;
	
КонецПроцедуры

