
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	ДатаНачО = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНач"));
	ДатаНачО.Использование = Истина;
	ДатаНачО.Значение = ДатаНач;
	    
	ДатаКонО = настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКон"));
	ДатаКонО.Использование = Истина;
	ДатаКонО.Значение = ДатаКон;
	
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Склад;
	КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование  = ЗначениеЗаполнено(склад);
	
	
КонецПроцедуры
