
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//ТекСтрока = Элементы.Список.ТекущиеДанные;
	//Если ТекСтрока <> Неопределено Тогда
	//	Если ТекСтрока.ПризнакОбновление = 0 тогда
	//		УбратьПризнакСервер(ТекСтрока.Номер, ТекСтрока.Дата);
	//		Элементы.Список.Обновить();
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаСерверебезКонтекста
Процедура УбратьПризнакСервер(Номер,Дата)
	//Об	=	Документы.ТБК_ЗаявкаОтМагазина.НайтиПоНомеру(Номер,дата).ПолучитьОбъект();
	//Об.ПризнакОбновление	=	1;
	//Об.Записать();	
КонецПроцедуры