
&После("ПередЗаписью")
Процедура TBK_ПередЗаписью(Отказ)
	// Вставить содержимое метода.
	Если НЕ(Отказ) Тогда
		Объект = ЭтотОбъект;
		Если Не Объект.ЭтоГруппа Тогда
	
			группаВторогоУровня = Объект.Родитель;
			группаПервогоУровня = Справочники.Номенклатура.ПустаяСсылка();
			
			Пока ЗначениеЗаполнено(группаВторогоУровня.Родитель) Цикл
				группаВторогоУровня = группаВторогоУровня.Родитель;
				
				Если ЗначениеЗаполнено(группаВторогоУровня.Родитель) Тогда
					группаПервогоУровня = группаВторогоУровня.Родитель.Родитель;
				Конецесли;
				
				Если ЗначениеЗаполнено(группаВторогоУровня.Родитель) И ЗначениеЗаполнено(группаВторогоУровня.Родитель.Родитель) И не ЗначениеЗаполнено(группаВторогоУровня.Родитель.Родитель.Родитель) Тогда
					break;
				КонецЕсли;
			КонецЦикла;
			
			группаВторогоУровня = Строка(группаВторогоУровня);
			Если НЕ (Строка(Объект.ГруппаАналитическогоУчета) = группаВторогоУровня) Тогда
				
				группаАналитическогоУчета = ПолучитьГруппуАналитическогоУчета(группаВторогоУровня, Строка(группаПервогоУровня));
				Объект.ГруппаАналитическогоУчета = группаАналитическогоУчета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры


Функция ПолучитьГруппуАналитическогоУчета(наименование, наименованиеРодителя = "")
	группаАналитическогоУчетаСсылка = Справочники.ГруппыАналитическогоУчетаНоменклатуры.НайтиПоНаименованию(наименование);
				
	Если НЕ ЗначениеЗаполнено(группаАналитическогоУчетаСсылка) Тогда
		новаяГруппаАналитическогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.СоздатьЭлемент();
		новаяГруппаАналитическогоУчета.Наименование = наименование;
		новаяГруппаАналитическогоУчета.ОбменДанными.Загрузка = истина;
		новаяГруппаАналитическогоУчета.Записать();
		группаАналитическогоУчетаСсылка = новаяГруппаАналитическогоУчета.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(наименованиеРодителя) Тогда
		Если СокрЛП(Строка(группаАналитическогоУчетаСсылка.Родитель)) <> СокрЛП(наименованиеРодителя) Тогда
			
			обГруппаАналитическогоУчета = группаАналитическогоУчетаСсылка.ПолучитьОбъект(); 
			
			обГруппаАналитическогоУчета.Родитель = ПолучитьГруппуАналитическогоУчета(наименованиеРодителя);
			
			обГруппаАналитическогоУчета.ОбменДанными.Загрузка = истина;
			обГруппаАналитическогоУчета.Записать();

		КонецЕсли;
	Конецесли;
	
	возврат группаАналитическогоУчетаСсылка;
КонецФункции
