
&После("ПередЗаписью")
Процедура TBK_ПередЗаписью(Отказ)
	// Вставить содержимое метода.
	Если НЕ(Отказ) Тогда
		Объект = ЭтотОбъект;
		Если Не Объект.ЭтоГруппа Тогда
	
			группаВторогоУровня = Объект.Родитель;
			
			Пока ЗначениеЗаполнено(группаВторогоУровня.Родитель) Цикл
				группаВторогоУровня = группаВторогоУровня.Родитель;
				Если ЗначениеЗаполнено(группаВторогоУровня.Родитель) И ЗначениеЗаполнено(группаВторогоУровня.Родитель.Родитель) И не ЗначениеЗаполнено(группаВторогоУровня.Родитель.Родитель.Родитель) Тогда
					break;
				КонецЕсли;
			КонецЦикла;
			
			группаВторогоУровня = Строка(группаВторогоУровня);
			Если НЕ (Строка(Объект.ГруппаАналитическогоУчета) = группаВторогоУровня) Тогда
				
				группаАналитическогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.НайтиПоНаименованию(группаВторогоУровня);
				
				Если НЕ ЗначениеЗаполнено(группаАналитическогоУчета) Тогда
					новаяГруппаАналитическогоУчета = Справочники.ГруппыАналитическогоУчетаНоменклатуры.СоздатьЭлемент();
					новаяГруппаАналитическогоУчета.Наименование = группаВторогоУровня;
					новаяГруппаАналитическогоУчета.Записать();
					группаАналитическогоУчета = новаяГруппаАналитическогоУчета.Ссылка;
				КонецЕсли;
				
				Объект.ГруппаАналитическогоУчета = группаАналитическогоУчета;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
