
&Вместо("СтавкаНДСВФорматеБПО")
Функция ТБКСтавкаНДСВФорматеБПО(СтавкаНДС, ЭтоАванс)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Неопределено;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 И ЭтоАванс Тогда
		Возврат 110;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 И ЭтоАванс Тогда
		Возврат 118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 И ЭтоАванс Тогда
		Возврат 120;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда 
		Возврат 18;
		//Марк 2025-02-13
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат 5;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат 7;
		//КонецМарк
	Иначе 
		Возврат 20;
	КонецЕсли;

	
КонецФункции
