
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(АдресГТДВХранилище) тогда
		ОбработатьНаСервере(АдресГТДВХранилище);	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура  ОбработатьНаСервере(АдресВХ)
    НужнаяТЗ = ПолучитьИзВременногоХранилища(АдресВХ);  
	ПутьКБиблиотекеГТД = Константы.ПутьКБиблиотекеГТД.Получить();

	Для каждого Строка из НужнаяТЗ цикл
		Если ЗначениеЗаполнено(Строка.номерГТД) тогда			
			ИмяФайла	=	ПутьКБиблиотекеГТД + СтрЗаменить(СокрЛП(Строка.номерГТД),"/","_")+".pdf";
			
			НоваяСтрока = ФайлыГТД.Добавить();
			НоваяСтрока.ФайлГТД = ИмяФайла;
			НоваяСтрока.флВыводитьНаПечать = Истина;
			
			ГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СокрЛП(Строка.номерГТД));
			Если не ГТДСсылка.Пустая() тогда
				Если ЗначениеЗаполнено(ГТДСсылка.ИмяФайлаДекларации) тогда
					Отбор = новый Структура;
					Отбор.Вставить("ФайлДекларации",ГТДСсылка.ИмяФайлаДекларации);
					
					Если ФайлыДекларации.НайтиСтроки(Отбор).количество() = 0 тогда
						НоваяСтрока = ФайлыДекларации.Добавить();
						НоваяСтрока.ФайлДекларации = ГТДСсылка.ИмяФайлаДекларации;
						НоваяСтрока.флВыводитьНаПечать = Истина;
					КонецЕсли;
	
				КонецЕсли;
			КонецЕсли; 			
		КонецЕсли;
		
	КонецЦикла; 		
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	Для каждого СТрока из ФайлыГТД цикл
		Если Строка.флВыводитьНаПечать тогда
			НужныйФайл = Новый Файл(СТрока.ФайлГТД);		
			Если  НужныйФайл.Существует() тогда
				ЗапуститьПриложение(СТрока.ФайлГТД);
			иначе
				Сообщить("Не найден файл: "+СТрока.ФайлГТД,СтатусСообщения.Важное);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СТрока из ФайлыДекларации цикл
		Если Строка.флВыводитьНаПечать тогда
			НужныйФайл = Новый Файл(СТрока.ФайлДекларации);		
			Если  НужныйФайл.Существует() тогда
				ЗапуститьПриложение(СТрока.ФайлДекларации);
			иначе
				Сообщить("Не найден файл: "+СТрока.ФайлДекларации,СтатусСообщения.Важное);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	

	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры
