#Область ИзмененияФормы

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыСуммаПриИзменении(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыВидРаспределенияПриИзменении(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры

&НаКлиенте
Процедура СуммаНедостачиФактПриИзменении(Элемент)
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыУдержаноФактПриИзменении(Элемент)
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьСуммуПерезачетов();
	Структура = Новый Структура("ВидРаспределения", Перечисления.ВидРаспределения.Перезачет);
    ТЗ = Объект.РаспределениеНедостачиПерезачеты.Выгрузить(Структура,"Сумма");
	Возврат ТЗ.Итог("Сумма");	
КонецФункции

&НаСервере
Функция ПолучитьСуммуНеРаспределеноНедостачи(СуммаНедостачиФакт);
	Структура = Новый Структура("ВидРаспределения", Перечисления.ВидРаспределения.Недостача);
    ТЗ = Объект.РаспределениеНедостачиПерезачеты.Выгрузить(Структура,"Сумма");
	Возврат СуммаНедостачиФакт - ТЗ.Итог("Сумма");
КонецФункции

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыПослеУдаления(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры










