&Перед("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

    //Марк 15.08.2023
	Если не ЭтоНовый() тогда
	    Запрос = Новый Запрос;
	    Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЧекККМ.Ссылка КАК Ссылка
	    |ИЗ
	    |	Документ.ЧекККМ КАК ЧекККМ
	    |ГДЕ
	    |	ЧекККМ.ВозвратОтПокупателя = &ВозвратОтПокупателя
	    |	И ЧекККМ.Проведен
	    |	И ЧекККМ.Дата >= &Дата";
	    
	    Запрос.УстановитьПараметр("ВозвратОтПокупателя", Ссылка);
	    Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 60 * 24*60*60);//вик 2024-08-05 иначе обрабатывается очень долго

		Если не запрос.Выполнить().Пустой() тогда		     
			
			Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Нельзя распровести документ, так как у него есть пробитый чек";
	        Сообщение.Сообщить();
	        Отказ = Истина;      
	      
		КонецЕсли;
	КонецЕсли;
  //КонецМарк

КонецПроцедуры