&Перед("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	//Марк 15.08.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|  ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|  Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|  ЧекККМ.ВозвратОтПокупателя = &ВозвратОтПокупателя";
	
	Запрос.УстановитьПараметр("ВозвратОтПокупателя", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя изменить документ, так как у него есть пробитый чек";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	//КонецМарк

КонецПроцедуры