
&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
	Если не ОбщегоНазначенияВызовСервера.ПроверитьВозможностьРедактирования_Общая()  тогда
		ЭтаФорма.ТолькоПросмотр = истина;
	иначе
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТБКПерезаполнитьПосле(Команда)
	
	ПерезаполнитьНаСервере();	
	
КонецПроцедуры  

&НаСервере
Процедура ПерезаполнитьНаСервере()

	КассоваяСмена 			= Объект.КассоваяСмена;
	ОтчетОРозничныхПродажах = Объект;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.ОтчетОРозничныхПродажах.СоздатьВТДокументыНаККМ(МенеджерВременныхТаблиц, КассоваяСмена, Объект.Ссылка);
	
	ЗапросПоЧекам = Новый Запрос;
	ЗапросПоЧекам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросПоЧекам.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	втТаблицаЧеков КАК Док
	|";
	
	РезультатЗапросаПоЧекам  = ЗапросПоЧекам.Выполнить();
	ТаблицаЧеков = РезультатЗапросаПоЧекам.Выгрузить();
	
	ОтменитьТранзакцию		= Ложь;
	
	Документы.ОтчетОРозничныхПродажах.ЗаполнитьОтчетОРозничныхПродажахПоДаннымВЧеках(ОтчетОРозничныхПродажах, МенеджерВременныхТаблиц, ОтменитьТранзакцию);
	Модифицированность = Истина;
	
	
КонецПроцедуры
