
&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
	Если не ОбщегоНазначенияВызовСервера.ПроверитьВозможностьРедактирования_Общая()  тогда
		ЭтаФорма.ТолькоПросмотр = истина;
		Элементы.ФормаВыгрузитьДокументВФайл.Видимость = Ложь;
	иначе
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Элементы.ФормаВыгрузитьДокументВФайл.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТБКПерезаполнитьПосле(Команда)
	
	ПерезаполнитьНаСервере();	
	
КонецПроцедуры  

&НаСервере
Процедура ПерезаполнитьНаСервере()

	КассоваяСмена 			= Объект.КассоваяСмена;
	ОтчетОРозничныхПродажах = Объект;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.ОтчетОРозничныхПродажах.СоздатьВТДокументыНаККМ(МенеджерВременныхТаблиц, КассоваяСмена, Объект.Ссылка);
	
	ЗапросПоЧекам = Новый Запрос;
	ЗапросПоЧекам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросПоЧекам.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	втТаблицаЧеков КАК Док
	|";
	
	РезультатЗапросаПоЧекам  = ЗапросПоЧекам.Выполнить();
	ТаблицаЧеков = РезультатЗапросаПоЧекам.Выгрузить();
	
	ОтменитьТранзакцию		= Ложь;
	
	Документы.ОтчетОРозничныхПродажах.ЗаполнитьОтчетОРозничныхПродажахПоДаннымВЧеках(ОтчетОРозничныхПродажах, МенеджерВременныхТаблиц, ОтменитьТранзакцию);
	Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТБКВыгрузитьДокументВФайлПосле(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru='Выберите файл, куда записать документы'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='JSON (*.json)|*.json'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("Обработчик_Выгрузки", ЭтаФорма, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_Выгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];
		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			
			ОРП_ = ВыгрузитьВФайлНаСервере();
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.ОткрытьФайл(ИмяФайла);
			ЗаписатьJSON(ЗаписьJSON, ОРП_);
			ЗаписьJSON.Закрыть();
			
			Сообщить("Файл сформирован: " + ИмяФайла)
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры

&НаСервере
Функция ВыгрузитьВФайлНаСервере()
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		|	ОтчетОРозничныхПродажахТовары.Характеристика КАК Характеристика,
		|	ОтчетОРозничныхПродажахТовары.Количество КАК Количество,
		|	ОтчетОРозничныхПродажахТовары.Цена КАК Цена,
		|	ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
		|ГДЕ
		|	ОтчетОРозничныхПродажахТовары.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	МассивОбщий	=	Новый Массив; 
	
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Склад", 	            Строка(ВыборкаСсылка.Ссылка.Магазин.СкладПродажи));
		СтруктураДанных.Вставить("СуммаДокумента", 	        ВыборкаСсылка.Ссылка.СуммаДокумента);
		СтруктураДанных.Вставить("Номер", 	                Строка(ВыборкаСсылка.Ссылка.Номер));
		СтруктураДанных.Вставить("Дата", 	                Строка(ВыборкаСсылка.Ссылка.Дата)); 
		
		Товары = Новый Массив;
		СтруктураДанных.Вставить("Товары", Товары);
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Товары.Добавить(Новый Структура("НоменклатураУИ, Номенклатура, ХарактеристикаУИ, Характеристика, Количество, Цена",
			Строка(ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор()),
			Строка(ВыборкаДетальныеЗаписи.Номенклатура),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика.УникальныйИдентификатор())),
			?(ВыборкаДетальныеЗаписи.Характеристика = Неопределено, "", Строка(ВыборкаДетальныеЗаписи.Характеристика)),
			ВыборкаДетальныеЗаписи.Количество,
			ВыборкаДетальныеЗаписи.Цена));
		КонецЦикла;
		
			МассивОбщий.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивОбщий;
	
КонецФункции




