
&НаКлиенте
Процедура ТБКВозвратОтПокупателяПосле(Команда) 	
	ЧекККМ = Элементы.Список.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ЧекККМ) тогда
		НовыйДокументВозврата = ЗаполнитьДокументВозвратТоваровОтПокупателяНаСервере(ЧекККМ);
		
		ПараметрыОткрытия = Новый Структура("Ключ",НовыйДокументВозврата);
		ОткрытьФорму("Документ.ВозвратТоваровОтПокупателя.Форма.ФормаДокумента",ПараметрыОткрытия)
	КонецЕсли; 	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаполнитьДокументВозвратТоваровОтПокупателяНаСервере(ЧекККМ)
	НовыйДокументВозврата = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();

	ЗаполнитьЗначенияСвойств(НовыйДокументВозврата,ЧекККМ);
	
	НовыйДокументВозврата.УстановитьНовыйНомер();
	НовыйДокументВозврата.Дата = ТекущаяДата();
	НовыйДокументВозврата.Склад = ЧекККМ.Магазин.СкладПродажи;
	НовыйДокументВозврата.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(СокрЛП(ЧекККМ.Магазин.Наименование)+" "+"Покупатель");
	
	Для каждого Строка из ЧекККМ.Товары цикл
		НоваяСтрока = НовыйДокументВозврата.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.ДокументПродажи	=	ЧекККМ.ОтчетОРозничныхПродажах;
		НоваяСтрока.ЧекККМ			=	ЧекККМ;
	КонецЦикла;
	
	НовыйДокументВозврата.Записать(РежимЗаписиДокумента.Запись); 	
	Возврат НовыйДокументВозврата.Ссылка;
КонецФункции