
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.ШтрихкодыУпаковокТоваров.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ТБККоманда_ОчиститьСервер();
КонецПроцедуры


&НаСервере
Функция ТБККоманда_ОчиститьСервер()
	Справочники.ШтрихкодыУпаковокТоваров.ТБККоманда_Очистить();
КонецФункции