
&Перед("НачатьЧтениеСообщения")
Процедура TBK_НачатьЧтениеСообщения(ЧтениеСообщения, АнализДанных)
	// Вставить содержимое метода.
	//Если ТипЗнч(ЭтотОбъект.УзелОбменаЗагрузкаДанных ) = Тип("ПланОбменаСсылка.УТ11") Тогда
	//	текст = Новый ТекстовыйДокумент;
	//	текст.Прочитать(ИмяФайлаОбмена);
	//	хмл = текст.ПолучитьТекст();
	//	хмл = СтрЗаменить(хмл,"<ДанныеПоОбмену ПланОбмена=""Полный""","<ДанныеПоОбмену ПланОбмена=""УТ11""");
	//	хмл = СтрЗаменить(хмл,"<ДанныеПоФоновомуОбмену ПланОбмена="""" Кому=""0"" ОтКого=""0"" ДобавлениеОбъектовИзФоновогоОбмена=""0"" КоличествоОбъектовДляФоновогоОбмена=""500"" ПереданоОбъектовФоновогоОбмена=""0""/>","");
	//	текст.УстановитьТекст(хмл);
	//	текст.Записать(ИмяФайлаОбмена);	
	//КонецЕсли;
КонецПроцедуры

&После("ВыполнитьВыгрузку")
Процедура TBK_ВыполнитьВыгрузку(СтрокаСообщенияОбОшибке)
	// Вставить содержимое метода.
	//Если ТипЗнч(ЭтотОбъект.УзелДляОбмена ) = Тип("ПланОбменаСсылка.УТ11") Тогда
	//КонецЕсли;
КонецПроцедуры

&После("ЗакрытьФайл")
Процедура TBK_ЗакрытьФайл()
	// Вставить содержимое метода.
	//Если ТипЗнч(ЭтотОбъект.УзелДляОбмена ) = Тип("ПланОбменаСсылка.УТ11") Тогда
	//	текст = Новый ТекстовыйДокумент;
	//	текст.Прочитать(ИмяФайлаОбмена);
	//	хмл = текст.ПолучитьТекст();
	//	хмл = СтрЗаменить(хмл,"<ДанныеПоОбмену ПланОбмена=""УТ11""","<ДанныеПоОбмену ПланОбмена=""Полный""");
	//	текст.УстановитьТекст(хмл);
	//	текст.Записать(ИмяФайлаОбмена);	
	//КонецЕсли;
КонецПроцедуры
