
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервыйДень = НачалоМесяца(ТекущаяДата());
	ИмяМесяца = Формат(ПервыйДень, "ДФ=MMMM");
	Год = Формат(ПервыйДень, "ДФ=yyyy");
	МесяцРегистрацииСтрокой = ИмяМесяца + " " + Год;
	
	Дата = НачалоМесяца(ТекущаяДатаСеанса());
	ПриЧтенииСозданииНаСервере();
	
	Продавец = Параметры.Продавец;
	
	Магазин = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(Магазин);
	
	ТабельЗаполнитьДанныеПоСотрудникам();
	
	УстановитьУсловноеОформление();
	
	ПроставитьСписокПродавцов(Дата);
	
	ПолучитьСписокМесяцев();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокМесяцев()
	Месяцы = Новый Массив;
	
	СоответствияМесяц = Новый Соответствие;
	
	ТекДата = ТекущаяДата();
	
	Для НомерМесяца = 0 По 3 Цикл
		ДатаМесяца = ДобавитьМесяц(ТекДата, -НомерМесяца);
		// Получаем первый день месяца
		ПервыйДень = НачалоМесяца(ДатаМесяца);
		
		ИмяМесяца = Формат(ПервыйДень, "ДФ=MMMM");
		Год = Формат(ПервыйДень, "ДФ=yyyy");
		
		Месяц = ИмяМесяца + " " + Год;
		Месяцы.Добавить(Месяц);
		
		СоответствияМесяц.Вставить(Месяц, ПервыйДень);
	КонецЦикла;
	
	Для каждого СтрокаМесяц Из Месяцы Цикл
		Элементы.МесяцРегистрацииСтрокой.СписокВыбора.Добавить(СтрокаМесяц);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроставитьСписокПродавцов(Период)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец
	|ИЗ
	|	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
	|ГДЕ
	//|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
	|	 ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец");  
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("СтатусЧекаККМ",Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	РезВсеПродавцы	=	Запрос.Выполнить().Выгрузить();    
	РезВсеПродавцы.Свернуть("Продавец");
	
	
	Элементы.Продавец.СписокВыбора.Очистить();
	Для каждого Строка из РезВсеПродавцы цикл 	
		Элементы.Продавец.СписокВыбора.Добавить(Строка.Продавец);
	КонецЦикла;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	|	ТБКСменыСотрудников.КассоваяСмена КАК КассоваяСмена,
	|	ТБКСменыСотрудников.Продавец КАК Продавец
	|ИЗ
	|	РегистрСведений.ТБКСменыСотрудников КАК ТБКСменыСотрудников
	|ГДЕ
	|	ТБКСменыСотрудников.КассоваяСмена.Статус = &Статус");
	//|	И ТБКСменыСотрудников.ТипПродавца = &ТипПродавца");
	Запрос.УстановитьПараметр("ТипПродавца",Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыКассовойСмены.Открыта);
	
	ОткрытыеСмены	=	Запрос.Выполнить().Выбрать();
	
	Пока ОткрытыеСмены.Следующий() цикл
		Если Элементы.Продавец.СписокВыбора.НайтиПоЗначению(ОткрытыеСмены.Продавец) = Неопределено тогда
			Элементы.Продавец.СписокВыбора.Добавить(ОткрытыеСмены.Продавец);
		КонецЕсли;
	КонецЦикла;; 
	
КонецФункции



&НаКлиенте
Процедура МагазинНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеОтбора = Новый Структура("СкладУправляющейСистемы", Ложь);
	ПараметрыФормыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Справочник.Магазины.ФормаВыбора", ПараметрыФормыВыбора, Элементы.Магазин);
	
КонецПроцедуры
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПредставлениеМесяца(Значение)
	
	Возврат Формат(Значение, "ДФ='ММММ гггг'");
	
КонецФункции

&НаСервере
Процедура ТабельЗаполнитьДанныеПоСотрудникам()
	ВыборкаДанныхОВремени = ДанныеСотрудников();
	ТабельЗаполнитьДанные(ВыборкаДанныхОВремени);
	ДанныеУТ = ЗапросКУТ();
	Если ДанныеУТ <> Неопределено Тогда
		ТабельЗаполнитьДанные(ДанныеУТ);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ТабельЗаполнитьДанные(ВыборкаДанныхОВремени)
	
	//ВыборкаДанныхОВремени = Документы.ТабельУчетаРабочегоВремени.ДанныеОВремениСотрудников(Объект, СписокСотрудников); ДанныеСотрудников()
	//ВыборкаДанныхОВремени = ДанныеСотрудников();
	
	СтрокиПоСотрудникам = Неопределено;
	
	ТекущийСотрудник = Неопределено;
	ДанныеОВремениПоСотруднику = Новый Массив;
	НомерСтрокиСотрудник = 1;
	
	ДанныеОВремениПоСотруднику = Новый ТаблицаЗначений;
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Сотрудник");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ДанныеИсточник");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ВидВремени");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дата");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дни");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Часы");
	
	Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеОВремениПоСотруднику.Очистить();
		
		Пока ВыборкаДанныхОВремени.Следующий() Цикл
			СтрокаТаблицыДанныхОВремени = ДанныеОВремениПоСотруднику.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанныхОВремени, ВыборкаДанныхОВремени);
		КонецЦикла;	
		
		Если СтрокиПоСотрудникам = Неопределено Тогда
			МассивСтрокПоСотруднику = ТабельНоваяСтрокаДанныхОВремени(ДанныеОВремени, ВыборкаДанныхОВремени.Сотрудник, НомерСтрокиСотрудник, ВыборкаДанныхОВремени.ДанныеИсточник);
		Иначе					
			МассивСтрокПоСотруднику = СтрокиПоСотрудникам[ВыборкаДанныхОВремени.Сотрудник];
		КонецЕсли;	
		
		ТабельЗаполнитьСтрокиПоСотруднику(
		ДанныеОВремениПоСотруднику, 
		МассивСтрокПоСотруднику);
		
		НомерСтрокиСотрудник = НомерСтрокиСотрудник + 1;	
		
	КонецЦикла;	
	
	//ТабельЗаполнитьИтогиПоСотрудникамДокумента();
	//УстановитьУсловноеОформление();
	
КонецПроцедуры

Функция ДанныеСотрудников()
	
	
	Запрос = Новый Запрос;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("Продавец", Продавец);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Дата));
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Сотрудник,
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ВремяСмены КАК Часы,
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин КАК Магазин,
	|	Значение(Перечисление.ВидыИспользованияРабочегоВремени.Явка) КАК ВидВремени,
	|    ""Офис"" КАК ДанныеИсточник
	|ИЗ
	|	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
	|ГДЕ
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
	|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НЕ ТБК_ВедомостьОПродажахЗаДеньПродавцы.ПродавецНаЗамену
	|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец = &Продавец
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата, ДЕНЬ),
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец,
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ВремяСмены,
	|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата,
	|	ВидВремени";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции // ДанныеСотрудников()


&НаСервере
Процедура УстановитьУсловноеОформление()
	// Очищаем существующее условное оформление
	УсловноеОформление.Элементы.Очистить();
	
	// Получаем таблицу значений с формы
	//ТаблицаЗначений = ДанныеОВремени;
	
	ТаблицаЗначений = РеквизитФормыВЗначение("ДанныеОВремени");
	
	// Проверяем, что в таблице есть минимум 2 строки для сравнения
	Если ТаблицаЗначений.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	// Берем первую и вторую строку для сравнения
	Строка1 = ТаблицаЗначений[0];
	Строка2 = ТаблицаЗначений[1];
	
	// Перебираем все колонки от время1 до время30
	Для НомерКолонки = 3 По ТаблицаЗначений.Колонки.Количество() - 5 Цикл
		ИмяКолонки = "время" + Формат(НомерКолонки, "ЧГ=");
		
		// Получаем значения из обеих строк для текущей колонки
		Значение1 = Строка1[ИмяКолонки];
		Значение2 = Строка2[ИмяКолонки];
		
		// Если значения различаются — создаем правило оформления
		Если Значение1 <> Значение2 Тогда
			
			// Создаем новый элемент условного оформления
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			// Указываем, какую колонку оформлять
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			Поле = Элементы.Найти("ДанныеОВремени" + ИмяКолонки);
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт("Arial", 10, Истина));
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Лосось);
			
			// отбор для оформления по условию
			ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Истина");
			ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
			ЭлементУсловия.ПравоеЗначение = 500;
			ЭлементУсловия.Использование  = Истина;
			// что оформляем
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Поле.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТабельПредставлениеВремениПоВиду( КоличествоЧасов) Экспорт 
	
	Если КоличествоЧасов <> 0 Тогда
		Возврат Формат(КоличествоЧасов, "ЧГ=");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ТабельЗаполнитьСтрокиПоСотруднику(ДанныеОВремениПоСотруднику, МассивСтрокПоСотруднику)
	
	ОбрабатываемаяДата = '00010101';	
	
	Для Каждого СтрокаДанныхОВремени Из ДанныеОВремениПоСотруднику Цикл
		
		Если СтрокаДанныхОВремени.Дата <> ОбрабатываемаяДата Тогда 
			НомерДня = День(СтрокаДанныхОВремени.Дата);	
			НомерВидаВремениНаДату = 1;
		Иначе
			НомерВидаВремениНаДату = НомерВидаВремениНаДату + 1;
		КонецЕсли;
		
		Если НомерВидаВремениНаДату > МассивСтрокПоСотруднику.Количество() Тогда
			СтрокаТабеля = ТабельНоваяСтрокаПоСотруднику(ДанныеОВремени, МассивСтрокПоСотруднику[0]);	
			МассивСтрокПоСотруднику.Добавить(СтрокаТабеля);
		Иначе
			СтрокаТабеля = МассивСтрокПоСотруднику[НомерВидаВремениНаДату - 1];		
		КонецЕсли;	
		
		//СтрокаТабеля["ВидВремени" + НомерДня] = СтрокаДанныхОВремени.ВидВремени;
		//СтрокаТабеля["Часов" + НомерДня] = СтрокаДанныхОВремени.Часы;
		//БуквенноеОбозначение = Лев(Строка(СтрокаДанныхОВремени.ВидВремени),1);
		
		СтрокаТабеля["Время" + НомерДня] = ТабельПредставлениеВремениПоВиду(СтрокаДанныхОВремени.Часы);  
		
		ОбрабатываемаяДата = СтрокаДанныхОВремени.Дата;
		
	КонецЦикла;	
	
	КоличествоСтрокПоСотруднику = МассивСтрокПоСотруднику.Количество();
	
	Сотрудник = МассивСтрокПоСотруднику[0].Сотрудник;
	
	Для Каждого СтрокаПоСотруднику Из МассивСтрокПоСотруднику Цикл
		СтрокаПоСотруднику.Сотрудник = Сотрудник;		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ТабельНоваяСтрокаДанныхОВремени(ДанныеОВремени, Сотрудник, НомерСтрокиСотрудник, Источник)
	СтрокиПоСотруднику = Новый Массив;
	
	НоваяСтрока = ДанныеОВремени.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
	НоваяСтрока.НомерСтрокиСотрудник = НомерСтрокиСотрудник;
	НоваяСтрока.ДанныеИсточник = Источник;
	
	СтрокиПоСотруднику.Добавить(НоваяСтрока);
	
	//ВтораяНоваяСтрока = ДанныеОВремени.Добавить();
	//ВтораяНоваяСтрока.Сотрудник = Сотрудник;
	//ВтораяНоваяСтрока.НомерСтрокиСотрудник = НомерСтрокиСотрудник;
	//
	//СтрокиПоСотруднику.Добавить(ВтораяНоваяСтрока);
	
	Возврат СтрокиПоСотруднику;
КонецФункции

&НаСервере
Функция ТабельНоваяСтрокаПоСотруднику(ДанныеОВремени, ГоловнаяСтрокаПоСотруднику) Экспорт 
	
	ИндексГоловнойСтроки = ДанныеОВремени.Индекс(ГоловнаяСтрокаПоСотруднику);
	
	ОбщееКоличествоСтрок = ДанныеОВремени.Количество();
	
	СтруктураПоиска = Новый Структура("НомерСтрокиСотрудник", ГоловнаяСтрокаПоСотруднику.НомерСтрокиСотрудник + 1);
	
	СтрокиСледующегоСотрудника = ДанныеОВремени.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиСледующегоСотрудника.Количество() > 0 Тогда
		ИндексДобавляемойСтроки = ДанныеОВремени.Индекс(СтрокиСледующегоСотрудника[0]); 
		НоваяСтрока = ДанныеОВремени.Вставить(ИндексДобавляемойСтроки);
	Иначе
		НоваяСтрока = ДанныеОВремени.Добавить();
	КонецЕсли;
	
	НоваяСтрока.НомерСтрокиСотрудник = ГоловнаяСтрокаПоСотруднику.НомерСтрокиСотрудник;
	НоваяСтрока.Сотрудник = ГоловнаяСтрокаПоСотруднику.Сотрудник;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура МагазинОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Магазин = ВыбранноеЗначение;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СоответствиеОписаниеВидовВремени = Новый Соответствие;
	// Для получения значения по буквенному обозначению.
	СоответствиеОписаниеВидовВремени.Вставить(НСтр("ru = 'Я'"),
	ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Явка"));
	СоответствиеОписаниеВидовВремени.Вставить(НСтр("ru = 'Б'"),
	ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Больничный"));
	СоответствиеОписаниеВидовВремени.Вставить(НСтр("ru = 'Н'"),
	ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.НочныеЧасы"));
	СоответствиеОписаниеВидовВремени.Вставить(НСтр("ru = 'О'"),
	ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Отпуск"));
	
	// Для получения буквенного обозначения по значению.
	СоответствиеОписаниеВидовВремени.Вставить(ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Явка"),
	НСтр("ru = 'Я'"));
	СоответствиеОписаниеВидовВремени.Вставить(ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Больничный"),
	НСтр("ru = 'Б'"));
	СоответствиеОписаниеВидовВремени.Вставить(ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.НочныеЧасы"),
	НСтр("ru = 'Н'"));
	СоответствиеОписаниеВидовВремени.Вставить(ПредопределенноеЗначение("Перечисление.ВидыИспользованияРабочегоВремени.Отпуск"),
	НСтр("ru = 'О'"));
	
	ОписаниеВидовВремени = Новый ФиксированноеСоответствие(СоответствиеОписаниеВидовВремени);
	
	//МесяцРегистрацииСтрокой = ПолучитьПредставлениеМесяца(ПериодРегистрации);
	
	//ТабельУстановитьВидимостьКолонокДнейПериода();
	
	ОформитьПоляТаблицыДнейМесяца(Элементы, НачалоМесяца(Дата), "ДанныеОВремениВремя%1");
	
КонецПроцедуры

// а
Процедура ОформитьПоляТаблицыДнейМесяца(ЭлементыФормы, Месяц, ШаблонИмениПоля) Экспорт
	
	ЦветРабочегоДня = ЦветаСтиля.ЦветТекстаФормы;
	ЦветВыходногоДня = ЦветаСтиля.ЦветОсобогоТекста;
	
	ПоследнийДеньМесяца = День(КонецМесяца(Месяц));
	
	Для НомерДня = 1 По ПоследнийДеньМесяца Цикл
		
		ТекущийДень = Дата(Год(Месяц), Месяц(Месяц), НомерДня);
		
		ДеньНедели = ДеньНедели(ТекущийДень);
		
		Элемент = ЭлементыФормы[СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениПоля, НомерДня)];
		Элемент.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1%2%3", НомерДня, Символы.ПС, Формат(ТекущийДень, "ДФ=ддд"));
		Элемент.ЦветТекстаЗаголовка = ?(ДеньНедели = 6 Или ДеньНедели = 7, ЦветВыходногоДня, ЦветРабочегоДня);
		
	КонецЦикла;		
КонецПроцедуры	

// а
&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	ПериодРегистрации = НачалоМесяца(Дата);
	Дата = НачалоМесяца(Дата);
	ПриЧтенииСозданииНаСервере();
	ТабельЗаполнитьДанныеПоСотрудникам();
КонецПроцедуры

// а
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДанныеОВремени.Очистить();
	ДатаПриИзмененииНаСервере();
	УстановитьУсловноеОформление();
КонецПроцедуры
#КонецОбласти


&НаСервере
Функция ЗапросКУТ()
	
	ДанныеУТ	=	Новый ТаблицаЗначений;
	ДанныеУТ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ДанныеУТ.Колонки.Добавить("Часы", Новый ОписаниеТипов("Число"));
	
	Если Адрес_ВебСоединение  = "" тогда
		Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
		
		Массив	=	новый Массив;
		Массив.Добавить(Прокси);
		
		Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
	иначе
		
		Попытка
			Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
			Прокси	=	Массив[0]; 
			
			Если Прокси = Неопределено тогда//повторное подключение
				Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User_tbk", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
				
				Массив	=	новый Массив;    					
				Массив.Добавить(Прокси);
				
				Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
				
			КонецЕсли;
		Исключение
			Сообщить("Не удалось подключиться к УТ. Попробуйте выполнить действие позже.");
			Возврат Неопределено; 
		КонецПопытки;
		
	КонецЕсли;
	
	
	Если Прокси <> Неопределено тогда
		
		НужСклад	= СокрЛП(Строка(ОбщегоНазначения.ПолучитьСкладИзООРП()));
		
		Структура = Новый Структура;
		
		Структура.Вставить("ДатаНач",Строка(НачалоМесяца(Дата)));
		Структура.Вставить("ДатаКон",Строка(КонецМесяца(Дата)));
		
		Структура.Вставить("Продавец", 	            Строка(Продавец));
		Структура.Вставить("Магазин", 	            Строка(НужСклад)); 
		
		JS = ОбщегоНазначения.СтруктураВjson_Общая(Структура);
		
		//1. Проставляем замены
		Ответ	=	Прокси.get_sverkatabel(JS);
		Если ЗначениеЗаполнено(Ответ) тогда
			Если не Найти(Ответ,"Внимание!") тогда 
				
				ОтветМассив	=	ОбщегоНазначения.jsonВСтруктура_Общая(Ответ);//В массив
				ТаблицаЗначений = ИнтеграцияИС.МассивВТаблицуЗначений(ОтветМассив);
				НомСч	=	0;
				
				Для каждого СтрокаМассива из ОтветМассив цикл //добавляем
					
					СтрокаДанныеУТ = ДанныеУТ.Добавить();
					СтрокаДанныеУТ.Дата = Дата(СтрокаМассива.День);
					СтрокаДанныеУТ.Часы = Число(СтрокаМассива.Часы);
				КонецЦикла; 
			иначе
				Сообщить(Ответ); 				
			КонецЕсли;
		КонецЕсли;
	иначе
		Сообщить("Не удалось получить данные. Попоробуйте позже");
		
	КонецЕсли;
	
	Если ДанныеУТ.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеУТ.Дата КАК Дата,
		|	ДанныеУТ.Часы КАК Часы,
		|	&Магазин КАК Магазин,
		|	&Сотрудник КАК Сотрудник,
		|	&ВидВремени КАК ВидВремени,
		|	""Магазин"" КАК ДанныеИсточник
		|ПОМЕСТИТЬ вт_
		|ИЗ
		|	&ДанныеУТ КАК ДанныеУТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_.Дата КАК Дата,
		|	вт_.Часы КАК Часы,
		|	вт_.Магазин КАК Магазин,
		|	вт_.Сотрудник КАК Сотрудник,
		|	вт_.ВидВремени КАК ВидВремени,
		|	вт_.ДанныеИсточник КАК ДанныеИсточник
		|ИЗ
		|	вт_ КАК вт_
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Дата,
		|	ВидВремени";
		
		Запрос.УстановитьПараметр("ВидВремени", Перечисления.ВидыИспользованияРабочегоВремени.Явка);
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Запрос.УстановитьПараметр("Сотрудник", Продавец);
		Запрос.УстановитьПараметр("ДанныеУТ", ДанныеУТ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Возврат Выборка; 
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Дата = ПолучитьЗначениеИзСоответствия(МесяцРегистрацииСтрокой);
	
	ДатаПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеИзСоответствия(Ключ)
	
	СоответствияМесяц = Новый Соответствие;
	
	ТекДата = ТекущаяДата();
	
	Для НомерМесяца = 0 По 3 Цикл
		ДатаМесяца = ДобавитьМесяц(ТекДата, -НомерМесяца);
		// Получаем первый день месяца
		ПервыйДень = НачалоМесяца(ДатаМесяца);
		
		ИмяМесяца = Формат(ПервыйДень, "ДФ=MMMM");
		Год = Формат(ПервыйДень, "ДФ=yyyy");
		
		Месяц = ИмяМесяца + " " + Год;
		
		СоответствияМесяц.Вставить(Месяц, ПервыйДень);
	КонецЦикла;
	
	Возврат СоответствияМесяц[Ключ];
КонецФункции

&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	ДанныеОВремени.Очистить();
	ДатаПриИзмененииНаСервере();
	УстановитьУсловноеОформление();
КонецПроцедуры
