
&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	// Вставить содержимое обработчика.
	
	марки = Новый Массив();
	марки.Добавить(ЭтаФорма.Марка);
	сведенияМарок = Обработки.ТБК_Маркировка.ПолучитьСведенияМарок(марки);
	Если ТипЗнч(сведенияМарок) = Тип("Массив") Тогда
		Если сведенияМарок.Количество() = 1 Тогда
			сведения = сведенияМарок[0];
			
			ЭтаФорма.Владелец = сведения.cisInfo.ownerName;
			ЭтаФорма.ИНН = сведения.cisInfo.ownerInn;
			
			//"EMITTED" : "Эмитирован. Выпущен",
			//"APPLIED" : "Эмитирован. Получен",
			//"INTRODUCED" : "В обороте",
			//"WRITTEN_OFF" : "Списан",
			//"RETIRED" : "Выбыл",
			//"WITHDRAWN" : "Выбыл",
			//"INTRODUCED_RETURNED" : "Возвращён в оборот",
			//"DISAGGREGATION" : "Расформирован",
			//"DISAGGREGATED" : "Расформирован",			
			ЭтаФорма.Статус = сведения.cisInfo.status; 			
			
			
			ЭтаФорма.Товар = сведения.cisInfo.productName;
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ОтветСервиса = ТБК_WS.СтруктураВjson(сведенияМарок);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросНаСервере();
КонецПроцедуры
