
&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	КонстантаДоступнаНефискальнаяПечать	=	ОбщегоНазначения.ПолучитьЗначениеТБККонстанты("ДоступнаНефискальнаяПечать");
	Если КонстантаДоступнаНефискальнаяПечать <> Неопределено тогда
		ДоступнаНефискальнаяПечать =   КонстантаДоступнаНефискальнаяПечать;
	КонецЕсли;
	
	КонстантаЧасНачалаНефискальнаяПечать	=	ОбщегоНазначения.ПолучитьЗначениеТБККонстанты("ЧасНачалаНефискальнаяПечать");
	Если КонстантаЧасНачалаНефискальнаяПечать <> Неопределено тогда
		ЧасНачалаНефискальнаяПечать =   КонстантаЧасНачалаНефискальнаяПечать;
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Процедура ТБКПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Рег = РегистрыСведений.ТБК_Константы.СоздатьНаборЗаписей();
	Рег.Отбор.ИмяКонстанты.Установить("ДоступнаНефискальнаяПечать");
	НоваяСтр	=	Рег.Добавить();
	НоваяСтр.ЗначениеКонстанты	=	ДоступнаНефискальнаяПечать;
	НоваяСтр.ИмяКонстанты		=	"ДоступнаНефискальнаяПечать";
	рег.Записать();	
	
	Если ЧасНачалаНефискальнаяПечать >0 тогда
		Рег = РегистрыСведений.ТБК_Константы.СоздатьНаборЗаписей();
		Рег.Отбор.ИмяКонстанты.Установить("ЧасНачалаНефискальнаяПечать");
		НоваяСтр	=	Рег.Добавить();
		НоваяСтр.ЗначениеКонстанты	=	ЧасНачалаНефискальнаяПечать;
		НоваяСтр.ИмяКонстанты		=	"ЧасНачалаНефискальнаяПечать";
		рег.Записать();
	КонецЕсли;
КонецПроцедуры
