&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Подарки = Параметры.СЗПодарки;
	

	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВладелецФормы.Подарок = Элементы.ПодаркиЗначение.Родитель.ТекущиеДанные.Значение;
	ЭтаФорма.Закрыть();  
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(ВладелецФормы.Подарок) тогда
		Отказ	=	Истина;
		Сообщить("Выберите подарок!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодаркиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВладелецФормы.Подарок = Элементы.ПодаркиЗначение.Родитель.ТекущиеДанные.Значение;
	ЭтаФорма.Закрыть();  
КонецПроцедуры
