Функция ЧисткаДублейХарактеристик() ЭКСПОРТ
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника,
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника) КАК УникальныйИдентификаторПриемника
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	      	 	             |ГДЕ
	      	 	             |	СоответствияОбъектовИнформационныхБаз.ТипИсточника = &ТипИсточника
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Итог.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог
	      	 	             |ГДЕ
	      	 	             |	Итог.УникальныйИдентификаторПриемника > 1");
	Запрос.УстановитьПараметр("ТипИсточника","СправочникСсылка.ХарактеристикиНоменклатуры");
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Рез цикл
		НЗ = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьНаборЗаписей();
		НЗ.Отбор.УникальныйИдентификаторИсточника.Установить(Строка.УникальныйИдентификаторИсточника);
		Попытка
			НЗ.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла; 	
КонецФункции
