
&Вместо("ПроверитьНастройкиКлиентаЛицензирования")
Функция ТБКПроверитьНастройкиКлиентаЛицензирования()
	// Вставить содержимое метода.
	//Коммент Вик 2025-03-04 Отключение проверки лицензирования.  
    Возврат истина;
	
	//Результат = ПродолжитьВызов();
	//Возврат Результат;
КонецФункции

&Вместо("ПередЗапускомПрограммы")
Процедура ТБКПередЗапускомПрограммы()  
	//Коммент Вик 2025-03-04 Отключение проверки лицензирования.  
	//// Вставить содержимое метода.
	//ПродолжитьВызов();
КонецПроцедуры
