
// Толстоухов 23.12.2025 ROZ-8 ++ 
// при оплате и при возврате оплаты картой, чтобы автоматически нажималась кнопка "Ок"
// КомандаEnter(Неопределено)

&НаКлиенте
&Вместо("ЗавершитьОплатуПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение")
Процедура ТБКЗавершитьОплатуПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение(РезультатВыполнения, ПараметрДействия)
	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
			
		ПараметрДействия.ДанныеКарты         = РезультатВыполнения.НомерКарты;
		ПараметрДействия.НомерСсылкиОперации = РезультатВыполнения.СсылочныйНомер;
		ПараметрДействия.НомерЧекаЭТ         = РезультатВыполнения.НомерЧекаЭТ;
		ЗавершитьОплатуПлатежнойКартойЧерезЭквайринговыйТерминалОкончание(ПараметрДействия);
		КомандаEnter(Неопределено); // Толстоухов
	Иначе
		ЗаголовокИнформации = НСтр("ru = 'При выполнении операции возникла ошибка:'"); 
		ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%"".
								  |Оплата по карте не была произведена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
			ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстСообщения);
		ПриЗавершенииОплатуПлатежнойКартойЧерезЭквайринговыйТерминал(ПараметрДействия);
	КонецЕсли;
	
	ВыводИнформацииНаДисплейПокупателя(РезультатВыполнения.Результат);

КонецПроцедуры

&НаКлиенте
&Вместо("ЗавершитьВозвратПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение")
Процедура ТБКЗавершитьВозвратПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение(РезультатВыполнения, ПараметрДействия)
		
	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ПараметрДействия.ДанныеКарты         = РезультатВыполнения.НомерКарты;
		ПараметрДействия.НомерСсылкиОперации = РезультатВыполнения.СсылочныйНомер;
		ПараметрДействия.НомерЧекаЭТ         = РезультатВыполнения.НомерЧекаЭТ;
		ЗавершитьВозвратПлатежнойКартойЧерезЭквайринговыйТерминалОкончание(ПараметрДействия);
		КомандаEnter(Неопределено); // Толстоухов
	Иначе
		ЗаголовокИнформации = НСтр("ru = 'При выполнении операции возникла ошибка:'"); 
		ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%"".
								  |Оплата по карте не была произведена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
			ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ТекстСообщения);
		ПриЗавершенииОплатуПлатежнойКартойЧерезЭквайринговыйТерминал(ПараметрДействия);
	КонецЕсли;

	ВыводИнформацииНаДисплейПокупателя(РезультатВыполнения.Результат);

КонецПроцедуры

&НаКлиенте
&Вместо("СторноОплатыПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение")
Процедура ТБКСторноОплатыПлатежнойКартойЧерезЭквайринговыйТерминалЗавершение(РезультатВыполнения, ПараметрДействия)
	
	ЭтаФорма.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда                 
		
		Если ПараметрДействия.Свойство("ЗавершитьУдалениеСтроки") Тогда
			ЗавершитьУдалениеСтроки(ПараметрДействия)
		КонецЕсли;
	
		Если ПараметрДействия.Свойство("ЗавершитьОбработкуВыбораПлатежнойКарты") Тогда
			ЗавершитьОбработкуВыбораПлатежнойКарты(ПараметрДействия);
			ПересчитатьЗначенияСуммДляПодарочныхСертификатов();
			КомандаEnter(Неопределено); // Толстоухов
		КонецЕсли;
	
		ИндексВМассивеСтрокВыбранныхОплат = Неопределено;
		Если ПараметрДействия.Свойство("УдалитьСтрокуИзМассива", ИндексВМассивеСтрокВыбранныхОплат) Тогда
			ПараметрДействия.СтрокиВыбранныхОплат.Удалить(ИндексВМассивеСтрокВыбранныхОплат)
		КонецЕсли;
	
	Иначе                    
		ТекстОписаниеОшибки = РезультатВыполнения.ОписаниеОшибки;
		ПараметрДействия.ТекстОписаниеОшибки = ТекстОписаниеОшибки;
	КонецЕсли;

	ВыводИнформацииНаДисплейПокупателя(РезультатВыполнения.Результат);
	
	Если ПараметрДействия.ОповещениеПриЗавершении <> Неопределено Тогда
		ПараметрДействия.Результат = РезультатВыполнения.Результат; 
		ВыполнитьОбработкуОповещения(ПараметрДействия.ОповещениеПриЗавершении, ПараметрДействия);
	КонецЕсли;
	
КонецПроцедуры
