Процедура ПодключитьОтключить (Устройство)
	ПараметрыККТ = Устройство.Параметры;
	
	ПараметрыПодключения = Новый Структура();
	ПараметрыПодключения.Вставить("ПараметрыРегистрации",Устройство.ПараметрыРегистрации);
	ПараметрыПодключения.Вставить("ТипОборудования","ККТ");
	
	//Подключаем
	ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство);
	
	ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(Устройство.ОбработчикДрайвера, Не Устройство.ВСоставеКонфигурации, Устройство.ТипОборудованияИмя);
	
	ВыходныеПараметры = Неопределено;
	
	Результат = ОбработчикДрайвераМодуль.ПодключитьУстройство(ОбъектДрайвера, ПараметрыККТ, ПараметрыПодключения, ВыходныеПараметры);
	Если Результат тогда
		//Отключение
		ВыходныеПараметры = Неопределено;
		Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ОбъектДрайвера, ПараметрыККТ, ПараметрыПодключения, ВыходныеПараметры);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПоменятьПараметры(Признак = Истина) экспорт
	
	СписокУстройств = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам();
	
	ТипККТ =  ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ");
	
	Для каждого Строка из СписокУстройств цикл
		Если Строка.ТипОборудования = ТипККТ тогда
			Попытка	
				ПараметрыККТ = Строка.Параметры;
				ПараметрыККТ.P_DisconnectIfEOT = Признак;
				
				ПодключитьОтключить(Строка); 
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСуммуККТ() экспорт
	СуммаККТ = МенеджерОборудованияКлиентСервер.ПолучитьСуммуККТ_Сервер();
	
	Если СуммаККТ = Неопределено тогда
		ПоменятьПараметры(Истина);
		СуммаККТ = МенеджерОборудованияКлиентСервер.ПолучитьСуммуККТ_Сервер();
		
		Если СуммаККТ = Неопределено тогда //не удалось освободить порт
			Возврат Неопределено;
		иначе
			ПоменятьПараметры(Ложь);
			Возврат СуммаККТ;
		КонецЕсли; 
	
	КонецЕсли; 	
КонецФункции

