
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗапроса = ИнтеграцияЕГАИСКлиентСервер.ПараметрыЗапросаКлассификатора();
	ПараметрыЗапроса.ИНН = ИННОрганизации(ПараметрКоманды);
	
	РезультатОперации = ИнтеграцияЕГАИСКлиент.СформироватьЗапросАлкогольнойПродукции(ПараметрыЗапроса);
	
	Если НЕ РезультатОперации.Результат Тогда
		Возврат;
	Иначе
		Предупреждение(НСтр("ru = 'Запрос на загрузку классификатора сформирован.'"), 10);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ИННОрганизации(Организация)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторОрганизацийЕГАИС.ИНН
	|ИЗ
	|	Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|ГДЕ
	|	КлассификаторОрганизацийЕГАИС.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ИНН;

КонецФункции