Функция ЗаписатьЛог(Событие, Сообщение) ЭКСПОРТ
	
	//Инициализация переменных
    ИмяСервераSQL = "DBSERV3";
    ПользовательSQL = "logger";
    ПарольSQL = "123456";
    БазаДанныхSQL = "logger_service";
    ТаблицаSQL = "Log";
	
	
	/////////////////////////////////////////
    //Подключение к SQL-серверу
	Соединение  = Новый COMОбъект("ADODB.Connection");
    Команда     = Новый COMОбъект("ADODB.Command");
    Выборка     = Новый COMОбъект("ADODB.RecordSet");
    Соединение.ConnectionString =
        "driver={SQL Server};" +
        "server="+ИмяСервераSQL+";"+
        "uid="+ПользовательSQL+";"+
        "pwd="+ПарольSQL+";"+
        "database="+БазаДанныхSQL+";";
    Соединение.ConnectionTimeout = 30;
    Соединение.CommandTimeout = 600;
    //Открытие соединение
    Соединение.Open();
    Команда.ActiveConnection   = Соединение;
    //Сообщить("Успешное подключение!");
	
	текПользователь = Пользователи.ТекущийПользователь();
	
	ТекстТекущейИнструкции =
        "INSERT INTO "+ТаблицаSQL+"
        |([UserName], [Event], [Message])
        |VALUES ('"+текПользователь+"', N'"+Событие+"', '"+Сообщение+"')";
		
	Соединение.Execute(ТекстТекущейИнструкции,,128);
	
	
	Соединение.Close();
    
	
КонецФункции