
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.ДатаПоследнейИнкасации	=	ПолучитьДатуПоследнейИнкасации();  
		
		Объект.Продавец	=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца();;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПоследнейИнкасации) тогда   
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Истина;
	иначе
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Ложь;
		
		Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
	КонецЕсли;   
	
	  
	Если РольДоступна("ПолныеПрава") тогда
		Элементы.ОтправленВУТ.Видимость	=Истина;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
 	ИспользоватьПодключаемоеОборудование	= Истина;	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");

	Если ЗначениеЗаполнено(Объект.Экспедитор) тогда
		ЭтаФорма.ТолькоПросмотр	=	Истина;
	КонецЕсли;  
	
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.Экспедитор					=	""; 
		Объект.СуммаСдаваемыхНаличных		=	0; 

		Объект.Продавец		=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца(); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Отказ = Ложь;
	Если не Объект.Экспедитор.Пустая() тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Экспедитор проставлен";
		Сообщение.Поле = "Экспедитор";
		Сообщение.УстановитьДанные(Объект.Экспедитор);
		Сообщение.Сообщить(); 
		Возврат;	
	КонецЕсли;
	
	Если (Событие = "Штрихкод" Или Событие = "ПолученШтрихкод")  Тогда
		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
			ЭтотОбъект, 
			Источник, 
			Событие, 
			Данные);
			                               
		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ДанныеСоСканераСтруктура.Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСоСканераСтруктура.Штрихкод);
		ДанныеСоСканераСтруктура.Штрихкод = СокрЛ(ДанныеСоСканераСтруктура.Штрихкод);
		
		Если Найти(ДанныеСоСканераСтруктура.Штрихкод,"FL_") тогда
			
			НаименованиеКод		= Сред(ДанныеСоСканераСтруктура.Штрихкод,4);//отрезаем FL_			
			Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			
			//2024-04-03
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		= Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//отрезаем пароль
				Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			КонецЕсли;
			
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		=   Сред(ДанныеСоСканераСтруктура.Штрихкод,4);
				НаименованиеКод		=	Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//убираем пароль если это новый куар
				Объект.Экспедитор	=	ПроставитьЭкспедитора(НаименованиеКод);

				Если Объект.Экспедитор.Пустая() тогда
					Сообщить("Не найден экспедитор! " + НаименованиеКод);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Записать();
			Возврат;
		КонецЕсли;
		
	Иначе
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПоследнейИнкасацииПриИзменении(Элемент)   
	Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПроставитьЭкспедитора(НаименованиеСпр)         
	//разборНаименования
	НужНаим	=	"";
	Пока НаименованиеСпр <> "" цикл
		Если Лев(НаименованиеСпр,2) = "32" тогда
			НужНаим		=	НужНаим  + " ";	 
			НаименованиеСпр	=	Сред(НаименованиеСпр,3); 
			Продолжить;
		КонецЕсли;
		
		КодСимвола	=	Сред(НаименованиеСпр,1,4);
		НужНаим		=	НужНаим + Символ(КодСимвола);
		
		НаименованиеСпр	=	Сред(НаименованиеСпр,5);
	КонецЦикла;  
	
	Если НужНаим = "" тогда Возврат Неопределено КонецЕсли;
	
	Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию(НужНаим);	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоследнейИнкасации()
	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКИнкасация.Дата КАК Дата
	      	 	             |ИЗ
	      	 	             |	Документ.ТБКИнкасация КАК ТБКИнкасация
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБКИнкасация.ПометкаУдаления
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата УБЫВ"); 
	
	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.Дата;
	КонецЕсли;
	

КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьСуммуКСдаче(ДатаПоследнейИнкасации)  
	Если Не ЗначениеЗаполнено(ДатаПоследнейИнкасации) тогда Возврат 0 КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	ПриходныйКассовыйОрдер.Проведен
	      	 	             |	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |ОБЪЕДИНИТЬ ВСЕ
	      	 	             |
	      	 	             |ВЫБРАТЬ
	      	 	             |	-РасходныйКассовыйОрдер.СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	РасходныйКассовыйОрдер.Проведен
	      	 	             |	И РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СУММА(Итог.СуммаДокумента) КАК СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог");

	Запрос.УстановитьПараметр("ДатаКон", Началодня(ТекущаяДата())-1 );	
	Запрос.УстановитьПараметр("ДатаНач", ДатаПоследнейИнкасации);

	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.СуммаДокумента;
	КонецЕсли;
	

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Экспедитор) и ЗначениеЗаполнено(Объект.СуммаСдаваемыхНаличных) тогда	
			ЗаписатьНаСервере();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьНаСервере();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры



