
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.ДатаПоследнейИнкасации	=	ПолучитьДатуПоследнейИнкасации();  
		
		Объект.Продавец	=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца();;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПоследнейИнкасации) тогда   
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Истина;
	иначе
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Ложь;
		
		Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
	КонецЕсли;   
	
	  
	Если РольДоступна("ПолныеПрава") тогда
		Элементы.ОтправленВУТ.Видимость	=Истина;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
 	ИспользоватьПодключаемоеОборудование	= Истина;	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");

	Если ЗначениеЗаполнено(Объект.Экспедитор) тогда
		Элементы.ДатаПоследнейИнкасации.Доступность	=	Ложь;  
		Элементы.Продавец.Доступность				=	Ложь;  
		Элементы.Экспедитор.Доступность				=	Ложь;  
		Элементы.СуммаСдаваемыхНаличных.Доступность	=	Ложь;  

		Элементы.Печать.Доступность	=	Истина;
	КонецЕсли;  
	
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.Экспедитор					=	""; 
		Объект.СуммаСдаваемыхНаличных		=	0; 

		Объект.Продавец		=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца(); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Отказ = Ложь;
	Если не Объект.Экспедитор.Пустая() тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Экспедитор проставлен";
		Сообщение.Поле = "Экспедитор";
		Сообщение.УстановитьДанные(Объект.Экспедитор);
		Сообщение.Сообщить(); 
		Возврат;	
	КонецЕсли;
	
	Если (Событие = "Штрихкод" Или Событие = "ПолученШтрихкод")  Тогда
		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
			ЭтотОбъект, 
			Источник, 
			Событие, 
			Данные);
			                               
		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ДанныеСоСканераСтруктура.Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСоСканераСтруктура.Штрихкод);
		ДанныеСоСканераСтруктура.Штрихкод = СокрЛ(ДанныеСоСканераСтруктура.Штрихкод);
		
		Если Найти(ДанныеСоСканераСтруктура.Штрихкод,"FL_") тогда
			
			НаименованиеКод		= Сред(ДанныеСоСканераСтруктура.Штрихкод,4);//отрезаем FL_			
			Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			
			//2024-04-03
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		= Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//отрезаем пароль
				Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			КонецЕсли;
			
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		=   Сред(ДанныеСоСканераСтруктура.Штрихкод,4);
				НаименованиеКод		=	Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//убираем пароль если это новый куар
				Объект.Экспедитор	=	ПроставитьЭкспедитора(НаименованиеКод);

				Если Объект.Экспедитор.Пустая() тогда
					Сообщить("Не найден экспедитор! " + НаименованиеКод);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			//Записать();
			Возврат;
		КонецЕсли;
		
	Иначе
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПоследнейИнкасацииПриИзменении(Элемент)   
	Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПроставитьЭкспедитора(НаименованиеСпр)         
	//разборНаименования
	НужНаим	=	"";
	Пока НаименованиеСпр <> "" цикл
		Если Лев(НаименованиеСпр,2) = "32" тогда
			НужНаим		=	НужНаим  + " ";	 
			НаименованиеСпр	=	Сред(НаименованиеСпр,3); 
			Продолжить;
		КонецЕсли;
		
		КодСимвола	=	Сред(НаименованиеСпр,1,4);
		НужНаим		=	НужНаим + Символ(КодСимвола);
		
		НаименованиеСпр	=	Сред(НаименованиеСпр,5);
	КонецЦикла;  
	
	Если НужНаим = "" тогда Возврат Неопределено КонецЕсли;
	
	Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию(НужНаим);	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоследнейИнкасации()
	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКИнкасация.Дата КАК Дата
	      	 	             |ИЗ
	      	 	             |	Документ.ТБКИнкасация КАК ТБКИнкасация
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБКИнкасация.ПометкаУдаления
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата УБЫВ"); 
	
	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.Дата;
	КонецЕсли;
	

КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьСуммуКСдаче(ДатаПоследнейИнкасации)  
	Если Не ЗначениеЗаполнено(ДатаПоследнейИнкасации) тогда Возврат 0 КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	ПриходныйКассовыйОрдер.Проведен
	      	 	             |	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |ОБЪЕДИНИТЬ ВСЕ
	      	 	             |
	      	 	             |ВЫБРАТЬ
	      	 	             |	-РасходныйКассовыйОрдер.СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	РасходныйКассовыйОрдер.Проведен
	      	 	             |	И РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СУММА(Итог.СуммаДокумента) КАК СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог");

	Запрос.УстановитьПараметр("ДатаКон", Началодня(ТекущаяДата())-1 );	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПоследнейИнкасации));

	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.СуммаДокумента;
	КонецЕсли;
	

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Экспедитор) и ЗначениеЗаполнено(Объект.СуммаСдаваемыхНаличных) тогда	
			ЗаписатьНаСервере();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьНаСервере();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПараметрыПечати	=	новый Структура;
	ПараметрыПечати.Вставить("Дата", Объект.Дата);
	ПараметрыПечати.Вставить("ДатаПоследнейИнкасации", Объект.ДатаПоследнейИнкасации);
	ПараметрыПечати.Вставить("Комментарий", Объект.Комментарий);
	ПараметрыПечати.Вставить("Продавец", Строка(Объект.Продавец));
	ПараметрыПечати.Вставить("СуммаКСдаче", Строка(Объект.СуммаКСдаче));
	ПараметрыПечати.Вставить("СуммаСдаваемыхНаличных", Строка(Объект.СуммаСдаваемыхНаличных));
	ПараметрыПечати.Вставить("Экспедитор", Строка(Объект.Экспедитор));

	
	
	Магазин 	=	ТБКПолучитьМагазинНаСервере();
	КодМагазин	=	ПолучитьКодМагазинаСервер(Магазин); ;
	КодМагазин	=	СокрЛП(СтрЗаменить(КодМагазин, Символы.ПС,"")); 

	ПараметрыПечати.Вставить("КодМагазин",	 КодМагазин);
	ПараметрыПечати.Вставить("Магазин",		 Строка(Магазин));

	НапечататьИнкассация(ПараметрыПечати);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.Печать.Доступность	=	Истина;
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ТБКПолучитьМагазинНаСервере()
	НужныйМагазин	=	ОбщегоНазначения.ПолучитьМагазинИзООРП();
	Если не ЗначениеЗаполнено(НужныйМагазин) тогда
		//НужныйМагазин	=		ЗначениеНастроекПовтИсп.СкладПродажиПоУмолчанию();
		Запрос	=	Новый запрос("ВЫБРАТЬ
		      	 	             |	Магазины.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Справочник.Магазины КАК Магазины
		      	 	             |ГДЕ
		      	 	             |	НЕ Магазины.СкладУправляющейСистемы");
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество()>0 тогда
			Возврат рез[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НужныйМагазин;	
КонецФункции

&НаСервереБезКонтекста
Функция  ПолучитьКодМагазинаСервер(Магазин)
	Возврат Магазин.Код;
КонецФункции

 &НаСервереБезКонтекста
Функция ПолучитьТекстКупюрСервер(НачалоПериода)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	|	ТБК_ВедомостьОПродажахЗаДень.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТБК_ВедомостьОПродажахЗаДень КАК ТБК_ВедомостьОПродажахЗаДень
	|ГДЕ
	|	НЕ ТБК_ВедомостьОПродажахЗаДень.ПометкаУдаления
	|	И ТБК_ВедомостьОПродажахЗаДень.Дата МЕЖДУ &ДатаНач И &ДатаКон"); 
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(НачалоПериода));   
	
	Рез = Запрос.Выполнить().Выбрать(); 
	Текст5000	=	"";  
	Текст2000	=	"";
	
	
	Пока рез.Следующий() цикл
		
		Для каждого Строка из рез.Ссылка.Купюры5000 цикл  
			Если Текст5000 = "" тогда
				Текст5000 = СтрЗаменить(Строка(Строка.Номер),Символы.НПП,"");;
			иначе
				Текст5000	=	Текст5000 + ", "+СтрЗаменить(Строка(Строка.Номер),Символы.НПП,"");;	
			КонецЕсли;
		КонецЦикла;
		
		
		Для каждого Строка из рез.Ссылка.Купюры2000 цикл  
			Если Текст2000 = "" тогда
				Текст2000 = СтрЗаменить(Строка(Строка.Номер),Символы.НПП,"");;
			иначе
				Текст2000	=	Текст2000 + ", "+СтрЗаменить(Строка(Строка.Номер),Символы.НПП,"");;	
			КонецЕсли;
		КонецЦикла; 
		
		
		
	КонецЦикла; 
	
	СтруктураВозврата	=	Новый Структура;
	СтруктураВозврата.Вставить("Текст5000", Текст5000);	  
	СтруктураВозврата.Вставить("Текст2000", Текст2000);	
	
	Возврат СтруктураВозврата;
	
 КонецФункции
		
&НаКлиенте
Процедура НапечататьИнкассация(ПараметрыПечати) экспорт   
	
	Fptr = ПодключитьВнешнююКомпоненту("AddIn.Fptr10");
	Fptr = Новый COMобъект("AddIn.Fptr10");
	Fptr.open();

		
	Если не Fptr.isOpened() тогда
		МенеджерОборудованияКлиент.ПоменятьПараметры(Истина);
		
		Fptr = ПодключитьВнешнююКомпоненту("AddIn.Fptr10");
		Fptr = Новый COMобъект("AddIn.Fptr10");
		Fptr.open();
	КонецЕсли;    
	
	Если не Fptr.isOpened() тогда
		Сообщить("Ошибка печати!");
		Возврат;
	КонецЕсли;
	
	
	ШиринаЛенты = Fptr.getParamInt(Fptr.LIBFPTR_PARAM_RECEIPT_LINE_LENGTH);
	
	
	Fptr.beginNonfiscalDocument();
	
	
	
	Fptr.setParam(Fptr.LIBFPTR_PARAM_BARCODE, Строка(ПараметрыПечати.КодМагазин));
	Fptr.setParam(Fptr.LIBFPTR_PARAM_BARCODE_TYPE, Fptr.LIBFPTR_BT_QR);
	Fptr.setParam(Fptr.LIBFPTR_PARAM_SCALE, 5);
	Fptr.printBarcode();

	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			

	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, "Дата инкассации: " + Формат(ПараметрыПечати.Дата,"ДФ=dd.MM.yyyy"));
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, "Магазин: " + ПараметрыПечати.Магазин);
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, "Период сдачи: " + Формат(ПараметрыПечати.ДатаПоследнейИнкасации,"ДФ=dd.MM.yyyy")+" - " + Формат(ПараметрыПечати.Дата-24*60*60,"ДФ=dd.MM.yyyy")  );
	
	
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			

	ТБКНеФискальнаяПечать.ПечатьСтроки_Пробелы(Fptr, "СУММА: " + ПараметрыПечати.СуммаСдаваемыхНаличных, "", Истина, ШиринаЛенты);
	
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			

	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, "Продавец: " +  ПараметрыПечати.Продавец  );   
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, "Экспедитор: " +  ПараметрыПечати.Экспедитор  );   
	
	
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			

	КонецПериода	=	НачалоДня(ПараметрыПечати.Дата-24*60*60);
	НачалоПериода	=	НачалоДня(ПараметрыПечати.ДатаПоследнейИнкасации);
	
	Пока КонецПериода >= НачалоПериода цикл 
		СтруктураТекстКупюр = ПолучитьТекстКупюрСервер(НачалоПериода);  
		
		
		Если СтруктураТекстКупюр.Текст5000 <> "" тогда
			ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, Формат(НачалоПериода,"ДФ=dd.MM.yyyy")+" Купюры 5000: "+ СтруктураТекстКупюр.Текст5000 ); 
		КонецЕсли; 
		
		Если СтруктураТекстКупюр.Текст2000 <> "" тогда
			ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr, Формат(НачалоПериода,"ДФ=dd.MM.yyyy")+" Купюры 2000: "+ СтруктураТекстКупюр.Текст2000 ); 
		КонецЕсли;

		
		НачалоПериода = НачалоПериода + 24*60*60;
	КонецЦикла;
	
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			
	
	Если ЗначениеЗаполнено(Объект.Комментарий) тогда
		ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,"Комментарий: "+Объект.Комментарий);  
	КонецЕсли;
	
	
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			
	ТБКНеФискальнаяПечать.ПечатьСтроки(Fptr,""); 			

	//Конец
	Fptr.setParam(Fptr.LIBFPTR_PARAM_PRINT_FOOTER, false);
	Fptr.endNonfiscalDocument();
	Fptr.cut();
	
	Fptr.close();   
	МенеджерОборудованияКлиент.ПоменятьПараметры(Ложь);

	//	        
	
КонецПроцедуры
