
&Вместо("ПолучитьЗначениеСвойства")
Процедура ТБКПолучитьЗначениеСвойства(Значение, ОбъектКоллекции, ПКО, ПКС, ВходящиеДанные, Источник, ВыборкаДанных)
		Если Значение <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПКС.ПолучитьИзВходящихДанных Тогда
			
		ОбъектДляПолученияДанных = ВходящиеДанные;
		
		Если Не ПустаяСтрока(ПКС.Приемник) Тогда
		
			ИмяСвойства = ПКС.Приемник;
			
		Иначе
			
			ИмяСвойства = ПКС.ИмяПараметраДляПередачи;
			
		КонецЕсли;
		
		КодОшибки = ?(ОбъектКоллекции <> Неопределено, 67, 68);
	
	ИначеЕсли ОбъектКоллекции <> Неопределено Тогда
		
		ОбъектДляПолученияДанных = ОбъектКоллекции;
		
		Если Не ПустаяСтрока(ПКС.Источник) Тогда
			
			ИмяСвойства = ПКС.Источник;
			КодОшибки = 16;
						
		Иначе
			
			ИмяСвойства = ПКС.Приемник;
			КодОшибки = 17;
            							
		КонецЕсли;
		
	ИначеЕсли ВыборкаДанных <> Неопределено Тогда
		
		ОбъектДляПолученияДанных = ВыборкаДанных;	
		
		Если Не ПустаяСтрока(ПКС.Источник) Тогда
		
			ИмяСвойства = ПКС.Источник;
			КодОшибки = 13;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
						
	Иначе
		
		ОбъектДляПолученияДанных = Источник;
		
		Если Не ПустаяСтрока(ПКС.Источник) Тогда
		
			ИмяСвойства = ПКС.Источник;
			КодОшибки = 13;
		
		Иначе
			
			ИмяСвойства = ПКС.Приемник;
			КодОшибки = 14;
		
		КонецЕсли;
			
	КонецЕсли;
	
	//Вик 2022-08-06
	флНадо	=	Ложь;
	Попытка
		Если  ПКО.Имя	=	"ВозвратТоваровОтПокупателя" и ИмяСвойства = "КоличествоУпаковок" тогда
			флНадо	=Истина;
		КонецЕсли;
	Исключение
	КонецПопытки; 
	
	Если флНадо тогда
		Если  ОбъектДляПолученияДанных.Упаковка.Коэффициент >0 тогда
			Значение	=	ОбъектДляПолученияДанных.Количество/ОбъектДляПолученияДанных.Упаковка.Коэффициент ;
			Возврат;
		ИначеЕсли ОбъектДляПолученияДанных.Коэффициент >0 тогда
			Значение	=	ОбъектДляПолученияДанных.Количество/ОбъектДляПолученияДанных.Коэффициент ;
			Возврат;  	
		иначе
			Значение	=	ОбъектДляПолученияДанных.Количество;
			Возврат;  		
		КонецЕсли; 
	КонецЕсли;
	//КонецВик
	
	
	Попытка
		 
		Значение = ОбъектДляПолученияДанных[ИмяСвойства];		
					
	Исключение
		
		Если КодОшибки <> 14 Тогда
			ЗаписатьИнформациюОбОшибкеОбработчикиПКС(КодОшибки, ОписаниеОшибки(), ПКО, ПКС, Источник, "");
		КонецЕсли;
																	
	КонецПопытки;
КонецПроцедуры
