
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КоличествоЗатяжек) Тогда
		
		Этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос =
		СтрЗаменить(этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, 
		"И ТоварыНаСкладахОстатки.Номенклатура.Наименование ПОДОБНО &НаименованиеКоличествоЗатяжек", "");
		
	КонецЕсли;
	
	
	Настройки = КомпоновщикНастроек.Настройки;
	Наименование = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Наименование"));
	Наименование.Использование = Истина;
	Наименование.Значение = "%" + Номенклатура + "%";

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НаименованиеКоличествоЗатяжек"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = "%" + КоличествоЗатяжек + "%";
КонецПроцедуры
