
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ТБК_УстановитьПараметрыКомпоновки(КомпоновщикНастроек.Настройки);

КонецПроцедуры

Процедура ТБК_УстановитьПараметрыКомпоновки(Настройки, ОтборПоШтрихкодам = Ложь, СписокНоменклатуры = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(КоличествоЗатяжек) Тогда
		
		Этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос =
			СтрЗаменить(этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос,
			"И ТоварыНаСкладахОстатки.Номенклатура.Наименование ПОДОБНО &НаименованиеКоличествоЗатяжек", "");
		
	КонецЕсли;

	Наименование = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Наименование"));
	Наименование.Использование = Истина;
	Наименование.Значение = "%" + Номенклатура + "%";

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НаименованиеКоличествоЗатяжек"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = "%" + КоличествоЗатяжек + "%";

	//Марк 2026-03-05 https://jira.tabkn.ru/browse/ROZ-23
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЕстьУсловинеНаЦену"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = НЕ ОтборПоШтрихкодам И ЕстьУсловинеНаЦену И ЗначениеЗаполнено(ЗнакУсловиня);

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Цена"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = Цена;

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЗнакСравнения"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = ЗнакУсловиня;
	//КонецМарк

	//Марк 2026-09-07 ++
	Если СписокНоменклатуры = Неопределено Тогда
		СписокНоменклатуры = Новый СписокЗначений;
	КонецЕсли;

	ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтборПоШтрихкодам"));
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение = ОтборПоШтрихкодам И СписокНоменклатуры.Количество() > 0;

	ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокНоменклатуры"));
	ЗначениеПараметра.Использование = Истина;
	ЗначениеПараметра.Значение = СписокНоменклатуры;
	//Марк 2026-09-07 --

КонецПроцедуры
