
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КоличествоЗатяжек) Тогда
		
		Этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос =
		СтрЗаменить(этотобъект.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, 
		"И ТоварыНаСкладахОстатки.Номенклатура.Наименование ПОДОБНО &НаименованиеКоличествоЗатяжек", "");
		
	КонецЕсли;
	
	
	Настройки = КомпоновщикНастроек.Настройки;
	Наименование = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Наименование"));
	Наименование.Использование = Истина;
	Наименование.Значение = "%" + Номенклатура + "%";

	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НаименованиеКоличествоЗатяжек"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = "%" + КоличествоЗатяжек + "%";
	
	//Марк 2026-03-05 https://jira.tabkn.ru/browse/ROZ-23
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЕстьУсловинеНаЦену"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = ЕстьУсловинеНаЦену И ЗначениеЗаполнено(ЗнакУсловиня);
	
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Цена"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = Цена;  
	
	НаименованиеКоличествоЗатяжек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЗнакСравнения"));
	НаименованиеКоличествоЗатяжек.Использование = Истина;
	НаименованиеКоличествоЗатяжек.Значение = ЗнакУсловиня;
	//КонецМарк
	
КонецПроцедуры
