Функция ЗапуститьФоновоеВыполнение(ТекстПроцедуры,СтруктураПараметров=Неопределено) Экспорт
    УникальныйИдентификатор = Новый УникальныйИдентификатор;
    ПараметрыВыполнения = Новый Массив;
    ПараметрыВыполнения.Добавить(ТекстПроцедуры);
    ПараметрыВыполнения.Добавить(СтруктураПараметров);
    
    ФоновыеЗадания.Выполнить("ФоновоеВыполнение.ФоноваяПроцедура",ПараметрыВыполнения,УникальныйИдентификатор);
    Возврат УникальныйИдентификатор;
КонецФункции

Процедура ФоноваяПроцедура(ТекстМодуля,ПараметрыВыполнения) Экспорт
    ПолныйТекстМодуля = "";
    Для Каждого ТекПараметр Из ПараметрыВыполнения Цикл
        ПолныйТекстМодуля = ПолныйТекстМодуля+ТекПараметр.Ключ+"=ПараметрыВыполнения."+ТекПараметр.Ключ+";"+Символы.ПС;
    КонецЦикла;
    ПолныйТекстМодуля = ПолныйТекстМодуля + ТекстМодуля;
    Выполнить(ПолныйТекстМодуля);
КонецПроцедуры  

Функция PingInternet() Экспорт 
	
	IPАдрес = "77.88.8.8"; //яндекс
	ТекстРезультата = PingIP(IPАдрес); 
	
	Если Найти(ТекстРезультата, "TTL=") Тогда
	
		Возврат Истина;
	
	Иначе
		
		IPАдрес = "8.8.8.8"; //гугл
		ТекстРезультата = PingIP(IPАдрес); 		
	
		Если Найти(ТекстРезультата, "TTL=") Тогда	
			Возврат Истина; 	
		Иначе 	
			Возврат Ложь	
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции 

Функция PingIP(IPАдрес)
	
	objShell = Новый COMОбъект("WScript.Shell");
	tempFile = ПолучитьИмяВременногоФайла();
	command  = "cmd /c ping.exe -n 1 " + IPАдрес + " > """ + tempFile + """";
	objShell.Run(command, 0, True);  
	
	ТекстРезультата = ""; 

	Попытка
		
		ЧтениеТекста = Новый ЧтениеТекста(tempFile, КодировкаТекста.OEM);
		ТекстРезультата = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();  
				
	Исключение
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(tempFile);
	Исключение
	КонецПопытки;
	
	Возврат ТекстРезультата;

КонецФункции // ()

