
&Вместо("ОткрытьФормуСчитыванияКодаМаркировки")
Процедура ТБКОткрытьФормуСчитыванияКодаМаркировки(ФормаВладелец, ПараметрыОткрытия, ОповещениеОЗавершении)
	
	Если ПараметрыОткрытия.МаркируемаяПродукция <> Истина Тогда
		
		ПоказатьПредупреждение(
			Неопределено, НСтр("ru = 'Для данной строки не указываются акцизные марки'"));
		
		Возврат;
	КонецЕсли;
	
	Если ОповещениеОЗавершении = Неопределено Тогда
		//@skip-warning поведение по-умолчанию если обработчик не указан
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ФормаВладелец);
	КонецЕсли;
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ПараметрыОткрытия.ВидПродукции)
		И ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетАлкогольнаяПродукция(
		ПараметрыОткрытия.ПараметрыСканирования.ДопустимыеВидыПродукции,
		ПараметрыОткрытия.ПараметрыСканирования) Тогда
		
		ОткрытьФорму(
		"Обработка.РаботаСАкцизнымиМаркамиЕГАИС.Форма.ФормаВводаАкцизнойМарки",
		ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
		
	ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ПараметрыОткрытия.ВидПродукции, Истина)
		И ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетПродукцияИСМП(ПараметрыОткрытия.ПараметрыСканирования.ДопустимыеВидыПродукции, Истина) Тогда
		
		//Марк 2026-05-13----------------------------------------------------
		//ОткрытьФорму(
		//"Обработка.ПроверкаИПодборПродукцииИС.Форма.ФормаВводаКодаМаркировки",
		//ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
		
		//Марк 03-12-2025 https://jira.tabkn.ru/browse/ROZ-14
		НашиВидыПродкукцииСЗаменойНаБК = Новый Массив;
		НашиВидыПродкукцииСЗаменойНаБК.Добавить("Табачная продукция");
		НашиВидыПродкукцииСЗаменойНаБК.Добавить("Товары легкой промышленности и одежда 2025");
		НашиВидыПродкукцииСЗаменойНаБК.Добавить("Товары легкой промышленности и одежда");
		
		Если НашиВидыПродкукцииСЗаменойНаБК.Найти(Строка(ПараметрыОткрытия.ВидПродукции)) <> Неопределено 
			//Марк 2025-02-19 подмена проданного товара если ответил честный знак 
			или ПараметрыОткрытия.ДанныеШтрихкода.РазрешительныйРежимКодОтвета = "200" Тогда
			//КонецМарк
			
			Попытка
				
				ТекстКомментария = СтрШаблон("Лог аномалии сканирования
									|Номенклатура = %1
									|GTIN = %2", 
									Строка(ПараметрыОткрытия.Номенклатура), 
									ПараметрыОткрытия.ДанныеШтрихкода.GTIN);
				
				ОбщегоНазначенияВызовСервера._ЗаписьЖурналаРегистрации(ТекстКомментария);
				
			Исключение
			
			КонецПопытки;
			
			НоменклатураБК	=	ОбщегоНазначенияВызовСервера.ПолучитьНоменклатураБК(ПараметрыОткрытия.Номенклатура);
			Если не НоменклатураБК.Пустая() Тогда
				
				ПараметрыОткрытия.Вставить("НоменклатураБК", НоменклатураБК); 
				
				Если ПараметрыОткрытия.ДанныеШтрихкода.РазрешительныйРежимКодОтвета = "200" Тогда	
					ПараметрыОткрытия.Вставить("Комментарий", "Некорретная марка. Пробейте по бк");
				Иначе
					ПараметрыОткрытия.Вставить("Комментарий", "");	
				КонецЕсли;
				
				ОткрытьФорму(
				"Обработка.РМКУправляемыйРежим.Форма.ТБКФормаБыстрыйПодборПоБК",       
				ПараметрыОткрытия, ФормаВладелец);
				
			иначе 
				
				ОбщегоНазначенияКлиент.СообщитьПользователю("не уделось найти номенклатуру БК");
				
				ОткрытьФорму(
				"Обработка.ПроверкаИПодборПродукцииИС.Форма.ФормаВводаКодаМаркировки",
				ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
				
			КонецЕсли;
			
		иначе
			
			//Cтандартно
			ОткрытьФорму(
			"Обработка.ПроверкаИПодборПродукцииИС.Форма.ФормаВводаКодаМаркировки",
			ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
			
		КонецЕсли;
		//-------------------------------------------------------------------
		
	Иначе
		
		ТекстОшибки = ТекстОшибкиНеПоддерживаетсяВидПродукции(
		ПараметрыОткрытия.ПараметрыСканирования, ПараметрыОткрытия.ВидПродукции);
		
		ПараметрыОткрытияФормы = ПараметрыОткрытияФормыНевозможностиДобавленияОтсканированного();
		ПараметрыОткрытияФормы.ТекстОшибкиФорматированнаяСтрока = ТекстОшибки;
		ПараметрыОткрытияФормы.Штрихкод                         = ПараметрыОткрытия.ДанныеШтрихкода.Штрихкод;
		ПараметрыОткрытияФормы.ВидПродукции                     = ПараметрыОткрытия.ВидПродукции;
		ПараметрыОткрытияФормы.Организация                      = ПараметрыОткрытия.ПараметрыСканирования.Организация;
		
		ОткрытьФорму(
		"Обработка.ПроверкаИПодборПродукцииИС.Форма.ИнформацияОНевозможностиДобавленияОтсканированного",
		ПараметрыОткрытияФормы, ФормаВладелец);
		
	КонецЕсли;
			
КонецПроцедуры

&Вместо("УточнитьДанныеУПользователя")
Процедура ТБКУточнитьДанныеУПользователя(ФормаВладелец, ПараметрыОткрытияФормы, ОповещениеПоЗавершениюУточненияДанных) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения) Тогда
		
		Если ШтрихкодированиеИСКлиентСервер.ТребуетсяСброситьСохраненныйВыбор(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.ПараметрыСканирования.ДанныеВыбораПоМаркируемойПродукции,
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода) Тогда
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.ПараметрыСканирования.ДанныеВыбораПоМаркируемойПродукции = Неопределено;
			ШтрихкодированиеИСКлиентСервер.ОбработатьСохраненныйВыборДанныхПоМаркируемойПродукции(ФормаВладелец, Неопределено, Ложь);
		КонецЕсли;
		
		РезультатОбработкиШтрихкода = ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода;
		Если РезультатОбработкиШтрихкода.ОткрытьФормуВводаКодаМаркировки Тогда
			
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПреобразоватьВПараметрыОткрытияФормыВводаКодаМаркировки(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец, "Объект")
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец.Объект, "Ссылка") Тогда
				ПараметрыОткрытияФормы.Документ = ФормаВладелец.Объект.Ссылка;
			КонецЕсли;
			ПараметрыОткрытияФормы.Операция = "ОткрытьФормуВводаКодаМаркировки";
			
		Иначе
			
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя = ПреобразоватьВПараметрыОткрытияФормыУточнения(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения);
			
			Если РезультатОбработкиШтрихкода.ТребуетсяУточнениеСоставаУпаковки Тогда
				ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияУпаковки";
			ИначеЕсли РезультатОбработкиШтрихкода.ТребуетсяВскрытиеПотребительскойУпаковки
				И КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяПодключениеКОборудованиюРозлива(
					РезультатОбработкиШтрихкода.ДанныеШтрихкода.ВидПродукции) Тогда
				ПараметрыОткрытияФормы.Операция = "ПодключениеКегаКОборудованиюРозлива";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле")
				И РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле
				И Не РезультатОбработкиШтрихкода.Свойство("ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена")
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаЛокальномМодулеЧестногоЗнака";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле")
				И РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле
				И РезультатОбработкиШтрихкода.Свойство("ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена")
				И Не РезультатОбработкиШтрихкода.ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаЛокальномМодулеЧестногоЗнака";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена")
				И РезультатОбработкиШтрихкода.ПроверкаНаЛокальномМодулеЧестныйЗнакЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗавершениеПроверкиНаЛокальномМодулеЧестногоЗнака";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ")
				И РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ
				И Не РезультатОбработкиШтрихкода.Свойство("ПроверкаНаТСПИоТЗавершена")
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаТСПИоТ";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ")
				И РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ
				И РезультатОбработкиШтрихкода.Свойство("ПроверкаНаТСПИоТЗавершена")
				И Не РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаТСПИоТ";
			ИначеЕсли РезультатОбработкиШтрихкода.Свойство("ПроверкаНаТСПИоТЗавершена")
				И РезультатОбработкиШтрихкода.ПроверкаНаТСПИоТЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ЗавершениеПроверкиНаТСПИоТ";
			ИначеЕсли РезультатОбработкиШтрихкода.ТребуетсяПроверкаСредствамиККТ
				И Не РезультатОбработкиШтрихкода.ПроверкаСредствамиККТЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных
				И Не РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаЛокальномМодуле
				И Не РезультатОбработкиШтрихкода.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ Тогда
				ПараметрыОткрытияФормы.Операция = "ПроверкаКодаМаркировкиСредставамиККТ";
			Иначе
				ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияДанных";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОткрытияФормы.Операция = "ОткрытьФормуВводаКодаМаркировки" Тогда
		
		ОткрытьФормуСчитыванияКодаМаркировки(
			ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ОповещениеПоЗавершениюУточненияДанных);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "СопоставлениеНоменклатуры" Тогда
		
		ШтрихкодыКСопоставлению = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ШтрихкодыКСопоставлению;
		ИсходныеДанные          = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ИсходныеДанные;
		ПараметрыСканирования   = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
		
		ДополнительныеПараметры = Новый Структура(
			"ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования",
			ОповещениеПоЗавершениюУточненияДанных, ИсходныеДанные, ПараметрыСканирования);
			
		ОповещениеОЗавершенииСопоставления = Новый ОписаниеОповещения(
			"СопоставлениеНоменклатурыШтрихкодамЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
		
		ШтрихкодированиеИСКлиентПереопределяемый.ОткрытьФормуПодбораНоменклатурыПоШтрихкодам(
			ШтрихкодыКСопоставлению, ФормаВладелец, ОповещениеОЗавершенииСопоставления);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияДанных" Тогда
		
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения) Тогда
			ДанныеШтрихкода = ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода;
			Если ДанныеШтрихкода.ЭтоШтрихкодНоменклатуры Тогда
				ДополнитьПараметрыУточненияИзСпискаВыбораНоменклатуры(ДанныеШтрихкода.СписокНоменклатуры, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
				ДополнитьПараметрыУточненияИзФормыИсточникаПоСпискуВыбора(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ДанныеШтрихкода.СписокНоменклатуры);
			Иначе
				ДополнитьПараметрыУточненияИзСпискаВыбораНоменклатуры(ДанныеШтрихкода.СписокНоменклатуры, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
				ДополнитьПараметрыУточненияИзФормыИсточникаПоСпискуВыбора(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ДанныеШтрихкода.СписокНоменклатуры);
				ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
				ДополнитьПараметрыУточненияПолнымКодомМаркировки(ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ДанныеШтрихкода);
			КонецЕсли;
		Иначе
			ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
		КонецЕсли;
		
		ОткрытьФорму(
			"ОбщаяФорма.ФормаУточненияДанныхИС",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеПоЗавершениюУточненияДанных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияУпаковки" Тогда
		
		ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, Истина);
		
		ОткрытьФорму(
			"ОбщаяФорма.УточнениеСоставаУпаковкиИС",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеПоЗавершениюУточненияДанных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "УточнениеКоэффициентовУпаковок" Тогда
		
		ИсходныеДанные        = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ИсходныеДанные;
		ПараметрыСканирования = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
		
		ДополнительныеПараметры = Новый Структура(
			"ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования",
			ОповещениеПоЗавершениюУточненияДанных, ИсходныеДанные, ПараметрыСканирования);
		
		ОповещениеОЗавершенииСопоставления = Новый ОписаниеОповещения(
			"СопоставлениеНоменклатурыШтрихкодамЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму(
			"ОбщаяФорма.УточнениеКоэффициентовУпаковокИСМП",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеОЗавершенииСопоставления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ИначеЕсли ОбщегоНазначенияКлиент.ПодсистемаСуществует("ГосИС.ИСМП")
		И ПараметрыОткрытияФормы.Операция = "ПроверкаКодаМаркировкиСредставамиККТ" Тогда
		
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеОбщегоНазначенияИСМПКлиент");
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент.ПроверкаКодаМаркировкиСредствамиККТПоДаннымШтрихкода(
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования,
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода,
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.Форма,
			ОповещениеПоЗавершениюУточненияДанных);
	
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ПодключениеКегаКОборудованиюРозлива" Тогда
		
		ПараметрыСканирования = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
		ДанныеШтрихкода       = ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода;
		ИмяПодсистемы         = ?(КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ДанныеШтрихкода.ВидПродукции, Истина), "ИСМП", "ЕГАИС");
		
		ДополнительныеПараметрыОповещения = Новый Структура();
		ДополнительныеПараметрыОповещения.Вставить("ФормаВладелец",                         ФормаВладелец);
		ДополнительныеПараметрыОповещения.Вставить("ПараметрыОткрытияФормы",                ПараметрыОткрытияФормы);
		ДополнительныеПараметрыОповещения.Вставить("ОповещениеПоЗавершениюУточненияДанных", ОповещениеПоЗавершениюУточненияДанных);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения(
			"ПодключениеКегаКОборудованиюРозливаПриСканированииЗавершение",
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияИСМПКлиент"),
			ДополнительныеПараметрыОповещения);
		
		ПараметрыОткрытия = ОбщегоНазначенияИСКлиент.ПараметрыОткрытияФормыВскрытияПотребительскойУпаковки();
		ПараметрыОткрытия.Организация         = ПараметрыСканирования.Организация;
		ПараметрыОткрытия.ИмяПодсистемы       = ИмяПодсистемы;
		ПараметрыОткрытия.КодМаркировки       = ДанныеШтрихкода.ШтрихкодУпаковки;
		ПараметрыОткрытия.ОповещениеОЗакрытии = ОповещениеОЗакрытии;
		ПараметрыОткрытия.СохранитьПолныйКод  = Истина;
		
		ОбщегоНазначенияИСКлиент.ОткрытьФормуВскрытияПотребительскойУпаковки(ПараметрыОткрытия, ФормаВладелец);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаЛокальномМодулеЧестногоЗнака" Тогда
		
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеОбщегоНазначенияИСМПКлиент");
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент.ОбработатьАсинхронноШтрихкод(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения, ОповещениеПоЗавершениюУточненияДанных);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ЗавершениеПроверкиНаЛокальномМодулеЧестногоЗнака"
		Или ПараметрыОткрытияФормы.Операция = "ЗавершениеПроверкиНаТСПИоТ" Тогда
		
		Если Не ОповещениеПоЗавершениюУточненияДанных = Неопределено Тогда
			
			ДанныеШтрихкода       = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода);
			ВыполнитьОбработкуОповещения(ОповещениеПоЗавершениюУточненияДанных, Новый Структура("ДанныеВыбора, ЗапомнитьВыбор", ДанныеШтрихкода, Ложь));
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ЗапускПроверкиНаТСПИоТ" Тогда
		
		////Марк 2026-05-15----------------------------------------------------
		//ТБКДоПараметры = Новый Структура;
		//ТБКДоПараметры.Вставить("ФормаВладелец", ФормаВладелец);
		//ТБКДоПараметры.Вставить("ПараметрыОткрытияФормы", ПараметрыОткрытияФормы);
		//ТБКДоПараметры.Вставить("ОповещениеПоЗавершениюУточненияДанных", ОповещениеПоЗавершениюУточненияДанных);
		//
		//ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.Вставить("ТБКДоПараметры", ТБКДоПараметры); 
		////-------------------------------------------------------------------
		
		МодульОбработки = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияТСПИоТКлиент");
		МодульОбработки.ОбработатьАсинхронноШтрихкод(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения, ОповещениеПоЗавершениюУточненияДанных);
		
	КонецЕсли;
	
КонецПроцедуры
