
&Вместо("ОткрытьФормуСчитыванияКодаМаркировки")
Процедура ТБКОткрытьФормуСчитыванияКодаМаркировки(ФормаВладелец, ПараметрыОткрытия, ОповещениеОЗавершении)
	Если Не ПараметрыОткрытия.МаркируемаяПродукция Тогда
		
		ПоказатьПредупреждение(
			Неопределено, НСтр("ru = 'Для данной строки не указываются акцизные марки'"));
		
		Возврат;
	КонецЕсли;
	
	Если ОповещениеОЗавершении = Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ФормаВладелец, ОповещениеОЗавершении);
	КонецЕсли;
	
	Если ПараметрыОткрытия.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная") Тогда

		ОткрытьФорму(
			"Обработка.РаботаСАкцизнымиМаркамиЕГАИС.Форма.ФормаВводаАкцизнойМарки",
			ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
			
		ИначеЕсли ПараметрыОткрытия.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак")
			//Марк 2025-02-19 подмена проданного товара если ответил честный знак 
			или ПараметрыОткрытия.ДанныеШтрихкода.РазрешительныйРежимКодОтвета = "200"
			//КонецМарк
			Тогда
		//Марк
		НоменклатураБК	=	ОбщегоНазначенияВызовСервера.ПолучитьНоменклатураБК(ПараметрыОткрытия.Номенклатура);
		Если не НоменклатураБК.Пустая() Тогда
			
			ПараметрыОткрытия.Вставить("НоменклатураБК", НоменклатураБК); 
			
			Если ПараметрыОткрытия.ДанныеШтрихкода.РазрешительныйРежимКодОтвета = "200" Тогда	
				ПараметрыОткрытия.Вставить("Комментарий", "Некоретная марка. Пробейте по бк");
			Иначе
				ПараметрыОткрытия.Вставить("Комментарий", "");	
			КонецЕсли;
			
		    ОткрытьФорму(
			"Обработка.РМКУправляемыйРежим.Форма.ТБКФормаБыстрыйПодборПоБК",       
			ПараметрыОткрытия, ФормаВладелец);
		иначе 
		//МаркКонец	
			ОткрытьФорму(
			"Обработка.ПроверкаИПодборТабачнойПродукцииМОТП.Форма.ФормаВводаКодаМаркировки",
			ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);	
		КонецЕсли;
			
	ИначеЕсли ПараметрыОткрытия.ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Обувная") Тогда
			
		ОткрытьФорму(
			"Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ФормаВводаКодаМаркировки",
			ПараметрыОткрытия, ФормаВладелец,,,,ОповещениеОЗавершении);
			
	КонецЕсли;
	//ПродолжитьВызов(ФормаВладелец, ПараметрыОткрытия, ОповещениеОЗавершении);
КонецПроцедуры

&Вместо("УточнитьДанныеУПользователя")
Процедура ТБКУточнитьДанныеУПользователя(ФормаВладелец, ПараметрыОткрытияФормы, ОповещениеПоЗавершениюУточненияДанных)
  	Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения) Тогда
		
		Если ШтрихкодированиеИСКлиентСервер.ТребуетсяСброситьСохраненныйВыбор(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.ПараметрыСканирования.ДанныеВыбораПоМаркируемойПродукции,
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода) Тогда
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.ПараметрыСканирования.ДанныеВыбораПоМаркируемойПродукции = Неопределено;
			ШтрихкодированиеИСКлиентСервер.ОбработатьСохраненныйВыборДанныхПоМаркируемойПродукции(ФормаВладелец, Неопределено, Ложь);
		КонецЕсли;
		
		РезультатОбработкиШтрихкода = ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода;
		Если РезультатОбработкиШтрихкода.ОткрытьФормуВводаКодаМаркировки Тогда
			
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПреобразоватьВПараметрыОткрытияФормыВводаКодаМаркировки(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец, "Объект")
					И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец.Объект, "Ссылка") Тогда
				ПараметрыОткрытияФормы.Документ = ФормаВладелец.Объект.Ссылка;
			КонецЕсли;
			ПараметрыОткрытияФормы.Операция = "ОткрытьФормуВводаКодаМаркировки";
			
		Иначе
			
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя = ПреобразоватьВПараметрыОткрытияФормыУточнения(
				ПараметрыОткрытияФормы.КодМаркировкиДляУточнения);
			
			Если РезультатОбработкиШтрихкода.ТребуетсяУточнениеСоставаУпаковки Тогда
				ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияУпаковки";
			ИначеЕсли РезультатОбработкиШтрихкода.ТребуетсяПроверкаСредствамиККТ
				И Не РезультатОбработкиШтрихкода.ПроверкаСредствамиККТЗавершена
				И Не РезультатОбработкиШтрихкода.ТребуетсяУточнениеДанных Тогда
				ПараметрыОткрытияФормы.Операция = "ПроверкаКодаМаркировкиСредставамиККТ";
			Иначе
				ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияДанных";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОткрытияФормы.Операция = "ОткрытьФормуВводаКодаМаркировки" Тогда
		
		ОткрытьФормуСчитыванияКодаМаркировки(
			ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ОповещениеПоЗавершениюУточненияДанных);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "СопоставлениеНоменклатуры" Тогда
		
		ШтрихкодыКСопоставлению = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ШтрихкодыКСопоставлению;
		ИсходныеДанные          = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ИсходныеДанные;
		ПараметрыСканирования   = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
		
		ДополнительныеПараметры = Новый Структура(
			"ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования",
			ОповещениеПоЗавершениюУточненияДанных, ИсходныеДанные, ПараметрыСканирования);
			
		ОповещениеОЗавершенииСопоставления = Новый ОписаниеОповещения(
			"СопоставлениеНоменклатурыШтрихкодамЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
		
		ШтрихкодированиеИСКлиентПереопределяемый.ОткрытьФормуПодбораНоменклатурыПоШтрихкодам(
			ШтрихкодыКСопоставлению, ФормаВладелец, ОповещениеОЗавершенииСопоставления);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияДанных" Тогда
		
		Если ЗначениеЗаполнено(ПараметрыОткрытияФормы.КодМаркировкиДляУточнения) Тогда
			ДанныеШтрихкода = ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода.ДанныеШтрихкода;
			Если ДанныеШтрихкода.ЭтоШтрихкодНоменклатуры Тогда
				ДополнитьПараметрыУточненияИзСпискаВыбораНоменклатуры(ДанныеШтрихкода.СписокНоменклатуры, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
			Иначе
				ДополнитьПараметрыУточненияИзСпискаВыбораНоменклатуры(ДанныеШтрихкода.СписокНоменклатуры, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
				ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
				ДополнитьПараметрыУточненияПолнымКодомМаркировки(ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ДанныеШтрихкода);
			КонецЕсли;
		Иначе
			ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя);
		КонецЕсли;
		
		ОткрытьФорму(
			"ОбщаяФорма.ФормаУточненияДанныхИС",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеПоЗавершениюУточненияДанных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "ОткрытьФормуУточненияУпаковки" Тогда
		
		ДополнитьПараметрыУточненияИзФормыИсточника(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, Истина);
		
		ОткрытьФорму(
			"ОбщаяФорма.УточнениеСоставаУпаковкиИС",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеПоЗавершениюУточненияДанных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ПараметрыОткрытияФормы.Операция = "УточнениеКоэффициентовУпаковок" Тогда	
		
		ИсходныеДанные        = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ИсходныеДанные;
		ПараметрыСканирования = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
		
		ДополнительныеПараметры = Новый Структура(
			"ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования",
			ОповещениеПоЗавершениюУточненияДанных, ИсходныеДанные, ПараметрыСканирования);
		
		ОповещениеОЗавершенииСопоставления = Новый ОписаниеОповещения(
			"СопоставлениеНоменклатурыШтрихкодамЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму(
			"ОбщаяФорма.УточнениеКоэффициентовУпаковокИСМП",
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ФормаВладелец,,,,
			ОповещениеОЗавершенииСопоставления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ИначеЕсли ОбщегоНазначенияКлиент.ПодсистемаСуществует("ГосИС.ИСМП")
		И ПараметрыОткрытияФормы.Операция = "ПроверкаКодаМаркировкиСредставамиККТ" Тогда
		
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ШтрихкодированиеОбщегоНазначенияИСМПКлиент");
		МодульШтрихкодированиеОбщегоНазначенияИСМПКлиент.ПроверкаКодаМаркировкиСредствамиККТПоДаннымШтрихкода(
			ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования,
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.РезультатОбработкиШтрихкода,
			ПараметрыОткрытияФормы.КодМаркировкиДляУточнения.Форма,
			ОповещениеПоЗавершениюУточненияДанных);
		
	КонецЕсли;

	
	
	
	//Если ПараметрыОткрытияФормы.Операция = "СопоставлениеНоменклатуры" Тогда
	//	
	//	ШтрихкодыКСопоставлению = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ШтрихкодыКСопоставлению;
	//	ИсходныеДанные          = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ИсходныеДанные;
	//	ПараметрыСканирования   = ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя.ПараметрыСканирования;
	//	
	//	ДополнительныеПараметры = Новый Структура("ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования",
	//	ОповещениеПовторнойОбработки, ИсходныеДанные, ПараметрыСканирования);
	//	ОповещениеОЗавершенииСопоставления = Новый ОписаниеОповещения("СопоставлениеНоменклатурыШтрихкодамЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
	//	ШтрихкодированиеИСКлиентПереопределяемый.ОткрытьФормуПодбораНоменклатурыПоШтрихкодам(
	//	ШтрихкодыКСопоставлению, ФормаВладелец, ОповещениеОЗавершенииСопоставления);
	//	
	//ИначеЕсли ПараметрыОткрытияФормы.Операция = "ОткрытьФормуВводаКодаМаркировки" Тогда
	//	
	//	ОткрытьФормуСчитыванияКодаМаркировки(ФормаВладелец, ПараметрыОткрытияФормы.ДанныеДляУточненияСведенийПользователя, ОповещениеПовторнойОбработки);
	//	
	//Иначе
	//	
	//	Если СтрДлина(ПараметрыОткрытияФормы.ШтрихкодEAN) <=13 И СтрДлина(ПараметрыОткрытияФормы.ШтрихкодEAN) >= 8 
	//		И ПараметрыОткрытияФормы.Номенклатура.Количество() > 0 Тогда

	//		ПараметрыОткрытияФормы.Номенклатура = ПараметрыОткрытияФормы.Номенклатура[0];
	//		
	//		НоменклатураБК	=	ОбщегоНазначенияВызовСервера.ПолучитьНоменклатураБК(ПараметрыОткрытияФормы.Номенклатура);
	//		Если Не НоменклатураБК.Пустая() Тогда
	//			
	//			ПараметрыОткрытияФормы.Вставить("НоменклатураБК", НоменклатураБК);
	//			
	//			РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	//			ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ТБКФормаБыстрыйПодборПоБК", 
	//			ПараметрыОткрытияФормы, ФормаВладелец)
	//			
	//		КонецЕсли;
	//	Иначе
	//		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	//		ОткрытьФорму(
	//		"ОбщаяФорма.ФормаУточненияДанныхИС", ПараметрыОткрытияФормы, ФормаВладелец,,,, ОповещениеПовторнойОбработки, РежимОткрытия);
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//ПродолжитьВызов(ФормаВладелец, ПараметрыОткрытияФормы, ОповещениеПовторнойОбработки);
КонецПроцедуры
