
&После("ПередЗаписью")
Процедура ТБКПередЗаписью(Отказ)
	// Вставить содержимое метода.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Сообщить("ФЛ можно создавать только в УТ");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&Перед("ПриЗаписи")
Процедура ТБКПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	
	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.ФизЛицо КАК ФизЛицо,
	               |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо",ЭтотОбъект.Ссылка);
	
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		п = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(рез.ИдентификаторПользователяИБ);
		Если п <> неопределено Тогда
			Если ЗначениеЗаполнено(п) Тогда
				п.Пароль = Справочники.ФизическиеЛица.ГенерацияПароля(ЭтотОбъект);
				п.Записать();
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
