//Глобальная переменная
Перем Группа;


Процедура ПередЗаписью(Отказ)
		Если ЭтотОбъект.ЭтоНовый() Тогда
		Группа=ЭтотОбъект.Наименование;	
		КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Группа<>""Тогда
		Группа=Справочники.ГруппыДляПроцентов.НайтиПоНаименованию(Группа); 
		Выбор = Справочники.Склады.Выбрать();
		Пока Выбор.Следующий() Цикл
			Попытка
			Склад=Выбор.Ссылка;  
			НаборЗаписей = РегистрыСведений.ГруппыПроцентовПоМагазинам.СоздатьНаборЗаписей();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период=ТекущаяДата();
			НоваяЗапись.Группа = Группа;
			НоваяЗапись.Магазин = Склад;
			НаборЗаписей.Записать(Ложь);
		Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Группа="";