
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Количество() <> 0 Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
		ОчиститьРегистр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Запись.ОрганизацияЕГАИС.Пустая() И ПустаяСтрока(Запись.ОрганизацияЕГАИС.КПП) И СтрДлина(Запись.ОрганизацияЕГАИС.ИНН) = 10 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан КПП торгового объекта.'"), Запись.ОрганизацияЕГАИС,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОчиститьРегистр И Метаданные.РегистрыСведений.НастройкиОбменаЕГАИС.Измерения.Количество() = 0 Тогда
		НаборЗаписей = РегистрыСведений.НастройкиОбменаЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

