
//&Вместо("ЭлементКодаМаркировкиСоответствуетОписаниюМРЦ")
//Функция ТБКЭлементКодаМаркировкиСоответствуетОписаниюМРЦ(Значение, ОписаниеЭлементаКМ, ПараметрыОписанияКодаМаркировки, МРЦ)
//	Если ПараметрыОписанияКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
//		
//		МРЦ = 0;
//		
//		Для Индекс = 1 По СтрДлина(Значение) Цикл
//			Символ = Сред(Значение, Индекс, 1);
//			ИндексСимвола = СтрНайти(ОписаниеЭлементаКМ.Алфавит, Символ) - 1;
//			Если ИндексСимвола < 0 Тогда
//				Возврат Ложь;
//			КонецЕсли;
//			МРЦ = МРЦ + Pow(80, 4 - Индекс) * ИндексСимвола;
//		КонецЦикла;
//		
//		//Вик 2021_03_03
//		//Есть кривые марки в которых мрц - без копеек. поэтому: 
//		//Если МРЦ % 100 <> 0 Тогда
//		Если МРЦ < 2000 Тогда
//			МРЦ = МРЦ * 100;
//		КонецЕсли;  
//		//КонецВик
//		
//		// Если цена <= 5000 и нет копеек, то высокая вероятность, что это реальное МРЦ.
//		Если МРЦ > 500000 Или МРЦ % 100 > 0 Тогда
//			Возврат Ложь;
//		КонецЕсли;
//		
//	Иначе
//		
//		МРЦ = Число(Значение);
//		
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(МРЦ) Тогда
//		МРЦ = МРЦ / 100;
//	КонецЕсли;
//	
//	Возврат Истина;

//КонецФункции
