
&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	//Проверка заполения
	Если не ЗначениеЗаполнено(ТелефонКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните номер телефона";
		Сообщение.Поле = "ТелефонКлиента";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли не ЗначениеЗаполнено(ИмяКлиента) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните имя клиента";
		Сообщение.Поле = "ИмяКлиента";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли не ЗначениеЗаполнено(ДатаРождения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните дату рождения";
		Сообщение.Поле = "ДатаРождения";
		Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	
	Возраст	=	ВычислитьВозраст(ДатаРождения);
	
	Если Возраст <18 тогда
		Сообщить("Нельзя регистрировать клиентов меньше 18 лет!");
		Возврат;	
	КонецЕсли;  
	
	Если Найти(ТелефонКлиента, " ") или Лев(ТелефонКлиента,3) <> "+79" или СтрДлина(ТелефонКлиента) <> 12  тогда
		Сообщить("Неверно указан номер!");
		Возврат;		
	КонецЕсли;
	
	ЗапрещенныеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ!№;%:?*()@#$^&*";
	
	Для Ном = 1 по СтрДлина(ЗапрещенныеСимволы) цикл
		Если Найти(ИмяКлиента,Сред(ЗапрещенныеСимволы,Ном,1))  тогда
			Сообщить("В имени клиента присутствуют запрещенные символы!");
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	Если Найти(ИмяКлиента,Символ(34))  тогда //кавычка
		Сообщить("В имени клиента присутствуют запрещенные символы!");
		Возврат;
	КонецЕсли; 
	
	ЗарегистрироватьНаСервере();
	Закрыть();
КонецПроцедуры



&НаКлиенте
Процедура ТелефонКлиентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если текст = "" тогда
		ЭтаФорма.ТекущийЭлемент.УстановитьГраницыВыделения(3,3);
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьНаСервере()
	
	Магазин = ОбщегоНазначения.ПолучитьМагазин();
	рег = РегистрыСведений.ТБКРегистрацияКлиентов.СоздатьМенеджерЗаписи();
	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение("app.samosale.ru",443,,,,,ssl);
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Authorization", "Bearer " + Магазин.Расш_SamosaleApiКлюч);
		Заголовки.Вставить("Content-Type", "application/json");
		
		Запрос = Новый HTTPЗапрос("api/cash-box/create-client", Заголовки);
		
		СтруктураДляJSON = Новый Структура;
		СтруктураДляJSON.Вставить("phone", 		СокрЛП(ТелефонКлиента));
		
		//ДопСтуктураДляJSON = Новый Структура;
		//clientСтруктураJSON = Новый Структура;
		//clientСтруктураJSON.Вставить("fio", ИмяКлиента);
		//ДопСтуктураДляJSON.Вставить("client", clientСтруктураJSON);
		//ДопСтуктураДляJSON.Вставить("birthday", ДатаРождения);
		//СтруктураДляJSON.Вставить("extFields", ДопСтуктураДляJSON);
		
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();                       
		ЗаписатьJSON(Запись,СтруктураДляJSON);
		ТелоЗапроса = Запись.Закрыть();
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Результат = Соединение.ОтправитьДляОбработки(Запрос);
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		СтруктураПречек = ОбщегоНазначенияВызовСервера.ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
		Чтение.Закрыть();
		
		Если СтрНайти(СтруктураПречек.message,"Телефон» уже занято") Тогда
			Сообщить("Телефон уже зарегистрирован");
			Возврат;
		КонецЕсли; 
		
		Если Результат.КодСостояния = 200 Тогда
			Рег.Телефон			=	СокрЛП(ТелефонКлиента);
			Рег.Имя				=	ИмяКлиента;
			Рег.ДатаРождения	=	ДатаРождения;
			Рег.Зарегестрирован = 	Истина;
			рег.Записать();
			Сообщить("Клиент успешно зарегистрирован в системе Samosale.");
			
		иначе
			Рег.Телефон			=	СокрЛП(ТелефонКлиента);
			Рег.Имя				=	ИмяКлиента;
			Рег.ДатаРождения	=	ДатаРождения;
			рег.Записать();
			//Сообщить("Проблемы с интернетом. Клиент будет зарегистрирован в Samosale позже.");
		КонецЕсли;
		
	Исключение		
		
		Рег.Телефон			=	СокрЛП(ТелефонКлиента);
		Рег.Имя				=	ИмяКлиента;
		Рег.ДатаРождения	=	ДатаРождения;
		рег.Записать();
		Сообщить("Проблемы с интернетом. Клиент будет зарегистрирован в Samosale позже.");
	КонецПопытки;
	
КонецПроцедуры

&НаСерверебезКонтекста
Функция ВычислитьВозраст(ДатаРождения)

	Возраст = Год(Текущаядата()) - Год(ДатаРождения);	
	
	ДеньТекущий = День(Текущаядата());
	МесяцТекущий = Месяц(ТекущаяДата());
	
	ДеньРождения = День(ДатаРождения);
	МесяцРождения = Месяц(ДатаРождения);
	
	Если МесяцРождения > МесяцТекущий ИЛИ (МесяцРождения = МесяцТекущий И ДеньРождения > ДеньТекущий) Тогда
		
		Возраст = Возраст - 1;

	КонецЕсли;
	
	Возврат Возраст;	

КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТелефонКлиента = "+7" + Формат(ВладелецФормы.Samosale_НомерТелефона, "ЧГ=0");
КонецПроцедуры
