&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		НовСтрока = ДанныеПоВыручке.Добавить();
		НовСтрока.ТипДС	=	"Наличные";  
		НовСтрока.По1с			=	Параметры.ОплатаНаличными;  
		
		Если Параметры.Свойство("НаличныйZ") и Параметры.НаличныйZ<>"Внести с z-отчета" тогда
			НовСтрока.ZОтчет		=	Параметры.НаличныйZ;
		иначе  
			НовСтрока.ZОтчет		=	"Внести с z-отчета";
		КонецЕсли;
		
		Если Параметры.Свойство("НаличныйФакт") и Параметры.НаличныйФакт<>"Пересчитать кассу и внести" тогда
			НовСтрока.Фактически		=	Параметры.НаличныйФакт;
		иначе  
			НовСтрока.Фактически		=	"Пересчитать кассу и внести";
		КонецЕсли;

		
		НовСтрока = ДанныеПоВыручке.Добавить();
		НовСтрока.ТипДС	=	"Безналичные";  
		НовСтрока.По1с			=	Параметры.ОплатаПоБанковскимКартам; 
		
		Если Параметры.Свойство("БезНаличныйZ") и Параметры.БезНаличныйZ<>"Внести с z-отчета" тогда
			НовСтрока.ZОтчет		=	Параметры.БезНаличныйZ;
		иначе  
			НовСтрока.ZОтчет		=	"Внести с z-отчета";
		КонецЕсли;
		
		
		Если Параметры.Свойство("БезНаличныйФакт") и Параметры.БезНаличныйФакт<>"Внести с терминальной сверки" тогда
			НовСтрока.Фактически		=	Параметры.БезНаличныйФакт;
		иначе  
			НовСтрока.Фактически		=	"Внести с терминальной сверки";
		КонецЕсли;
		ТерминальнаяСверкаНеВышла	= Параметры.ТерминальнаяСверкаНеВышла;

		ПересчитатьРазницу();
		
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьРазницу()
	флНадоВыводить = ложь;
	
	Для каждого Строка из ДанныеПоВыручке цикл      
		Попытка
			Строка.РазницаZ		=	Строка.По1с - Число(Строка.ZОтчет); 
		Исключение
		КонецПопытки;
		
		Попытка  			
			Строка.РазницаФакт	=	Строка.По1с - Число(Строка.Фактически);
		Исключение
		КонецПопытки;
		
		Если Строка.РазницаZ <>0 или Строка.РазницаФакт <>0 тогда
       		флНадоВыводить = Истина;  
		КонецЕсли; 
		
	КонецЦикла;     
	
	
	Если флНадоВыводить тогда
		Элементы.Декорация1.Заголовок	=	"Сообщить администратору о разнице";
	иначе
		Элементы.Декорация1.Заголовок	=	"";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеПриИзменении(Элемент)
	ПересчитатьРазницу();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеПередУдалением(Элемент, Отказ)
	отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда) 
	СтруктураЗакрытия	=	Новый Структура();
	СтруктураЗакрытия.Вставить("НаличныйZ", ДанныеПоВыручке[0].ZОтчет);
	СтруктураЗакрытия.Вставить("БезНаличныйZ", ДанныеПоВыручке[1].ZОтчет);
	СтруктураЗакрытия.Вставить("НаличныйФакт", ДанныеПоВыручке[0].Фактически);
	СтруктураЗакрытия.Вставить("БезНаличныйФакт", ДанныеПоВыручке[1].Фактически);
	СтруктураЗакрытия.Вставить("ТерминальнаяСверкаНеВышла", ТерминальнаяСверкаНеВышла);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоВыручкеZОтчетИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элемент.ЦветТекста	=	WebЦвета.Черный;	
	
	Для Ном = 1 по 5 цикл
		КодСимвола =  КодСимвола(Прав(Текст,1));
		
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) и не КодСимвола = 46 тогда
			Текст	=	Сред(Текст,1,СтрДлина(Текст)-1); 
			Элементы.ДанныеПоВыручке.ТекущиеДанные.ZОтчет = Текст;   
		КонецЕсли;      
	КонецЦикла;
			
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоВыручкеФактическиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Элемент.ЦветТекста	=	WebЦвета.Черный;	
	Для Ном = 1 по 5 цикл
		КодСимвола =  КодСимвола(Прав(Текст,1));
		
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) и не КодСимвола = 46 тогда
			Текст	=	Сред(Текст,1,СтрДлина(Текст)-1); 
			Элементы.ДанныеПоВыручке.ТекущиеДанные.Фактически = Текст;   
		КонецЕсли;  
	КонецЦикла;  
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоВыручкеZОтчетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Попытка
		Числ = Число(Текст);
	Исключение
		Элементы.ДанныеПоВыручке.ТекущиеДанные.ZОтчет = "0"; 
		Возврат;
	КонецПопытки; 
	
	Если Числ <>0 тогда
		Числ = Формат(Числ,"ЧДЦ=2");
	КонецЕсли;
	
	Элементы.ДанныеПоВыручке.ТекущиеДанные.ZОтчет = Числ;
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПоВыручкеФактическиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Попытка
		Числ = Число(Текст);
	Исключение
		Элементы.ДанныеПоВыручке.ТекущиеДанные.Фактически = "0"; 
		Возврат;
	КонецПопытки; 
	
	Если Числ <>0 тогда
		Числ = Формат(Числ,"ЧДЦ=2");
	КонецЕсли;
	
	Элементы.ДанныеПоВыручке.ТекущиеДанные.Фактически = Числ;

КонецПроцедуры

