
&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Для Каждого стр из Объект.Товары Цикл
		стр.КоличествоЦенников = 1;
		макет = ПолучитьМакетДляНоменклатуры(стр.Номенклатура);
		Если макет<>неопределено и ЗначениеЗаполнено(макет) Тогда
			стр.ШаблонЦенника = макет;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Функция ПолучитьМакетДляНоменклатуры(номен)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("номен",номен);
	Запрос.Текст = "ВЫБРАТЬ
	               |	допРекв.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК допРекв
	               |ГДЕ
	               |	допРекв.Свойство.Заголовок = ""ШаблонДляПечати""
	               |	И допРекв.Ссылка = &номен";
	
	рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат справочники.ХранилищеШаблонов.НайтиПоНаименованию(СокрЛП(Строка(рез.Значение)));
	КонецЕсли;
КонецФункции