Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;

// Флаги принадлежности к виду операции.
Перем мВидОперацииНТТ Экспорт;
Перем мВидОперацииРозница Экспорт;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура устанавливает флаги принадлежности к виду операции.
//
Процедура УстановитьФлагиВидаОперации() Экспорт

	мВидОперацииНТТ = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ);
	мВидОперацииРозница = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);

КонецПроцедуры // УстановитьФлагиВидаОперации()

#Если Клиент Тогда
	
// НЧАН	
Функция чПечатьЦенников(ПараметрЧ)

	// |	Цены.ЦеноваяКатегория,
	//  |	Цены.ПроцентНаценки,
	      

	
	Если ЗначениеЗаполнено(Ссылка.ДокументОснование) Тогда
		Запросдва = Новый Запрос;
		Запросдва.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец,
		|	Штрихкоды.ЕдиницаИзмерения,
		|	Штрихкоды.ТипШтрихкода,
		|	Штрихкоды.Дата
		|ПОМЕСТИТЬ ШК
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО ПеремещениеТоваровТовары.Штрихкод = Штрихкоды.Штрихкод
		|ГДЕ
		|	Штрихкоды.Владелец В
		|			(ВЫБРАТЬ
		|				ПереоценкаТоваровВРозницеТовары.Номенклатура
		|			ИЗ
		|				Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
		|			ГДЕ
		|				ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка)
		|	И ПеремещениеТоваровТовары.Ссылка = &ДокОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Печать,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура КАК Номенклатура,
		|   ПереоценкаТоваровВРозницеТовары.Номенклатура.ШаблонДляПечати Как ШаблонПечати,
		|	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияИзДокумента,
		|	ПереоценкаТоваровВРозницеТовары.ЦенаВРозницеСтарая КАК СтараяЦена,
		|	ПереоценкаТоваровВРозницеТовары.ЦенаВРознице КАК ЦенаРознич,
		|	1 КАК Количество,
		|	ШК.Штрихкод КАК ШтрихкодИзДокумента,
		|	ШК.ТипШтрихкода КАК ТипШтрихкодаИзРегистра
		|ИЗ
		|	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ШК КАК ШК
		|		ПО ПереоценкаТоваровВРозницеТовары.Номенклатура = ШК.Владелец
		|			И ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков = ШК.ЕдиницаИзмерения
		|ГДЕ
		|	ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка";
		
		Запросдва.УстановитьПараметр("Ссылка", Ссылка);
		Запросдва.УстановитьПараметр("ДокОснование", Ссылка.ДокументОснование);
		
	Иначе
		Запросдва = Новый Запрос;
		Запросдва.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец,
		|	Штрихкоды.ЕдиницаИзмерения,
		|	Штрихкоды.ТипШтрихкода,
		|	Штрихкоды.Дата
		|ПОМЕСТИТЬ ШК
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец В
		|			(ВЫБРАТЬ
		|				ПереоценкаТоваровВРозницеТовары.Номенклатура
		|			ИЗ
		|				Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
		|			ГДЕ
		|				ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Печать,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура КАК Номенклатура,
		|   ПереоценкаТоваровВРозницеТовары.Номенклатура.ШаблонДляПечати Как ШаблонПечати,
		|	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияИзДокумента,
		|	ПереоценкаТоваровВРозницеТовары.ЦенаВРозницеСтарая КАК СтараяЦена,
		|	ПереоценкаТоваровВРозницеТовары.ЦенаВРознице КАК ЦенаРознич,
		|	1 КАК Количество,
		|	ШК.Штрихкод КАК ШтрихкодИзДокумента,
		|	ШК.ТипШтрихкода КАК ТипШтрихкодаИзРегистра,
		|	ШК.Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ШК КАК ШК
		|		ПО ПереоценкаТоваровВРозницеТовары.Номенклатура = ШК.Владелец
		|			И ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков = ШК.ЕдиницаИзмерения
		|ГДЕ
		|	ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Печать,
		|	ВТ.Номенклатура,
		|   ВТ.ШаблонПечати,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.ЕдиницаИзмеренияИзДокумента,
		|	ВТ.СтараяЦена,
		|	ВТ.ЦенаРознич,
		|	ВТ.Количество,
		|	ВТ.ТипШтрихкодаИзРегистра,
		|	МАКСИМУМ(ВТ.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ3
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Номенклатура,
		|   ВТ.ШаблонПечати,
		|	ВТ.Печать,
		|	ВТ.ХарактеристикаНоменклатуры,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.ЕдиницаИзмеренияИзДокумента,
		|	ВТ.ТипШтрихкодаИзРегистра,
		|	ВТ.СтараяЦена,
		|	ВТ.ЦенаРознич,
		|	ВТ.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ3.Печать,
		|	ВТ3.Номенклатура КАК Номенклатура,
		|   ВТ3.ШаблонПечати,
		|	ВТ3.ХарактеристикаНоменклатуры,
		|	ВТ3.ЕдиницаИзмерения,
		|	ВТ3.ЕдиницаИзмеренияИзДокумента,
		|	ВТ3.СтараяЦена,
		|	ВТ3.ЦенаРознич,
		|	ВТ3.Количество,
		|	ВТ3.ТипШтрихкодаИзРегистра,
		|	МАКСИМУМ(ВТ3.Дата) КАК Дата,
		|	МАКСИМУМ(ВТ.ШтрихкодИзДокумента) КАК ШтрихкодИзДокумента,
		|	ВТ3.Номенклатура.Наименование КАК НоменклатураНаименование
		|ИЗ
		|	ВТ3 КАК ВТ3
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО ВТ3.Номенклатура = ВТ.Номенклатура
		|			И ВТ3.ХарактеристикаНоменклатуры = ВТ.ХарактеристикаНоменклатуры
		|			И ВТ3.ЕдиницаИзмерения = ВТ.ЕдиницаИзмерения
		|			И ВТ3.Количество = ВТ.Количество
		|			И ВТ3.ТипШтрихкодаИзРегистра = ВТ.ТипШтрихкодаИзРегистра
		|			И ВТ3.Дата = ВТ.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ3.Печать,
		|	ВТ3.Номенклатура,
		|   ВТ3.ШаблонПечати,
		|	ВТ3.ХарактеристикаНоменклатуры,
		|	ВТ3.ЕдиницаИзмерения,
		|	ВТ3.ЕдиницаИзмеренияИзДокумента,
		|	ВТ3.ТипШтрихкодаИзРегистра,
		|	ВТ3.СтараяЦена,
		|	ВТ3.ЦенаРознич,
		|	ВТ3.Количество,
		|	ВТ3.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование";
		
		Запросдва.УстановитьПараметр("Ссылка", Ссылка);
		
		//
		//Запростри = Новый Запрос;
		//Запростри.Текст = 
		//"ВЫБРАТЬ
		//|	ИСТИНА КАК Печать,
		//|	ПереоценкаТоваровВРозницеТовары.Номенклатура КАК Номенклатура,
		//|	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		//|	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияИзДокумента,
		//|	ПереоценкаТоваровВРозницеТовары.ЦенаВРозницеСтарая КАК СтараяЦена,
		//|	ПереоценкаТоваровВРозницеТовары.ЦенаВРознице КАК ЦенаРознич,
		//|	1 КАК Количество,
		//|	"""" КАК ШтрихкодИзДокумента,
		//|	"""" КАК ТипШтрихкодаИзРегистра
		//|ИЗ
		//|	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
		//|ГДЕ
		//|	ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка";
		//
		//Запростри.УстановитьПараметр("Ссылка", Ссылка);
		//
		//ТЗТри = Запростри.Выполнить().Выгрузить();
		//		
		//Для каждого стр из ТЗТри Цикл
		//	
		//	ЗапросШК = Новый Запрос;
		//	ЗапросШК.Текст = 
		//	"ВЫБРАТЬ
		//	|	Штрихкоды.Штрихкод,
		//	|	Штрихкоды.ТипШтрихкода
		//	|ИЗ
		//	|	РегистрСведений.Штрихкоды КАК Штрихкоды
		//	|ГДЕ
		//	|	Штрихкоды.Владелец = &Владелец
		//	|	И Штрихкоды.ЕдиницаИзмерения ПОДОБНО &ЕдиницаИзмерения
		//	|	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
		//	
		//	ЗапросШК.УстановитьПараметр("Владелец", Стр.Номенклатура);
		//	ЗапросШК.УстановитьПараметр("ЕдиницаИзмерения", стр.ЕдиницаИзмерения);
		//	ЗапросШК.УстановитьПараметр("ХарактеристикаНоменклатуры", стр.ХарактеристикаНоменклатуры);
		//	
		//	Штрихкоды = ЗапросШК.Выполнить().Выгрузить();						
		//	
		//КонецЦикла;

	КонецЕсли;
	
	
	ТЗДва = Запросдва.Выполнить().Выгрузить();
				 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	 "ВЫБРАТЬ
	//	 |	Штрихкоды.Штрихкод,
	//	 |	Штрихкоды.Владелец,
	//	 |	Штрихкоды.ЕдиницаИзмерения,
	//	 |	Штрихкоды.ТипШтрихкода
	//	 |ПОМЕСТИТЬ ШК
	//	 |ИЗ
	//	 |	РегистрСведений.Штрихкоды КАК Штрихкоды
	//	 |ГДЕ
	//	 |	Штрихкоды.Владелец В
	//	 |			(ВЫБРАТЬ
	//	 |				ПереоценкаТоваровВРозницеТовары.Номенклатура
	//	 |			ИЗ
	//	 |				Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	//	 |			ГДЕ
	//	 |				ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка)
	//	 |;
	//	 |
	//	 |////////////////////////////////////////////////////////////////////////////////
	//	 |ВЫБРАТЬ
	//	 |	ИСТИНА КАК Печать,
	//	 |	ПереоценкаТоваровВРозницеТовары.Номенклатура КАК Номенклатура,
	//	 |	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	 |	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	//	 |	ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияИзДокумента,
	//	 |	ПереоценкаТоваровВРозницеТовары.ЦенаВРозницеСтарая КАК СтараяЦена,
	//	 |	ПереоценкаТоваровВРозницеТовары.ЦенаВРознице КАК ЦенаРознич,
	//	 |	1 КАК Количество,
	//	 |	ШК.Штрихкод КАК ШтрихкодИзДокумента,
	//	 |	ШК.ТипШтрихкода КАК ТипШтрихкодаИзРегистра
	//	 |ИЗ
	//	 |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	//	 |		ЛЕВОЕ СОЕДИНЕНИЕ ШК КАК ШК
	//	 |		ПО ПереоценкаТоваровВРозницеТовары.Номенклатура = ШК.Владелец
	//	 |			И ПереоценкаТоваровВРозницеТовары.Номенклатура.ЕдиницаХраненияОстатков = ШК.ЕдиницаИзмерения
	//	 |ГДЕ
	//	 |	ПереоценкаТоваровВРозницеТовары.Ссылка = &Ссылка";

	//Запрос.УстановитьПараметр("Ссылка", Ссылка);

	//ТЗ = Запрос.Выполнить().Выгрузить();
	
	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(ТЗДва);
	ОбработкаПечатьЦенников.ТипЦен = ЭтотОбъект.Склад.ТипЦенРозничнойТорговли;     
	ОбработкаПечатьЦенников.ИПпоСкладу = ЭтотОбъект.Склад.ЮрЛицо;      
	ОбработкаПечатьЦенников.Организация = Организация;     
	ОбработкаПечатьЦенников.СсылкаДок = Ссылка; 
// КЧАН	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаполнитьЦены", Истина);
//	ОбработкаПечатьЦенников.ПерезаполнитьЦены();  // НЧАН
//	ОбработкаПечатьЦенников.Товары = Товары;  // НЧАН

	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Параметр = СтруктураПараметров;
// НЧАН	

	Если ПараметрЧ = 56 Тогда
		ТД = ОбработкаПечатьЦенников.ПечатьЦенника(0, ТЗДва);
		ТД.АвтоМасштаб = Истина;
	ИначеЕсли ПараметрЧ = 33 Тогда
		ТД = ОбработкаПечатьЦенников.ПечатьЦенника(1, ТЗДва);
		ТД.АвтоМасштаб = Ложь;
	ИначеЕсли ПараметрЧ = 16 Тогда
		 ТД = ОбработкаПечатьЦенников.ПечатьЦенника(3, ТЗДва);
		 ТД.АвтоМасштаб = Ложь;
	КонецЕсли;
		ТД.ОтображатьСетку = Ложь;
	Возврат ТД;

КонецФункции
// КЧАН
	
	
// Функция осуществляет печать этикеток для позиций ТЧ
//
// Параметры
//  Нет
//
Процедура ПечататьЭтикетки()

	Если ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ Тогда
		УправлениеРозничнойТорговлей.НапечататьЭтикеткиИзДокумента(Ссылка, "ЦенаВРознице");
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("СписокХарактеристик", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Валюта", мВалютаРегламентированногоУчета);

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТоварыВРознице.Номенклатура КАК Номенклатура,
		|	Остатки.КоличествоОстаток КАК Количество,
		|	ТоварыВРознице.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ТоварыВРознице.СерияНоменклатуры КАК Серия,
		|	ТоварыВРознице.Качество КАК Качество,
		|	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	Док.ЦенаВРознице КАК Цена,
		|	&Валюта КАК Валюта,
		|	РегШК.ТипШтрихкода КАК ТипШтрихкода,
		|	РегШК.ПредставлениеШтрихкода КАК ПредставлениеШтрихкода,
		|	РегШК.Штрихкод КАК Штрихкод
		|ИЗ
		|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ
		|		Характеристики.Ссылка КАК Ссылка,
		|		Характеристики.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
		|	ГДЕ
		|		Характеристики.Владелец В (&СписокНоменклатуры)
		|		И Характеристики.Ссылка НЕ В (&СписокХарактеристик)
		|		И Характеристики.Ссылка НЕ В (
		|			ВЫБРАТЬ
		|				ЦеныПродажные.ХарактеристикаНоменклатуры
		|			ИЗ
		|				РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата,
		|				   Номенклатура В (&СписокНоменклатуры)) КАК ЦеныПродажные
		|		)
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
		|		Номенклатура.Ссылка КАК Владелец
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|	ГДЕ
		|		Номенклатура.Ссылка В (&СписокНоменклатуры)
		|	) КАК Характеристики
		|ПО
		|	Док.Номенклатура = Характеристики.Владелец
		|	И Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыВРознице.Остатки(&Дата, Склад = &Склад И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
		|ПО
		|	Док.Номенклатура = Остатки.Номенклатура
		|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ТоварыВРознице КАК ТоварыВРознице
		|ПО
		|	Док.Ссылка = ТоварыВРознице.Регистратор
		|	И Док.Номенклатура = ТоварыВРознице.Номенклатура
		|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = ТоварыВРознице.ХарактеристикаНоменклатуры
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Штрихкоды КАК РегШК
		|ПО
		|	РегШК.Владелец = ТоварыВРознице.Номенклатура
		|	И РегШК.ЕдиницаИзмерения = ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков
		|	И РегШК.ХарактеристикаНоменклатуры = ТоварыВРознице.ХарактеристикаНоменклатуры
		|	И РегШК.СерияНоменклатуры = ТоварыВРознице.СерияНоменклатуры
		|	И РегШК.Качество = ТоварыВРознице.Качество
		|ГДЕ
		|	Док.Ссылка = &ДокСсылка
		|";

		Запрос.Текст = ТекстЗапроса;

		УправлениеРозничнойТорговлей.ПечатьЭтикеток(Запрос.Выполнить().Выгрузить());
	КонецЕсли;

КонецПроцедуры // ПечататьЭтикетки()

// Функция формирует табличный документ с печатной формой переоценки в НТТ.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьПереоценкиТоваровВНТТ()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|	Организация         КАК Поставщик,
	|	Склад               КАК Получатель,
	|	Склад.Представление КАК ПредставлениеПолучателя,
	|	Товары.(
	|		НомерСтроки,
	|		Количество,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	|		Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|		ЦенаВРозницеСтарая,
	|		ЦенаВРознице,
	|		(ЦенаВРознице - ЦенаВРозницеСтарая) * Количество КАК ОтклонениеСтоимости,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	)
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице КАК ПереоценкаТоваровВРознице
	|ГДЕ
	|	ПереоценкаТоваровВРознице.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПереоценкаТоваровВРознице_ПереоценкаТоваровВРознице";
	Макет = ПолучитьМакет("ПереоценкаТоваровВРознице");

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Переоценка товаров в рознице");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогОтклонениеСтоимости = 0;
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Товар) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = ВыборкаСтрокТовары.Товар + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ТабДокумент.Вывести(ОбластьМакета);

		ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости + ВыборкаСтрокТовары.ОтклонениеСтоимости;
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
	ОбластьМакета.Параметры.ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости;
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьПереоценкиТоваровВНТТ()

// Функция формирует табличный документ с печатной формой переоценки в рознице.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьПереоценкиТоваровВРознице(Перечень = Неопределено )

	Дата = Дата + 60 ; // НЧАН
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СписокХарактеристик", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	Запрос.УстановитьПараметр("Дата", Дата);

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Док.Ссылка.Номер,
	|	Док.Ссылка.Дата,
	|	Док.Ссылка.Организация,
	|	Док.Ссылка.Организация КАК Поставщик,
	|	Док.Ссылка.Склад КАК Получатель,
	|	Док.Ссылка.Склад.Представление КАК ПредставлениеПолучателя,
	|	ТоварыВРознице.НомерСтроки,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	ТоварыВРознице.Номенклатура,
	|	ТоварыВРознице.Номенклатура.НаименованиеПолное КАК Товар,
	|	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	|	ТоварыВРознице.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ВЫБОР КОГДА Остатки.КоличествоОстаток = 0 ТОГДА
	|		0
	|	ИНАЧЕ
	|		Остатки.СуммаПродажнаяОстаток / Остатки.КоличествоОстаток
	|	КОНЕЦ КАК ЦенаВРозницеСтарая,
	|	Док.ЦенаВРознице,
	|	ТоварыВРознице.СуммаПродажная КАК ОтклонениеСтоимости,
	|	ТоварыВРознице.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ТоварыВРознице.СерияНоменклатуры КАК Серия
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		Характеристики.Ссылка КАК Ссылка,
	|		Характеристики.Владелец КАК Владелец
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|	ГДЕ
	|		Характеристики.Владелец В (&СписокНоменклатуры)
	|		И Характеристики.Ссылка НЕ В (&СписокХарактеристик)
	|		И Характеристики.Ссылка НЕ В (
	|			ВЫБРАТЬ
	|				ЦеныПродажные.ХарактеристикаНоменклатуры
	|			ИЗ
	|				РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата,
	|				   Номенклатура В (&СписокНоменклатуры)) КАК ЦеныПродажные
	|		)
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
	|		Номенклатура.Ссылка КАК Владелец
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.Ссылка В (&СписокНоменклатуры)
	|	) КАК Характеристики
	|ПО
	|	Док.Номенклатура = Характеристики.Владелец
	|	И Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРознице.Остатки(&Дата, Склад = &Склад И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|ПО
	|	Док.Номенклатура = Остатки.Номенклатура
	|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры
	|СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРознице КАК ТоварыВРознице
	|ПО
	|	Док.Ссылка = ТоварыВРознице.Регистратор
	|	И Док.Номенклатура = ТоварыВРознице.Номенклатура
	|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = ТоварыВРознице.ХарактеристикаНоменклатуры
	|ГДЕ
	|	Док.Ссылка = &ДокСсылка
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыВРознице.НомерСтроки
	|";
	
	// НЧАН
	Если Перечень = 1 Тогда 
		ТекстЗапроса = ПереченьТекстЗапроса();
		Запрос.Параметры.Удалить("СписокХарактеристик");
		Макет = ПолучитьМакет("ПереченьПереоцТоваров");
	Иначе
		Макет = ПолучитьМакет("ПереоценкаТоваровВРознице");
	КонецЕсли;
	// КЧАН

	Запрос.Текст = ТекстЗапроса;

	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Предупреждение("Ни один товар не был переоценен.");
		Возврат Неопределено;
	КонецЕсли;

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПереоценкаТоваровВРознице_ПереоценкаТоваровВРознице";

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Переоценка товаров в рознице");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогОтклонениеСтоимости = 0;
	ВыборкаСтрокТовары = Шапка;
	ВыборкаСтрокТовары.Сбросить();
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Товар) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Товар = ВыборкаСтрокТовары.Товар + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ТабДокумент.Вывести(ОбластьМакета);

		ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости + ВыборкаСтрокТовары.ОтклонениеСтоимости;
	КонецЦикла;

	// НЧАН
	Если Перечень <> 1 Тогда  
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ОбластьМакета.Параметры.ИтогОтклонениеСтоимости = ИтогОтклонениеСтоимости;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;	
	// КЧАН

	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьПереоценкиТоваровВНТТ()

// НЧАН
Функция ПереченьТекстЗапроса()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	Док.Ссылка.Номер,
	               |	Док.Ссылка.Дата,
	               |	Док.Ссылка.Организация,
	               |	Док.Ссылка.Организация КАК Поставщик,
	               |	Док.Ссылка.Склад КАК Получатель,
	               |	Док.Ссылка.Склад.Представление КАК ПредставлениеПолучателя,
	               |	Остатки.КоличествоОстаток КАК Количество,
	               |	Док.ЦенаВРознице,
	               |	Док.НомерСтроки КАК НомерСтроки,
	               |	Док.Номенклатура,
	               |	Док.Номенклатура.Наименование КАК Товар,
	               |	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаИзмерения,
	               |	Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	               |	0 КАК ОтклонениеСтоимости,
	               |	Док.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	Док.СерияНоменклатуры КАК Серия,
	               |	Док.ЦенаВРозницеСтарая КАК ЦенаВРозницеСтарая
	               |ИЗ
	               |	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(
	               |				&Дата,
	               |				Склад = &Склад
	               |					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	               |		ПО Док.Номенклатура = Остатки.Номенклатура
	               |			И Док.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	Док.Ссылка = &ДокСсылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Возврат ТекстЗапроса
	
КонецФункции
// КЧАН

// Функция печатает ценники.
//
Функция ПечатьЦенников()

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИСТИНА КАК Печать,
	                      |	Док.Номенклатура КАК Номенклатура, 						  
	                      |	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                      |	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	                      |	Док.ЦенаВРознице КАК Цена,
	                      |	1 КАК Количество,
	                      |	Док.ЦенаВРозницеСтарая КАК СтараяЦена
	                      |ИЗ
	                      |	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	                      |ГДЕ
	                      |	Док.Ссылка = &Док");

	Запрос.УстановитьПараметр("Док", Ссылка);

	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Открыть();

КонецФункции // ПечатьЦенников()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	//перезаполнение переменных на случай запуска из формы списка
    мВидОперацииНТТ = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ);
	мВидОперацииРозница = (ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВРознице);
	
	Если мВидОперацииНТТ Тогда
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
		КонецЕсли;
	ИначеЕсли мВидОперацииРозница Тогда
		Если Не Проведен Тогда
			Предупреждение("Документ можно распечатать только после его проведения");
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "ПереоценкаТоваровВРознице" Тогда
		Если мВидОперацииНТТ Тогда
			ТабДокумент = ПечатьПереоценкиТоваровВНТТ();
		ИначеЕсли мВидОперацииРозница Тогда
			ТабДокумент = ПечатьПереоценкиТоваровВРознице();
		КонецЕсли;
	ИначеЕсли ИмяМакета = "Ценники" Тогда
		ТабДокумент = ПечатьЦенников();
	ИначеЕсли ИмяМакета = "Этикетки" Тогда
		ПечататьЭтикетки();
		Возврат;
	ИначеЕсли ИмяМакета = "Ценники56" Тогда   // НЧАН
		ТабДокумент = чПечатьЦенников(56);
	ИначеЕсли ИмяМакета = "Ценники33" Тогда   // НЧАН  
		ТабДокумент = чПечатьЦенников(33);
	ИначеЕсли ИмяМакета = "ЦенникиНоменкл" Тогда
		ТабДокумент = чПечатьЦенников(16);
	ИначеЕсли ИмяМакета = "ПереченьПереоцТоваров" Тогда   // НЧАН
		ТабДокумент = ПечатьПереоценкиТоваровВРознице(1);
		
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура("ПереоценкаТоваровВРознице", "Переоценка товаров в рознице");
	СтруктураМакетов.Вставить("Ценники", "Ценники на товары");
	СтруктураМакетов.Вставить("Этикетки", "Этикетки");
	СтруктураМакетов.Вставить("Ценники56",            "Ценники(5х6)");         // НЧАН
	СтруктураМакетов.Вставить("Ценники33",            "Ценники(3х3)");         // НЧАН
	СтруктураМакетов.Вставить("ЦенникиНоменкл", "ЦенникиНоменклатуры"); //Балашева
	СтруктураМакетов.Вставить("ПереченьПереоцТоваров", "Перечень переоценённых товаров"); // НЧАН
    
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура выполняет заполнение табличной части.
//
Процедура ЗаполнитьТовары(РежимЗаполнения = "ЗаполнитьПоОстаткам") Экспорт

	Если РежимЗаполнения = "ЗаполнитьИзУстановкиЦен" Тогда
		Если НЕ ЗначениеЗаполнено(ДокументУстановкаЦен) Тогда
			Предупреждение("Не выбран документ установки цен!");
			Возврат;
		КонецЕсли;

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	УстановкаЦен.Номенклатура КАК Номенклатура,
		                      |	УстановкаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		                      |	УстановкаЦен.Цена / УстановкаЦен.ЕдиницаИзмерения.Коэффициент * УстановкаЦен.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент * КурсыВалют.Курс / КурсыВалют.Кратность КАК ЦенаВРознице,
		                      |	ЦеныАТТСрезПоследних.Цена Как ЦенаВРозницеСтарая
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦен
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалют
		                      |		ПО (КурсыВалют.Валюта = УстановкаЦен.Валюта)
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата, Склад = &Склад) КАК ЦеныАТТСрезПоследних
		                      |		ПО УстановкаЦен.Номенклатура = ЦеныАТТСрезПоследних.Номенклатура
		                      |ГДЕ
		                      |	УстановкаЦен.Ссылка = &Док
		                      |	И УстановкаЦен.ТипЦен = &ТипЦен");

		Запрос.УстановитьПараметр("ТипЦен", Склад.ТипЦенРозничнойТорговли);
		Запрос.УстановитьПараметр("Док"   , ДокументУстановкаЦен);
		Запрос.УстановитьПараметр("Дата"  , Дата);
		Запрос.УстановитьПараметр("Склад" , Склад);

		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		ДатаЦен = ?(НачалоДня(Дата) <> НачалоДня(ТекущаяДата()), Дата, ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата")));

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Товар", Перечисления.ТоварТара.Товар);
		Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	Остатки.ЦенаВРознице,
		|	Остатки.ХарактеристикаНоменклатуры,
		|	Остатки.СерияНоменклатуры,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВНТТ.Остатки(&ДатаЦен,
		|	   Склад = &Склад И ТоварТара = &Товар) КАК Остатки
		|ГДЕ
		|	Остатки.КоличествоОстаток > 0
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.ЦенаВРознице,
		|	Остатки.ХарактеристикаНоменклатуры,
		|	Остатки.СерияНоменклатуры
		|";

		Выборка        = Запрос.Выполнить().Выбрать();
		ТипЦенСклада   = Склад.ТипЦенРозничнойТорговли;
		Валюта         = мВалютаРегламентированногоУчета;
		СтруктураКурса = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта, Дата);
		Курс           = СтруктураКурса.Курс;
		Кратность      = СтруктураКурса.Кратность;

		Пока Выборка.Следующий() Цикл

			ДобавитьСтроку     = Истина;
			Номенклатура       = Выборка.Номенклатура;
			Характеристика     = Выборка.ХарактеристикаНоменклатуры;
			Серия              = Выборка.СерияНоменклатуры;
			Количество         = Выборка.КоличествоОстаток;
			ЦенаВРозницеСтарая = Выборка.ЦенаВРознице;

			Если РежимЗаполнения = "ЗаполнитьПоЦенам" Тогда
				ЦенаПоТипуЦен = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика, ТипЦенСклада,
				                Дата, Номенклатура.ЕдиницаХраненияОстатков, Валюта, Курс, Кратность);

				Если ЦенаПоТипуЦен > 0
				   И ЦенаПоТипуЦен <> ЦенаВРозницеСтарая Тогда
					ЦенаВРознице = ЦенаПоТипуЦен;
				Иначе
					ДобавитьСтроку = Ложь;
				КонецЕсли;
			Иначе
				ЦенаВРознице = ЦенаВРозницеСтарая;
			КонецЕсли;

			Если ДобавитьСтроку Тогда
				СтрокаТабличнойЧасти = Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура               = Номенклатура;
				СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Характеристика;
				СтрокаТабличнойЧасти.СерияНоменклатуры          = Серия;
				СтрокаТабличнойЧасти.Количество                 = Количество;
				СтрокаТабличнойЧасти.ЦенаВРозницеСтарая         = ЦенаВРозницеСтарая;
				СтрокаТабличнойЧасти.ЦенаВРознице               = ЦенаВРознице;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьТовары()
#КонецЕсли

// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииОрганизации()

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , "Покупка", ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Выполняет инициализацию нового документа и устанавливает вид операции ПереоценкаВНТТ.
// Вызывается из веб-приложения "Удаленный склад".
// 
Процедура ИнициализироватьНовыйДокументНТТ(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование);
	ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ;
	
	Если ЗначениеЗаполнено(Склад) И Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
		
		Склад = Справочники.Склады.ПустаяСсылка();
		
	КонецЕсли;

КонецПроцедуры // ИнициализироватьНовыйДокумент()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует таблицу товаров для переоценки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица значений, содержащая информацию для движений по переоценке.
//
Функция ПодготовитьТаблицуПереоценки()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ТекстЗапросаСписокНоменклатуры = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Номенклатура
	                                 |ИЗ
	                                 |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	                                 |ГДЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Ссылка = &ДокСсылка";
									 
	ТекстЗапросаСписокХарактеристик ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры
	                                 |ИЗ
	                                 |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	                                 |ГДЕ
	                                 |	ПереоценкаТоваровВРозницеТовары.Ссылка = &ДокСсылка";									 
	

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Склад КАК Склад,
	|	Док.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
	|	Остатки.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Остатки.Качество КАК Качество,
	|	Док.ЦенаВРознице * Остатки.КоличествоОстаток - Остатки.СуммаПродажнаяОстаток КАК СуммаПродажная
	|ИЗ
	|	Документ.ПереоценкаТоваровВРознице.Товары КАК Док
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		Характеристики.Ссылка КАК Ссылка,
	|		Характеристики.Владелец КАК Владелец
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|	ГДЕ
	|		Характеристики.Владелец В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Характеристики.Ссылка НЕ В (" + ТекстЗапросаСписокХарактеристик + ")
	|		И Характеристики.Ссылка НЕ В (
	|			ВЫБРАТЬ
	|				ЦеныПродажные.ХарактеристикаНоменклатуры
	|			ИЗ
	|				РегистрСведений.ЦеныАТТ.СрезПоследних(&Дата,
	|				   Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")) КАК ЦеныПродажные
	|		)
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
	|		Номенклатура.Ссылка КАК Владелец
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.Ссылка В (" + ТекстЗапросаСписокНоменклатуры + ")
	|	) КАК Характеристики
	|ПО
	|	Док.Номенклатура = Характеристики.Владелец
	|	И Док.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРознице.Остатки(&Дата, Склад = &Склад И Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")) КАК Остатки
	|ПО
	|	Док.Номенклатура = Остатки.Номенклатура
	|	И ЕСТЬNULL(Характеристики.Ссылка, Док.ХарактеристикаНоменклатуры) = Остатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	Док.Ссылка = &ДокСсылка
	|	И Док.ЦенаВРознице * Остатки.КоличествоОстаток - Остатки.СуммаПродажнаяОстаток <> 0
	|";

	Запрос.Текст = ТекстЗапроса;

	ТаблицаПереоценки = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаПереоценки;

КонецФункции // ПодготовитьТаблицуПереоценки()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры:
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары".
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();

	Если мВидОперацииНТТ Тогда
		ТаблицаТоваров.Колонки.Добавить("МинусКоличество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 3));

		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			СтрокаТаблицы.МинусКоличество = - СтрокаТаблицы.КоличествоДок;
		КонецЦикла;
	КонецЕсли;

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()

// Проверяет правильность заполнения шапки документа.
//
// Параметры:
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация, Склад");

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если мВидОперацииНТТ Тогда
		Если СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не может осуществлять переоценку не на НТТ!", Отказ, Заголовок);
		КонецЕсли;
	ИначеЕсли мВидОперацииРозница Тогда
		Если СтруктураШапкиДокумента.ВидСклада <> Перечисления.ВидыСкладов.Розничный Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не может осуществлять переоценку не на розничном складе!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Номенклатура");

	Если Не мРазрешитьНулевыеЦеныВРознице Тогда
		СтруктураОбязательныхПолей.Вставить("ЦенаВРознице");
	КонецЕсли;

	Если мВидОперацииНТТ Тогда
		СтруктураОбязательныхПолей.Вставить("Количество");
	КонецЕсли;

	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, "Товары", СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровВРознице.ПереоценкаВНТТ Тогда

		// Здесь услуг быть не должно.
		УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

		// Здесь наборов-комплектов быть не должно.
		УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;

	// Здесь наборов-пакетов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Товары", ТаблицаПоТоварам, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры:
//  РежимПроведения         - режим проведения документа (оперативный или неоперативный).
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - заголовок сообщения об ошибках.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);

	Если мВидОперацииНТТ Тогда
		НаборДвижений = Движения.ТоварыВНТТ;

		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		ТаблицаПоТоварамРасход = ТаблицаПоТоварам.Скопировать();
		ТаблицаПоТоварамРасход.Колонки.ЦенаВРозницеСтарая.Имя = "ЦенаВРознице";
		ТаблицаПоТоварамРасход.Колонки.МинусКоличество.Имя = "Количество";

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамРасход, ТаблицаДвижений);

		ТаблицаПоТоварамПриход = ТаблицаПоТоварам.Скопировать();
		ТаблицаПоТоварамПриход.Колонки.Цена.Имя = "ЦенаВРознице";
		ТаблицаПоТоварамПриход.Колонки.КоличествоДок.Имя = "Количество";

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварамПриход, ТаблицаДвижений);

		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.ТоварТара.Товар, "ТоварТара");
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
	ИначеЕсли мВидОперацииРозница Тогда
		НаборДвижений = Движения.ЦеныАТТ;
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьДвижения();
		КонецЕсли;

		НаборДвижений = Движения.ТоварыВРознице;

		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийТоварыНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийТоварыНаСкладах.Скопировать();

		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПереоценки, ТаблицаДвижений);

		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	#Если Клиент Тогда
	Если НеПерепроводитьУстановкуЦен = Неопределено тогда
		УдалениеДублейЦен();
	КонецЕсли;
	#КонецЕсли

	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	УстановитьФлагиВидаОперации();

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"      , "ВалютаУправленческогоУчета"    , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы"      , "КурсВалютыУправленческогоУчета", "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика", "ВестиПартионныйУчетПоСкладам"  , "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад"          , "ВидСклада"                     , "ВидСклада");

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Получим необходимые данные для проведения и проверки заполнения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("КоличествоДок"             , "Количество");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"         , "СерияНоменклатуры");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                  , "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Цена"                      , "ЦенаВРознице");
	СтруктураПолей.Вставить("ЦенаВРозницеСтарая"        , "ЦенаВРозницеСтарая");
	СтруктураПолей.Вставить("Склад"                     , "Ссылка.Склад");

	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	
	//++доп свертка
	табл2 = ТаблицаПоТоварам.скопировать();
	табл2.свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,Услуга,Набор,Комплект,Склад", "КоличествоДок");
	табл2.колонки.добавить("Цена");
	табл2.колонки.добавить("ЦенаВРозницеСтарая");
	табл2.колонки.добавить("НомерСтроки");
	
	
	Если табл2.количество() <> ТаблицаПоТоварам.количество() Тогда
	    сообщить("Внимание. Зафиксирована не штатная ситуация, сработала дописка. Один товар присутствует 2 раза в строке с разной ценой. Это нарушает логику 1С. Переоценка произойдет только по первой цене");
		сч = 0;
		для Каждого стр из табл2 цикл
			отб = новый Структура;
			отб.Вставить("Номенклатура", стр.Номенклатура);
			отб.Вставить("ХарактеристикаНоменклатуры", стр.ХарактеристикаНоменклатуры);
			отб.Вставить("СерияНоменклатуры", стр.СерияНоменклатуры);
			отб.Вставить("Склад", стр.Склад);
			найдСтр= ТаблицаПоТоварам.НайтиСтроки(отб);
			если найдСтр.количество() > 1 Тогда
				сообщить("Товар " + найдСтр[0].Номенклатура + " повторяется больше 1 раза");
			КонецЕсли;	
			
			///всегда должна быть хотя бы одна строка! иначе ошибка
			стр.Цена = найдСтр[0].Цена;
			стр.ЦенаВРозницеСтарая = найдСтр[0].ЦенаВРозницеСтарая;
			стр.НомерСтроки = сч;
			сч = сч +1 ;
			
		КонецЦикла;
		ТаблицаПоТоварам = табл2;
	КонецЕсли;	
	//++
		
	ТаблицаПереоценки = ПодготовитьТаблицуПереоценки();

	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	// Движения по документу.
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПереоценки, Отказ, Заголовок);
	КонецЕсли;
		
КонецПроцедуры // ОбработкаПроведения()

Функция УдалениеДублейЦен()
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных; 
         
    ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЦеныАТТ"); 
    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный; 
    Блокировка.Заблокировать(); 
	
	НеПерепроводитьУстановкуЦен	=	Истина;

	ДокОбъект = ЭтотОбъект;
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПереоценкаТоваровВРозницеТовары.Ссылка,
	               |	ПереоценкаТоваровВРозницеТовары.Номенклатура,
	               |	ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры
	               |ИЗ
	               |	Документ.ПереоценкаТоваровВРознице.Товары КАК ПереоценкаТоваровВРозницеТовары
	               |ГДЕ
	               |	ПереоценкаТоваровВРозницеТовары.Ссылка.Дата >= &ДатаН
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка.Дата < &ДатаК
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка.Склад = &Склад
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка.Организация = &Организация
	               |	И ПереоценкаТоваровВРозницеТовары.Номенклатура = &Номенклатура
	               |	И ПереоценкаТоваровВРозницеТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка <> &Ссылка
	               |	И ПереоценкаТоваровВРозницеТовары.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(ДокОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаК",ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Организация",ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Склад",ДокОбъект.Склад);
	Запрос.УстановитьПараметр("Ссылка",ДокОбъект.Ссылка);
	
	документыФикс = Новый Соответствие();
	
	Для Каждого стр из ДокОбъект.Товары Цикл
		Запрос.УстановитьПараметр("Номенклатура",стр.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",стр.ХарактеристикаНоменклатуры);;
		
		рез = Запрос.Выполнить().Выбрать();
		Пока рез.Следующий() Цикл
			фиксдок = документыФикс.Получить(Рез.Ссылка);
			Если фиксдок = неопределено Тогда
				фиксдок = Рез.Ссылка.ПолучитьОбъект();
				ЕСЛИ ЛОЖЬ ТОГДА фиксдок = Документы.ПереоценкаТоваровВРознице.СоздатьДокумент(); КонецЕСЛИ;
				
				документыФикс.Вставить(Рез.Ссылка,фиксдок);
			КонецЕсли;
			
			мУдалить = новый Массив;
			Для Каждого стрФикс из фиксдок.Товары Цикл
				Если стрФикс.Номенклатура = стр.Номенклатура 
					И стрФикс.ХарактеристикаНоменклатуры = стр.ХарактеристикаНоменклатуры
				Тогда
					мУдалить.Добавить(стрФикс);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого стрФикс из мУдалить Цикл
				фиксдок.Товары.Удалить(стрФикс);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого фиксдок из документыФикс Цикл
		фиксдок.Значение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦИкла;
	
	ЗафиксироватьТранзакцию();
	
	НеПерепроводитьУстановкуЦен = Неопределено;

КонецФункции


// Обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если Основание = Неопределено ИЛИ НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) Тогда
		возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", Основание);
	Запрос.УстановитьПараметр("ВидСкладаРозничный", Перечисления.ВидыСкладов.Розничный);

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Док.Склад КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Склад.ВидСклада = &ВидСкладаРозничный
		|";
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Док.Ссылка.СкладПолучатель КАК Склад,
		|	1 КАК Количество,
		|	0 КАК СуммаПродажная
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &ДокОснование
		|	И Док.Ссылка.СкладПолучатель.ВидСклада = &ВидСкладаРозничный
		|";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();

	ТаблицаПоЦенам = УправлениеРозничнойТорговлей.СформироватьЗапросПоПродажнымЦенам(Основание.Дата, ТаблицаТоваров.ВыгрузитьКолонку("Склад"),
	                 ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура")).Выгрузить();

	УправлениеРозничнойТорговлей.ЗаполнитьКолонкуСуммаПродажная(ТаблицаТоваров, ТаблицаПоЦенам);

	ТЗТовары = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТаблицаТоваров, Новый Структура("СуммаПродажная", 0)).Выгрузить();

	СЗ = Новый СписокЗначений;

	Для Каждого СтрокаТовара Из ТЗТовары Цикл
		Если СЗ.НайтиПоЗначению(СтрокаТовара.Склад) = Неопределено Тогда
			СЗ.Добавить(СтрокаТовара.Склад);
		КонецЕсли;
	КонецЦикла;

	Если СЗ.Количество() = 0 Тогда
		Если ТаблицаТоваров.Количество() > 0 Тогда
			Склад = ТаблицаТоваров[0].Склад;
		КонецЕсли;

		Возврат;
	ИначеЕсли СЗ.Количество() = 1 Тогда
		Склад = СЗ[0].Значение;
	Иначе
		ВыбСклад = СЗ.ВыбратьЭлемент("Выберите склад", СЗ[0]);

		Если ВыбСклад <> Неопределено Тогда
			Склад = ВыбСклад.Значение;
			ТЗТовары = ОбщегоНазначения.ОтобратьСтрокиПоКритериям(ТЗТовары, Новый Структура("Склад", Склад)).Выгрузить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Дата 		= Основание.Дата;
	Организация = Основание.Организация;

	Товары.Загрузить(ТЗТовары);
	Для Каждого СтрокаТовара Из Товары Цикл
		СтрокаТовара.ЦенаВРознице = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура,
		   СтрокаТовара.ХарактеристикаНоменклатуры, Склад.ТипЦенРозничнойТорговли, Дата,
		   СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков, мВалютаРегламентированногоУчета, 1, 1);
	КонецЦикла;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
Префикс="УТ";

КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();

