
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается перед инициализацией HTTPСоединения из процедур обмена с УТМ.
//
// Параметры:
//  ТранспортныйМодуль - Структура - параметры подключения к УТМ.
//  ИнтернетПрокси - ИнтернетПрокси - настройки прокси-сервера. Выходной параметр.
//
Процедура ПриПолученииНастроекПроксиСервера(ТранспортныйМодуль, ИнтернетПрокси) Экспорт
	
	#Если Клиент Тогда
		НастройкаПроксиСервера = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().НастройкиПроксиСервера;
	#Иначе
		НастройкаПроксиСервера = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	#КонецЕсли

	Если НастройкаПроксиСервера <> Неопределено И НастройкаПроксиСервера.Получить("ИспользоватьПрокси") = Истина Тогда
		
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.СформироватьПрокси(НастройкаПроксиСервера, "http");
		
	КонецЕсли;

КонецПроцедуры
