
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	трейдИн = Новый Массив;
	Если Параметры.Свойство("ТрейдИн",ТрейдИн) Тогда
		Для Каждого стр из ТрейдИн Цикл
			ЗаполнитьЗначенияСвойств(Этаформа.Товары.Добавить(),стр);
		конеццикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	прототипСтруктуры = "Номенклатура,Характеристика,Доплата";
	результат = Новый Структура(прототипСтруктуры);
	
	ЗаполнитьЗначенияСвойств(
		результат,
		ЭтаФорма.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока)
	);
	
	Закрыть(результат);
КонецПроцедуры
