// Процедура проверяет наличие кадровых событий по сотруднику в указанную дату документа (созданных другими кадровыми документами)
Функция НаличиеКадровыхСобытийНаДату(Регистратор, Дата, СтруктураОтбора, СообщатьПользователю = Истина) Экспорт
	Результат = Ложь;
	
	тзЗаписей = СрезПоследних(Дата, СтруктураОтбора);

	Для Каждого СтрокаТЗ ИЗ тзЗаписей Цикл
		Если СтрокаТЗ.Регистратор <> Регистратор И НачалоДня(СтрокаТЗ.Период) = НачалоДня(Дата) Тогда
			Если СообщатьПользователю Тогда
				Сообщить("На указаную дату документа уже имеются кадровые данные по сотруднику """ + Строка(СтрокаТЗ.Сотрудник) + """: " + Строка(СтрокаТЗ.Регистратор) + Символы.ПС
							+ "Проведение нескольких кадровых событий в течение одной даты не допускается!", СтатусСообщения.ОченьВажное);	
			КонецЕсли;
			
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции