
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Создает (обновляет) элемент справочника, соответствующий виду объекта ЕГАИС.
//
// Параметры:
//  Имя                     - Строка - имя объекта ЕГАИС,
//  ПространствоИмен        - Строка - пространство имен объекта ЕГАИС,
//  ПрефиксПространстваИмен - Строка - префикс пространства имен объекта ЕГАИС,
//  ПутьНаСервере           - Строка - путь в ТМ ЕГАИС к объекту,
//  Родитель                - Строка - имя родителя объекта ЕГАИС.
//
Процедура ЗаполнитьПредопределенныйЭлемент(Имя, ПространствоИмен, ПрефиксПространстваИмен, ПутьНаСервере) Экспорт

	ВидОбъекта = Справочники.ВидыОбъектовЕГАИС[Имя].ПолучитьОбъект();
	ВидОбъекта.Наименование = ИнтеграцияЕГАИСКлиентСервер.Синоним(Имя);
	ВидОбъекта.ПространствоИмен = ПространствоИмен;
	ВидОбъекта.ПрефиксПространстваИмен = ПрефиксПространстваИмен;
	ВидОбъекта.ПутьНаСервере = ПутьНаСервере;
	ВидОбъекта.Записать();

КонецПроцедуры // ЗаполнитьПредопределенныйЭлемент()

#КонецЕсли