
&НаКлиенте
&Вместо("ВыполнитьОбработчикДлительнойОперации")
Процедура ТБКВыполнитьОбработчикДлительнойОперации()
	//// Вставить содержимое метода.
	//ПродолжитьВызов();
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	// Обработчик ОбработкаДлительнойОперации.
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПерейтиДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации);
		
		Отказ = Ложь;
		ПерейтиДалее = Истина;
		
		РезультатВычисления = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			Если ОшибкаРасхожденияВерсийПриПолученииДанных <> Неопределено И ОшибкаРасхожденияВерсийПриПолученииДанных.ЕстьОшибка Тогда
				
				ОбработатьОшибкуРасхожденияВерсий();
				Возврат;
				
			КонецЕсли;
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
			
			Возврат;
			
		ИначеЕсли ПерейтиДалее Тогда
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
		
		Возврат;
		
	КонецЕсли;
	
	//Марк 2024-12-13 это для варки баз
	Если ВладелецФормы <> Неопределено Тогда
		
		Если ВладелецФормы.Заголовок = "Обработка  Розница создание плана обмена обычная форма для варки" Тогда
		
			Если СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации = "Подключаемый_ЗавершениеОбмена_ОбработкаДлительнойОперации" Тогда
			
				ВладелецФормы.ОбемнЗакончился = Истина;		
			
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЕсли;
	//КонецМарк


КонецПроцедуры
