
&После("УстановитьЗаголовокВРМК")
Процедура ТБКУстановитьЗаголовокВРМК(СтруктураДанных, Элементы, НадписьЗаголовок)
	Элементы.КартинкаЧО04Возврат.Заголовок = НСтр("ru = 'Возврат за" + Символы.ПС + " текущий день (F5)'");
	Элементы.КартинкаЧО04Возврат.ТекстНевыбраннойКартинки = НСтр("ru = 'Возврат за" + Символы.ПС + " текущий день (F5)'");
КонецПроцедуры

&Вместо("ПроверитьКодМаркировкиСредствамиККТ")
Процедура ТБКПроверитьКодМаркировкиСредствамиККТ(МассивСсылокЧековДляПроверкиМарок, ФормаВладелец, ЗаголовокКнопкиИгнорировать, ОповещениеОЗавершении, ФормаПросмотра)
	
	МассивДанныхДляПроверки = Новый Массив;
	
	Для Каждого Чек Из МассивСсылокЧековДляПроверкиМарок Цикл
		
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ФормаВладелец);
		
		ИдентификаторУстройства = Неопределено;
		ТребуетсяПроверкаСредствамиККТ = Ложь;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаВладелец, "ТаблицаКассККМОрганизаций") Тогда
			
			//Вик 2025-01-16
			
			//КассыККМ = ФормаВладелец.ТаблицаКассККМОрганизаций.НайтиСтроки(
			//Новый Структура("КассаККМ", Чек.КассаККМ));
			
			КассыККМ = ФормаВладелец.ТаблицаКассККМОрганизаций.НайтиСтроки(
			Новый Структура("ПоУмолчанию", Истина)); 
			//
			
			
			Если КассыККМ.Количество() > 0 Тогда
				ИдентификаторУстройства = КассыККМ[0].ИдентификаторУстройства;
				ТребуетсяПроверкаСредствамиККТ = КассыККМ[0].ПоддерживаетПроверкуКодовМаркировки;
			КонецЕсли;
		КонецЕсли;
		
		Если ИдентификаторУстройства = Неопределено Тогда
			ПараметрыКассыККМ = ЗначениеНастроекВызовСервера.ПараметрыКассыККМ(Чек.КассаККМ);
			ИдентификаторУстройства = ПараметрыКассыККМ.ИдентификаторУстройства;
			ТребуетсяПроверкаСредствамиККТ = ПараметрыКассыККМ.ПоддерживаетПроверкуКодовМаркировки;
		КонецЕсли;
		
		Если ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ Тогда
			ККТФФД12ИСМП = ИдентификаторУстройства;
		КонецЕсли;
		
		Если ОборудованиеЧекопечатающиеУстройстваВызовСервера.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Тогда
			ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", ТребуетсяПроверкаСредствамиККТ);
			ПараметрыСканирования.Вставить("ККТФФД12ИСМП", ИдентификаторУстройства);
		КонецЕсли;
		
		ДанныеДляПроверки = Новый Массив;
		
		Для Каждого ПозицияЧека Из Чек.ПозицииЧека Цикл
			
			РезультатРаспределенияШтрихкодов = Неопределено;
			Если ПозицияЧека.Свойство("РезультатРаспределенияШтрихкодов", РезультатРаспределенияШтрихкодов)
				И НЕ РезультатРаспределенияШтрихкодов = Неопределено Тогда
				
				ЭлементДанныхДляПроверки = ШтрихкодированиеИСМПКлиент.НовыйЭлементПроверкиСредствамиККТПоДаннымРаспределения(
					РезультатРаспределенияШтрихкодов);
				
				ДанныеДляПроверки.Добавить(ЭлементДанныхДляПроверки);
				
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыПроверкиКМСредствамиККТ = ШтрихкодированиеОбщегоНазначенияИСМПКлиент.ПараметрыНачалаПроверкиКодовМаркировкиСредствамиККТ();
		ПараметрыПроверкиКМСредствамиККТ.ДанныеДляПроверки           = ДанныеДляПроверки;
		ПараметрыПроверкиКМСредствамиККТ.ПараметрыСканирования       = ПараметрыСканирования;
		ПараметрыПроверкиКМСредствамиККТ.ФормаОсновногоОбъекта       = ФормаВладелец;
		ПараметрыПроверкиКМСредствамиККТ.ФормаВспомогательная        = ФормаПросмотра;
		ПараметрыПроверкиКМСредствамиККТ.ЗаголовокКнопкиИгнорировать = ЗаголовокКнопкиИгнорировать;
		ПараметрыПроверкиКМСредствамиККТ.ПроверятьЗапросыГИСМТ       = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ПроверкаТоварныхГруппПриРозничнойПродажеГИСМТ();
		ПараметрыПроверкиКМСредствамиККТ.Вставить("Чек", Чек);
		
		ДокументСсылка = ФормаВладелец.Объект.Ссылка;
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
			ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
			ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РегистрацияБезналичнойОплаты")
			ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
			
			ПараметрыПроверкиКМСредствамиККТ.ЭтоДокументОплаты = Истина;
		КонецЕсли;
		
		МассивДанныхДляПроверки.Добавить(ПараметрыПроверкиКМСредствамиККТ);
	КонецЦикла;
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("МассивДанныхДляПроверки", МассивДанныхДляПроверки);
	ПараметрыОперации.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	ПараметрыОперации.Вставить("КоличествоОбъектовПроверки", МассивДанныхДляПроверки.Количество());
	ПараметрыОперации.Вставить("НомерТекущегоОбъектаПроверки", 0);
	
	ПроверитьКодМаркировкиСредствамиККТЗавершение(Неопределено, ПараметрыОперации);
	
КонецПроцедуры
