
&Вместо("ОбработатьАсинхронноШтрихкод")
Асинх Функция ТБКОбработатьАсинхронноШтрихкод(ПараметрыЗавершенияОбработкиШтрихкода, ОписаниеПослеЗавершения, ОперацияПробития)
	
	ПроверкаЗавершена     = Ложь;
	РезультатОбработки    = ПараметрыЗавершенияОбработкиШтрихкода.РезультатОбработкиШтрихкода;
	ПараметрыСканирования = ПараметрыЗавершенияОбработкиШтрихкода.ПараметрыСканирования;
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетПродукцияИСМП(ПараметрыСканирования.ДопустимыеВидыПродукции, Истина)
		И ШтрихкодированиеОбщегоНазначенияИСКлиент.ПрисутствуетПродукцияИСМП(РезультатОбработки.ВидыПродукции, Истина)
		И Не РезультатОбработки.ТребуетсяУточнениеДанных Тогда
		
		Результат = Ждать ОбработатьАсинхронноШтрихкодНаТСПИоТ(ПараметрыЗавершенияОбработкиШтрихкода, ОписаниеПослеЗавершения);
		
		////Марк 2026-05-15----------------------------------------------------
		//ОчиститьСообщения();
		//ТекстОшибки = 
		//"При выполнении запроса api/v1/codes/check возникла ошибка.
		//|Код состояния HTTP: 514.
		//|Текст ошибки: {
		//|  ""code"": 514,
		//|  ""details"": [],
		//|  ""message"": ""Не удалось получить ответ от ГИС МТ или ЛМ ЧЗ""
		//|}.";
		//ИННОрганизации = ОбщегоНазначенияВызовСервера.ИННОрганизации(Результат.ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования.Владелец);                             
		//Если (Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.РазрешительныйРежимКодОтвета = "200" 
		//	и (Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Продан")
		//		или Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Списан")))
		//	
		//	или (Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибкиВДеревеУпаковок
		//		Или Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ЕстьОшибки
		//		Или ЗначениеЗаполнено(Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки)
		//	И Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки = ТекстОшибки)
		//	
		//	или (ЗначениеЗаполнено(Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.ИННВладельца) И
		//		ИННОрганизации <> Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.ИННВладельца)
		//	Тогда
		//	
		//	Сообщить("ТекстОшибки = " + """" + Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ТекстОшибки + """");
		//	Сообщить("Статус марки = " +  """" + Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ДанныеШтрихкода.Статус + """");
		//	Результат.ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода.ОткрытьФормуВводаКодаМаркировки = Истина;
		//	Результат.ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования.ВыводитьСообщенияОбОшибках = Ложь;
		//	ШтрихкодированиеИСКлиент.ТБКУточнитьДанныеУПользователя(ПараметрыЗавершенияОбработкиШтрихкода.ТБКДоПараметры.ФормаВладелец, ПараметрыЗавершенияОбработкиШтрихкода.ТБКДоПараметры.ПараметрыОткрытияФормы, ПараметрыЗавершенияОбработкиШтрихкода.ТБКДоПараметры.ОповещениеПоЗавершениюУточненияДанных);
		//	
		//КонецЕсли;
		////-------------------------------------------------------------------
		
		ПроверкаЗавершена = ЗавершитьПроверкуШтрихкодаПослеПолученияДанныхТСПИоТ(Результат, ОписаниеПослеЗавершения, ОперацияПробития);
		
	Иначе
		
		ДанныеШтрихкода = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(РезультатОбработки.ДанныеШтрихкода);
		РезультатОбработки.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Ложь;
		
		ВыполнитьОбработкуОповещения(ОписаниеПослеЗавершения, Новый Структура("ДанныеВыбора, ЗапомнитьВыбор", ДанныеШтрихкода, Ложь));
		
	КонецЕсли;
	
	Возврат ПроверкаЗавершена;
	
	
КонецФункции



